# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=La herramienta de migraci\u00f3n de configuraci\u00f3n de Tomcat ha migrado la siguiente configuraci\u00f3n.
MIGRATION_COMPLETE_NAMED_FILE=La herramienta de migraci\u00f3n de configuraci\u00f3n de Tomcat ha migrado la siguiente configuraci\u00f3n desde el archivo {0}.
MIGRATION_GENERATED=La herramienta de migraci\u00f3n de configuraci\u00f3n de Tomcat ha generado la siguiente configuraci\u00f3n.
JMS_CLASS_CAST_WARNING=Atenci\u00f3n: jmsConnectionFactory de Liberty no implementa las interfaces javax.jms.QueueConnectionFactory ni javax.jms.TopiConnectionFactory. \nLas aplicaciones JMS obtendr\u00e1n una ClassCastException si intentan convertir el tipo de datos de esta f\u00e1brica de conexiones a cualquiera de estas interfaces.
FILE_UPDATED=La herramienta de migraci\u00f3n de configuraci\u00f3n de Tomcat ha actualizado la siguiente configuraci\u00f3n.
ACTION_JDBC_DRIVER=Acci\u00f3n necesaria: Para que el controlador JDBC sea accesible para el elemento dataSource de {0}, copie el controlador JDBC en la ubicaci\u00f3n {1} o modifique la configuraci\u00f3n para que apunte a la ubicaci\u00f3n del controlador JDBC.
ACTION_ORACLE_DRIVER=Acci\u00f3n necesaria: Para que el controlador de Oracle sea accesible para el elemento dataSource de {0}, copie el contenido del directorio del cliente Oracle en la ubicaci\u00f3n de la biblioteca compartida {1} o modifique la configuraci\u00f3n para que apunte a la ubicaci\u00f3n del directorio del cliente Oracle.
ACTION_USER_PASSWORDS=Acci\u00f3n necesaria: Utilice el editor de configuraci\u00f3n de Liberty para cambiar y codificar el hash de los atributos de contrase\u00f1a en la configuraci\u00f3n migrada con los valores originales sin cifrar del servidor Tomcat. Las contrase\u00f1as originales estaban cifradas con el algoritmo de resumen {0} y se han migrado en su formato cifrado.
STORAGE_REF_WARNING=Atenci\u00f3n: De forma predeterminada, Liberty almacena los datos de sesi\u00f3n en la memoria. \nPara configurar la persistencia de sesi\u00f3n para el servidor Liberty, a\u00f1ada la caracter\u00edstica sessionDatabase-1.0 y un elemento httpSessionDatabase para configurar la persistencia de sesi\u00f3n.
PATHNAME_WARNING=Atenci\u00f3n: El atributo de nombre de v\u00eda de acceso del gestor est\u00e1ndar de Tomcat no se ha migrado. De forma predeterminada, Liberty almacena los datos de sesi\u00f3n en la memoria. \nPara configurar la persistencia de sesi\u00f3n para el servidor Liberty, a\u00f1ada la caracter\u00edstica sessionDatabase-1.0 y un elemento httpSessionDatabase para configurar la persistencia de sesi\u00f3n.
MQ_RESOURCE_ADAPTER_ACTION=Acci\u00f3n necesaria: Para utilizar el proveedor de mensajer\u00eda de WebSphere MQ en Liberty, copie el adaptador de recursos de WebSphere MQ en la ubicaci\u00f3n de {0} o modifique la configuraci\u00f3n para que apunte a la ubicaci\u00f3n del adaptador de recursos de WebSphere MQ.
MQ_NATIVE_LIB_ACTION=Acci\u00f3n necesaria: Modifique el atributo nativeLibraryPath para que apunte a la ubicaci\u00f3n de las bibliotecas nativas de WebSphere MQ.
MONGO_CLASSLOADER_NEEDED_ACTION=Acci\u00f3n necesaria: Para que el controlador Java MongoDB sea accesible para la aplicaci\u00f3n, copie el controlador en la biblioteca compartida {0} o modifique la configuraci\u00f3n para que apunte a la ubicaci\u00f3n del controlador.
MULTIPLE_REDIRECT_PORTS=Atenci\u00f3n: El puerto habilitado para SSL {0} ya se ha definido por un elemento httpEndpoint y se ha inhabilitado en el elemento httpEndpoint de {1}. Especifique un puerto disponible en el atributo httpsPort para habilitar SSL en el elemento httpEndpoint.  Liberty no da soporte a varios elementos httpEndpoint con el mismo valor de atributo httpsPort. 
DEFAULT_SSL_GENERATED=Atenci\u00f3n: No se ha detectado ninguna configuraci\u00f3n SSL para el puerto habilitado para SSL {0}. Se ha generado la configuraci\u00f3n SSL predeterminada. 
PASSWORD_ENCODE_WARNING=Atenci\u00f3n: Para mejorar la seguridad del servidor, cambie y codifique la contrase\u00f1a en el elemento {0}.
HTTPS_PORT_UNSUPPORTED_PROTOCOL=Atenci\u00f3n: El puerto habilitado para SSL {0} referenciado por el elemento conector de Tomcat con el puerto {1} utiliza un protocolo que no est\u00e1 soportado en el servidor Liberty. El atributo httpsPort del elemento httpEndpoint de {2} se ha inhabilitado.
HTTPS_CONNECTOR_MISSING=Atenci\u00f3n: El elemento conector de Tomcat con el puerto {0} hace referencia a un puerto habilitado para SSL {1} que no est\u00e1 definido. El atributo httpsPort del elemento httpEndpoint de {2} se ha inhabilitado.
UNCOMMENT_VIRTUAL_HOST=Elimine el comentario de host virtual preferido para la aplicaci\u00f3n. El host virtual default_host es adecuado para la mayor\u00eda de configuraciones simples.
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=No, migrar mi aplicaci\u00f3n solo
DROPDOWN_DEFAULT_SELECT_AN_OPTION=Seleccione una opci\u00f3n
DROPDOWN_TOMCATSERVER_FILESYSTEM=S\u00ed, migrar tambi\u00e9n un servidor de mi sistema de archivos
DROPDOWN_TOMCATSERVER_WORKSPACE=S\u00ed, migrar tambi\u00e9n un servidor de mi espacio trabajo
TITLE_INFO=Informaci\u00f3n
TITLE_ERROR=Error
TITLE_LIBERTY_SELECT=Selecci\u00f3n de servidor Liberty
TITLE_APP_ALREADY_MIGRATED=Aplicaci\u00f3n migrada anteriormente a este servidor
TITLE_SERVER_ALREADY_MIGRATED=Servidor Tomcat migrado anteriormente a este servidor
TITLE_SERVER_NOT_MIGRATED=Dependencias de la configuraci\u00f3n del servidor Tomcat
TITLE_SUCCESS_DIALOG=Configuraci\u00f3n migrada satisfactoriamente
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=Configuraci\u00f3n migrada satisfactoriamente - Acci\u00f3n necesaria
TITLE_TOMCAT_SELECT=Selecci\u00f3n de servidor Tomcat
TITLE_VIRTUAL_HOST_SELECT=Vincular aplicaci\u00f3n a un host virtual
APP_ALREADY_MIGRATED=La aplicaci\u00f3n {0} se ha migrado anteriormente al servidor Liberty seleccionado, {1}.\n\nSi contin\u00faa migrando la aplicaci\u00f3n, los archivos de configuraci\u00f3n se sobrescribir\u00e1n y las referencias a los archivos de configuraci\u00f3n se pueden perder. Para evitar problemas, migre la aplicaci\u00f3n a un servidor Liberty diferente o elimine la configuraci\u00f3n migrada anteriormente del servidor Liberty.\n\n\u00bfDesea continuar con la migraci\u00f3n de la aplicaci\u00f3n?
SERVER_ALREADY_MIGRATED=Un servidor Tomcat se ha migrado anteriormente al servidor Liberty seleccionado, {0}.\n\nSi contin\u00faa migrando el servidor Tomcat seleccionado, {1}, los archivos de configuraci\u00f3n se sobrescribir\u00e1n y las referencias a los archivos de configuraci\u00f3n se pueden perder. Para evitar problemas, migre el servidor Tomcat a un servidor Liberty diferente o elimine la configuraci\u00f3n migrada anteriormente del servidor Liberty.\n\n\u00bfDesea continuar con la migraci\u00f3n del servidor Tomcat?
SERVER_NOT_MIGRATED=La aplicaci\u00f3n puede depender de valores definidos en la configuraci\u00f3n del servidor Tomcat correspondiente. Para evitar problemas, primero migre la configuraci\u00f3n del servidor Tomcat al servidor Liberty que alojar\u00e1 la aplicaci\u00f3n.\n\n\u00bfDesea migrar el servidor Tomcat y luego migrar la aplicaci\u00f3n?
LIBERTY_SERVER_CHECKBOX=Configuraci\u00f3n del servidor Liberty
APP_LOG_FILE_CHECKBOX=Archivo de registro de migraci\u00f3n de aplicaciones
SERVER_LOG_FILE_CHECKBOX=Archivo de registro de migraci\u00f3n de servidor
DESC_LIBERTY_SELECT=Seleccione un servidor Liberty. \nLa configuraci\u00f3n de Tomcat se migrar\u00e1 a este servidor.
MIGRATION_SUCCESS_DIALOG_SERVER=La configuraci\u00f3n del servidor Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nPara obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=La configuraci\u00f3n del servidor Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nSe requieren m\u00e1s acciones para completar la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=La configuraci\u00f3n del servidor Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nPara obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.\n\nSeleccione los archivos que desea abrir:
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=La configuraci\u00f3n del servidor Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nSe requieren m\u00e1s acciones para completar la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.\n\nSeleccione los archivos que desea abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION=La configuraci\u00f3n de la aplicaci\u00f3n se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nPara obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=La configuraci\u00f3n de servidor y aplicaci\u00f3n Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nPara obtener informaci\u00f3n, consulte los archivos de registro siguientes:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=La configuraci\u00f3n de la aplicaci\u00f3n se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nSe requieren m\u00e1s acciones para completar la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=La configuraci\u00f3n de servidor y aplicaci\u00f3n Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nSe requieren m\u00e1s acciones para completar la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte los siguientes archivos de registro:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=La configuraci\u00f3n de la aplicaci\u00f3n se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nPara obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.\n\nSeleccione los archivos que desea abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=La configuraci\u00f3n de servidor y aplicaci\u00f3n Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nPara obtener m\u00e1s informaci\u00f3n, consulte los archivos de registro siguientes:\n{1}\n{2}\n\nSeleccione los archivos que desea abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=La configuraci\u00f3n de la aplicaci\u00f3n se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nSe requieren m\u00e1s acciones para completar la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte el archivo de registro siguiente: {1}.\n\nSeleccione los archivos que desea abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=La configuraci\u00f3n de servidor y aplicaci\u00f3n Tomcat se ha migrado satisfactoriamente al servidor Liberty siguiente: {0}.\n\nSe requieren m\u00e1s acciones para completar la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte los archivos de registro siguientes:\n{1}\n{2}\n\nSeleccione los archivos que desea abrir:
MIGRATION_FAILURE_DIALOG=La configuraci\u00f3n no se puede migrar debido a la excepci\u00f3n siguiente:\n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=A\u00f1adiendo la aplicaci\u00f3n al servidor Liberty...
PROGRESS_COPYING_LIBERTY_SERVER=Copiando el archivo server.xml de Liberty...
PROGRESS_GENERATING_CONFIG_FILE=Generando el archivo de configuraci\u00f3n de Liberty...
PROGRESS_LOADING_CONFIG_INFO=Cargando informaci\u00f3n de configuraci\u00f3n...
PROGRESS_MIGRATING_APPLICATION=La configuraci\u00f3n de aplicaci\u00f3n se est\u00e1 migrando.
PROGRESS_MIGRATING_CONTEXT_XML=Migrando la configuraci\u00f3n del archivo context.xml...
PROGRESS_MIGRATING_SERVER=La configuraci\u00f3n de servidor Tomcat se est\u00e1 migrando.
PROGRESS_MIGRATING_SERVER_XML=Migrando la configuraci\u00f3n del archivo server.xml...
PROGRESS_MIGRATING_SHARED_LIBRARIES=Migrando las bibliotecas compartidas para or\u00edgenes de datos... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Migrando usuarios y roles de Tomcat...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE=Migrando usuarios y roles de Tomcat del archivo {0}...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Migrando usuarios y roles de Tomcat al archivo {0}...
PROGRESS_ENCODING_X_PASSWORDS=Codificando {0} contrase\u00f1as...
PROGRESS_ENCODING_PASSWORD_X_OF_Y=Codificando contrase\u00f1a {0} de {1}...
PROGRESS_MIGRATING_VARIABLES=Migrando variables de Tomcat desde el archivo catalina.properties...
PROGRESS_MIGRATING_WEB_XML=Migrando la configuraci\u00f3n del archivo web.xml...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=Publicando la aplicaci\u00f3n en el servidor Liberty...
PROGRESS_TITLE_CONFIG_MIGRATION=Progreso de la migraci\u00f3n de la configuraci\u00f3n de Tomcat
PROGRESS_UPDATING_LIBERTY_SERVER=Actualizando el archivo server.xml de Liberty...
PROGRESS_VALIDATING_LIBERTY_SERVER=Validando la configuraci\u00f3n de servidor de Liberty...
PROGRESS_VERIFYING_VIRTUAL_HOST=Verificando la configuraci\u00f3n de host virtual para la aplicaci\u00f3n...
SELECTION_NOT_SUPPORTED=La selecci\u00f3n actual no se puede migrar. Seleccione un servidor Tomcat o un proyecto Java que contenga una aplicaci\u00f3n Tomcat.
NO_CONFIG_FOUND=La selecci\u00f3n actual no se puede migrar. La configuraci\u00f3n del servidor Tomcat no se ha encontrado.
SERVER_TYPE_ERROR=El servidor seleccionado no se puede migrar. Seleccione un servidor Tomcat.       
LIBERTY_CONFIG_NOT_FOUND=La configuraci\u00f3n no se puede migrar porque no se ha encontrado la configuraci\u00f3n de servidor Liberty.
INVALID_JAVA_PROJECT=El proyecto Java seleccionado no se puede migrar porque no contiene un directorio {0}.
NO_WEB_XML=El proyecto Java seleccionado no se puede migrar porque no contiene un archivo {0}.
NOT_TOMCAT_SERVER_DIR=La selecci\u00f3n actual no se puede migrar porque no es un servidor Tomcat v\u00e1lido.
NOT_TOMCAT_SERVER_FILE=El servidor seleccionado no se puede migrar porque no contiene el archivo siguiente: {0}.
NO_LIBERTY_SERVER_XML=El servidor Liberty seleccionado no contiene un archivo de configuraci\u00f3n server.xml.
MISSING_LIBERTY_DIRECTORY=El servidor Liberty seleccionado no es v\u00e1lido. No contiene el directorio {0}.
SELECT_TOMCAT_SERVER=Seleccione el servidor Tomcat que desee migrar.
SELECT_VIRTUAL_HOST=Seleccione un host virtual para la aplicaci\u00f3n.\n\nEl host virtual default_host es adecuado para la mayor\u00eda de configuraciones simples.

# Exceptions
EXCEPT_LOG_CREATE_ERROR=La herramienta de migraci\u00f3n de configuraci\u00f3n de Tomcat no ha podido crear el archivo de registro siguiente: {0}.
INVALID_WAR_FILE=El archivo war de aplicaci\u00f3n especificado no existe o no es un archivo .war: {0}.
INVALID_OUTPUT_DIRECTORY=No se ha podido crear el directorio de salida especificado: {0}.
INVALID_DIRECTORY=El directorio especificado no es v\u00e1lido: {0}.
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= El directorio del servidor Liberty no se ha especificado.
TEMP_FILE_DELETE_FAIL=Uno o m\u00e1s de los archivos temporales creados durante la migraci\u00f3n no se ha(n) podido suprimir.

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=La aplicaci\u00f3n se ha a\u00f1adido al servidor Liberty.
LOG_ADDED_INCLUDE_FILE=El archivo de configuraci\u00f3n del servidor, {0}, se ha incluido en el archivo {1}. 
LOG_APP_CONFIG_MIG_FAILED=La configuraci\u00f3n de aplicaci\u00f3n Tomcat no se ha podido migrar debido a la siguiente excepci\u00f3n:\n{0}
LOG_APP_CONFIG_MIG_NO_SERVER=La configuraci\u00f3n de aplicaci\u00f3n Tomcat se ha migrado, pero la aplicaci\u00f3n no se ha a\u00f1adido al servidor Liberty porque no se ha proporcionado un servidor.
LOG_APP_CONFIG_MIG_WITH_ERROR=La configuraci\u00f3n de aplicaci\u00f3n Tomcat se ha migrado, pero la aplicaci\u00f3n no se ha a\u00f1adido al servidor Liberty debido a una excepci\u00f3n de publicaci\u00f3n registrada anteriormente.
LOG_APP_PUBLISH_FAILED=La aplicaci\u00f3n no se ha podido publicar en el servidor Liberty debido a la excepci\u00f3n siguiente: \n{0}
LOG_APP_PUBLISH_OK=La aplicaci\u00f3n se ha publicado satisfactoriamente en el servidor Liberty.
LOG_APP_RESOURCES_SKIP=No se migrar\u00e1n recursos de aplicaci\u00f3n porque el archivo context.xml de la aplicaci\u00f3n no existe.
LOG_APP_RESOURCES_START=Los recursos de aplicaci\u00f3n se est\u00e1n migrando desde el archivo {0} al archivo {1}.
LOG_APP_VIRTUAL_HOST_GENERATE=El archivo ibm-web-bnd.xml de la aplicaci\u00f3n se est\u00e1 generando con el host virtual {0}.
LOG_APP_VIRTUAL_HOST_START=Se est\u00e1 configurando el host virtual para la aplicaci\u00f3n.
LOG_APP_VIRTUAL_HOST_UPDATE=El archivo ibm-web-bnd.xml de la aplicaci\u00f3n se est\u00e1 actualizando con el host virtual {0}.
LOG_COPY_SERVER_XML=El contenido del archivo server.xml de Liberty original se ha guardado en el archivo {0}.
LOG_COPY_APP_WEB_BND_XML=El contenido del archivo ibm-web-bnd.xml de la aplicaci\u00f3n original se ha guardado en el archivo {0}.
LOG_GEN_TOP_LEVEL_CONFIG=Se ha generado el archivo de configuraci\u00f3n {0} y se incluir\u00e1 en el archivo server.xml de Liberty.
LOG_HDR_APP_CONTEXT_XML=Archivo context.xml de aplicaci\u00f3n = {0}
LOG_HDR_APP_NAME=Nombre de aplicaci\u00f3n = {0}
LOG_HDR_APP_WEB_XML=Archivo web.xml de aplicaci\u00f3n = {0}
LOG_HDR_LIBERTY_SERVER_DIR=Directorio del servidor Liberty = {0}
LOG_HDR_NO_APP_CONTEXT_XML=No existe un archivo context.xml de la aplicaci\u00f3n, por lo que no se migrar\u00e1.
LOG_HDR_TOMCAT_SERVER_DIR=Directorio de servidor Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=Directorio de tiempo de ejecuci\u00f3n de servidor Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=Directorio de tiempo de ejecuci\u00f3n de servidor Tomcat de CATALINA_HOME = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=Directorio de configuraci\u00f3n de servidor Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=Directorio de configuraci\u00f3n de servidor Tomcat de CATALINA_HOME = {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=La aplicaci\u00f3n no se ha a\u00f1adido al servidor Liberty debido a la siguiente excepci\u00f3n:\n{0}
LOG_BEGINNING={0} - comienzo de la entrada de registro
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=dd/MM/yy kk:mm:ss:SSS z
LOG_DELETE_FILE_ERROR=El archivo temporal {0} no se ha podido suprimir.
LOG_END={0} - cierre de la entrada de registro
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE=El archivo {0} no se ha podido cerrar.
LOG_FILE_COPIED=El archivo {0} se ha copiado desde el directorio {1} en el directorio {2}.
LOG_FILE_COPIED_ERROR=El archivo {0} no se ha copiado desde el directorio {1} en el directorio {2} debido al siguiente error:\n{3}.
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR=El controlador necesario para la base de datos {0} no se ha copiado en la ubicaci\u00f3n {1} porque el directorio de destino no existe.

LOG_MIME_TYPES_SKIP=No se migrar\u00e1 ning\u00fan artefacto web.xml del servidor porque el archivo {0} no existe.
LOG_MIME_TYPES_START=Los elementos de correlaci\u00f3n mime se est\u00e1n migrando desde el archivo {0} al archivo {1}.
LOG_RESOURCE_AND_HTTP_SKIP=No se migrar\u00e1 ning\u00fan elemento de recurso o de conector HTTP porque el archivo {0} no existe.
LOG_RESOURCE_AND_HTTP_START=Los elementos de recurso y conector de HTTP se est\u00e1n migrando desde el archivo {0} al archivo {1}.
LOG_SEC_CONSTRAINTS_SKIP=No hay ning\u00fan valor establecido en el atributo allRolesMode en las restricciones de seguridad de aplicaci\u00f3n Tomcat. El valor ser\u00e1 'strict' de forma predeterminada.
LOG_SEC_CONSTRAINTS_START=Las restricciones de seguridad de aplicaci\u00f3n se est\u00e1n migrando desde el archivo {0} al archivo {1}.
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=La configuraci\u00f3n de servidor Tomcat no se ha podido migrar debido a la excepci\u00f3n siguiente:\n{0}
LOG_SERVER_CONFIG_SUCCESSFUL=La configuraci\u00f3n de servidor Tomcat se ha migrado satisfactoriamente.
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=La configuraci\u00f3n de servidor Tomcat se ha migrado satisfactoriamente, pero se necesitan m\u00e1s actualizaciones de la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte las entradas anteriores de este archivo de registro.
LOG_SERVER_NOT_MIGRATED=Atenci\u00f3n: La aplicaci\u00f3n migrada puede depender de valores definidos en la configuraci\u00f3n del servidor Tomcat correspondiente. Para evitar problemas, migre la configuraci\u00f3n del servidor Tomcat antes de ejecutar la aplicaci\u00f3n.
LOG_SHARED_LIB_DATASOURCE=La configuraci\u00f3n de la biblioteca compartida {0} se est\u00e1 a\u00f1adiendo al archivo {1}. Esta configuraci\u00f3n est\u00e1 referenciada por elementos de origen de datos.
LOG_SHARED_LIB_CLASSLOADER=La configuraci\u00f3n de la biblioteca compartida {0} se est\u00e1 a\u00f1adiendo al archivo {1}. Esta configuraci\u00f3n est\u00e1 referenciada por elementos del cargador de clases de aplicaci\u00f3n.
LOG_STANDARD_MANAGER_SKIP=No se migrar\u00e1 ning\u00fan elemento de gestor est\u00e1ndar y de recurso porque el archivo {0} no existe.
LOG_STANDARD_MANAGER_START=Los elementos de gestor est\u00e1ndar y de recurso se est\u00e1n migrando desde el archivo {0} al archivo {1}.
LOG_TOMCAT_APP_MIG_OK=La configuraci\u00f3n de aplicaci\u00f3n Tomcat se ha migrado satisfactoriamente.
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=La configuraci\u00f3n de aplicaci\u00f3n Tomcat se ha migrado satisfactoriamente, pero se necesitan m\u00e1s actualizaciones de la configuraci\u00f3n. Para obtener m\u00e1s informaci\u00f3n, consulte las entradas anteriores de este archivo de registro.
LOG_UPDATE_LIBERTY_SERVER_START=El servidor Liberty se est\u00e1 actualizando con la configuraci\u00f3n migrada.
LOG_USERS_EXCEPTION=La herramienta de migraci\u00f3n no ha podido determinar si hay archivos adicionales de usuario y roles debido a la excepci\u00f3n siguiente:\n{0}
LOG_USERS_NO_FILE=No se ha migrado ning\u00fan archivo tomcat-users. Para ver si se han saltado los archivos porque no se han podido encontrar, consulte las dem\u00e1s entradas de este archivo de registro.
LOG_USERS_SKIP=No se migrar\u00e1 ning\u00fan elemento de usuarios y roles porque el archivo {0} no existe.
LOG_USERS_START=Los elementos de usuario y rol se est\u00e1n migrando desde el archivo {0} al archivo {1}.
LOG_USERS_TEMP_FILE_ERROR=La herramienta de migraci\u00f3n no ha podido encontrar el archivo temporal {0}.
LOG_VARIABLES_START=Las propiedades de Tomcat referenciadas por la configuraci\u00f3n generada se est\u00e1n migrando desde el archivo {0} al archivo {1}.
LOG_VARIABLES_SCANNING_EXCEPTION=La herramienta de migraci\u00f3n no ha podido determinar si el archivo {0} hace referencia a alguna propiedad de Tomcat debido a la excepci\u00f3n siguiente:\n{1}
LOG_WAMT_EXCEPTION=La herramienta de migraci\u00f3n no ha podido determinar si la aplicaci\u00f3n utiliza MongoDB debido a la excepci\u00f3n siguiente: {0}
LOG_WAMT_NOT_FOUND=La herramienta de migraci\u00f3n no ha podido determinar si la aplicaci\u00f3n utiliza MongoDB. Si la aplicaci\u00f3n utiliza MongoDB, instale la Herramienta de migraci\u00f3n de aplicaciones \u2013 De Apache Tomcat a WebSphere, y vuelva a migrar la aplicaci\u00f3n.

LOG_ACTION_VARIABLE_NOT_MIGRATED=Acci\u00f3n necesaria: No se ha podido determinar el valor de la variable {0} referenciada en el archivo {1}. Configure la variable en el servidor Liberty o modifique la configuraci\u00f3n para que no haga referencia a la variable. La ubicaci\u00f3n predeterminada de las variables migradas es migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=Acci\u00f3n necesaria: La variable {0} referenciada en el archivo {1} no se ha migrado porque no es un nombre de variable v\u00e1lido en el servidor Liberty. Configure una variable con un nombre v\u00e1lido o modifique la configuraci\u00f3n para que no haga referencia a la variable. La ubicaci\u00f3n predeterminada de las variables migradas es migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=Acci\u00f3n necesaria: El valor {0} de la variable {1} referenciada en el archivo {2} no es v\u00e1lido en el servidor Liberty, por lo que la variable no se ha migrado. Configure una variable sin una referencia de variable en su valor o modifique la configuraci\u00f3n para que no haga referencia a la variable. La ubicaci\u00f3n predeterminada de las variables migradas es migratedConfig/variables.xml.
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=Atenci\u00f3n: El elemento de dominio con el atributo className {0} no se ha migrado. La herramienta de migraci\u00f3n no soporta la migraci\u00f3n de elementos de dominio ubicados en el archivo context.xml de la aplicaci\u00f3n. Si desea migrar el elemento de dominio, mueva el elemento al archivo context.xml que se encuentra en el directorio de configuraci\u00f3n de Tomcat para que el elemento se migre con la configuraci\u00f3n del servidor Tomcat.
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=Atenci\u00f3n: El elemento de conector con el puerto {0} y el protocolo {1} no se ha migrado. El servidor Liberty no da soporte a este protocolo.
LOG_ATTENTION_CONNECTOR_PORT_ZERO=Atenci\u00f3n: Un elemento de conector con el puerto 0 no se ha migrado. El servidor Liberty no da soporte a una definici\u00f3n de puerto de 0.
LOG_ATTENTION_EXCEPTION=Atenci\u00f3n: La herramienta de migraci\u00f3n no ha podido determinar si los elementos no se han migrado desde el archivo {0} debido a la excepci\u00f3n siguiente:\n{0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=Atenci\u00f3n: El elemento de recurso JDBC con el atributo de nombre {0} y el atributo driverClassName {1} no se ha migrado. Configure el elemento dataSource en el servidor Liberty si el elemento es necesario.
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=Atenci\u00f3n: El elemento de dominio del origen de datos con el atributo dataSourceName {0} no se ha migrado. La herramienta de migraci\u00f3n no soporta la migraci\u00f3n de este elemento de dominio. Configure un registro de usuarios personalizado en el servidor Liberty si el elemento es necesario.
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=Atenci\u00f3n: El elemento de dominio JAAS con el atributo appName {0} no se ha migrado. La herramienta de migraci\u00f3n no soporta la migraci\u00f3n de este elemento de dominio. Configure un m\u00f3dulo de inicio de sesi\u00f3n personalizado JAAS en el servidor Liberty si el elemento es necesario. 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=Atenci\u00f3n: El elemento de dominio JDBC con el atributo driverName {0} no se ha migrado. La herramienta de migraci\u00f3n no soporta la migraci\u00f3n de este elemento de dominio. Configure un registro de usuarios personalizado en el servidor Liberty si el elemento es necesario.
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=Atenci\u00f3n: El elemento de dominio JNDI con el atributo connectionURL {0} no se ha migrado. La herramienta de migraci\u00f3n no soporta la migraci\u00f3n de este elemento de dominio. Configure un registro de usuarios LDAP en el servidor Liberty si el elemento es necesario.
LOG_ATTENTION_MANAGER_NOT_MIGRATED=Atenci\u00f3n: El elemento de gestor con el atributo className {0} no se ha migrado. La herramienta de migraci\u00f3n no soporta la migraci\u00f3n del elemento de gestor. Para configurar la persistencia de sesi\u00f3n para el servidor Liberty, a\u00f1ada la caracter\u00edstica sessionDatabase-1.0 y especifique los elementos httpSession y httpSessionDatabase en la caracter\u00edstica.
LOG_ATTENTION_REALM_NOT_MIGRATED=Atenci\u00f3n: El elemento de dominio con el atributo className {0} no se ha migrado. La herramienta de migraci\u00f3n no soporta la migraci\u00f3n de este elemento de dominio.

LOG_WARNING_PW_NOT_ENCODED=Atenci\u00f3n: El atributo de contrase\u00f1a no se ha codificado.
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=Atenci\u00f3n: El atributo de contrase\u00f1a no se ha codificado porque hace referencia a una variable. Para mejorar la seguridad del servidor, localice la variable referenciada y aseg\u00farese de que el valor se codifica.
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=Atenci\u00f3n: El atributo de contrase\u00f1a no se ha codificado debido a la excepci\u00f3n siguiente:\n{0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=Atenci\u00f3n: Los atributos de contrase\u00f1a no se han codificado debido a que no se ha encontrado el directorio bin de Liberty.

LOG_BINARY_SCANNER_NOT_FOUND=No se ha podido hallar el explorador binario en el sistema. Como resultado, es posible que falte la configuraci\u00f3n de MongoDB. Verifique que incluye cualquier configuraci\u00f3n necesaria si la aplicaci\u00f3n utiliza MongoDB.
LOG_RULE_DIR_NOT_CREATED=No se ha podido crear un directorio temporal en el sistema de archivos. Como resultado, es posible que falte la configuraci\u00f3n de MongoDB. Verifique que incluye cualquier configuraci\u00f3n necesaria si la aplicaci\u00f3n utiliza MongoDB.
LOG_RULE_FILE_NOT_COPIED=La regla para detectar el uso de Mongo no se ha podido copiar al sistema de archivos. Como resultado, es posible que falte la configuraci\u00f3n de Mongo. Verifique que incluye cualquier configuraci\u00f3n necesaria si la aplicaci\u00f3n utiliza MongoDB.
LOG_BINARY_SCAN_FAILURE=El explorador binario no se ha podido ejecutar. Como resultado, es posible que falte la configuraci\u00f3n de MongoDB. Verifique que incluye cualquier configuraci\u00f3n necesaria si la aplicaci\u00f3n utiliza MongoDB.
LOG_SCAN_OUTPUT_FILE_FAILURE=No se ha podido crear el archivo de salida del explorador debido al siguiente error:\n{0}
LOG_MONGO_EXCEPTION=Se ha producido la siguiente excepci\u00f3n al explorar el uso de MongoDB en la aplicaci\u00f3n:\n{0}

TITLE_APP_CONFIG=Migraci\u00f3n de configuraci\u00f3n de aplicaci\u00f3n Tomcat
TITLE_SERVER_CONFIG=Migraci\u00f3n de configuraci\u00f3n de servidor Tomcat
