# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=A k\u00f6vetkez\u0151 konfigur\u00e1ci\u00f3t a Tomcat konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z \u00e1ll\u00edtotta \u00e1t.
MIGRATION_COMPLETE_NAMED_FILE=A k\u00f6vetkez\u0151 konfigur\u00e1ci\u00f3t a Tomcat konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z \u00e1ll\u00edtotta \u00e1t a(z) {0} f\u00e1jlb\u00f3l.
MIGRATION_GENERATED=A k\u00f6vetkez\u0151 konfigur\u00e1ci\u00f3t a Tomcat konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z \u00e1ll\u00edtotta el\u0151.
JMS_CLASS_CAST_WARNING=Figyelem: a Liberty jmsConnectionFactory nem val\u00f3s\u00edtja meg a javax.jms.QueueConnectionFactory \u00e9s a javax.jms.TopiConnectionFactory fel\u00fcletet. \nA JMS alkalmaz\u00e1sok ClassCastException kiv\u00e9telt kapnak, ha megk\u00eds\u00e9rlik k\u00e9nyszer\u00edteni ezt a kapcsolatgy\u00e1rt\u00f3t b\u00e1rmelyik fel\u00fcletre.
FILE_UPDATED=A k\u00f6vetkez\u0151 konfigur\u00e1ci\u00f3t a Tomcat konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z friss\u00edtette.
ACTION_JDBC_DRIVER=Teend\u0151: Ahhoz, hogy a JDBC illeszt\u0151programot el\u00e9rhet\u0151v\u00e9 tegye a(z) {0} dataSource elem sz\u00e1m\u00e1ra, m\u00e1solja \u00e1t a JDBC illeszt\u0151programot a(z) {1} helyre, vagy m\u00f3dos\u00edtsa a konfigur\u00e1ci\u00f3t, hogy a JDBC illeszt\u0151program hely\u00e9re mutasson.
ACTION_ORACLE_DRIVER=Teend\u0151: Ahhoz, hogy az Oracle illeszt\u0151programot el\u00e9rhet\u0151v\u00e9 tegye a(z) {0} dataSource elem sz\u00e1m\u00e1ra, m\u00e1solja \u00e1t az Oracle \u00fcgyf\u00e9l k\u00f6nyvt\u00e1r tartalm\u00e1t a(z) {1} megosztott k\u00f6nyvt\u00e1r hely\u00e9re, vagy m\u00f3dos\u00edtsa a konfigur\u00e1ci\u00f3t, hogy a Oracle illeszt\u0151program hely\u00e9re mutasson.
ACTION_USER_PASSWORDS=Teend\u0151: Haszn\u00e1lja a Liberty konfigur\u00e1ci\u00f3 szerkeszt\u0151t az \u00e1t\u00e1ll\u00edtott konfigur\u00e1ci\u00f3ban l\u00e9v\u0151 jelsz\u00f3 attrib\u00fatumok m\u00f3dos\u00edt\u00e1s\u00e1hoz \u00e9s kivonat k\u00f3dol\u00e1s\u00e1hoz a Tomcat kiszolg\u00e1l\u00f3r\u00f3l sz\u00e1rmaz\u00f3 eredeti titkos\u00edt\u00e1s n\u00e9lk\u00fcli \u00e9rt\u00e9kekre. Az eredeti jelszavak a(z) {0} kivonat algoritmussal voltak titkos\u00edtva, \u00e9s titkos\u00edtott form\u00e1ban lettek \u00e1t\u00e1ll\u00edtva.
STORAGE_REF_WARNING=Figyelem: Alap\u00e9rtelmez\u00e9s szerint a Liberty a munkamenetadatokat a mem\u00f3ri\u00e1ban t\u00e1rolja. \nA munkamenet perzisztencia konfigur\u00e1l\u00e1s\u00e1hoz a Liberty kiszolg\u00e1l\u00f3n, adja hozz\u00e1 a sessionDatabase-1.0 szolg\u00e1ltat\u00e1st \u00e9s egy httpSessionDatabase elemet a munkamenet perzisztencia konfigur\u00e1l\u00e1sa \u00e9rdek\u00e9ben.
PATHNAME_WARNING=Figyelem: A Tomcat Standard Managerb\u0151l sz\u00e1rmaz\u00f3 pathname attrib\u00fatum nem lett \u00e1t\u00e1ll\u00edtva. Alap\u00e9rtelmez\u00e9s szerint a Liberty a munkamenetadatokat a mem\u00f3ri\u00e1ban t\u00e1rolja. \nA munkamenet perzisztencia konfigur\u00e1l\u00e1s\u00e1hoz a Liberty kiszolg\u00e1l\u00f3n, adja hozz\u00e1 a sessionDatabase-1.0 szolg\u00e1ltat\u00e1st \u00e9s egy httpSessionDatabase elemet a munkamenet perzisztencia konfigur\u00e1l\u00e1sa \u00e9rdek\u00e9ben.
MQ_RESOURCE_ADAPTER_ACTION=Teend\u0151: A WebSphere MQ \u00fczenetkezel\u00e9s szolg\u00e1ltat\u00f3 haszn\u00e1lat\u00e1hoz Liberty kiszolg\u00e1l\u00f3n, m\u00e1solja \u00e1t a WebSphere MQ er\u0151forr\u00e1s-illeszt\u0151t a(z) {0} helyre, vagy m\u00f3dos\u00edtsa a konfigur\u00e1ci\u00f3t, hogy a WebSphere MQ er\u0151forr\u00e1s-illeszt\u0151 hely\u00e9re mutasson.
MQ_NATIVE_LIB_ACTION=Teend\u0151: M\u00f3dos\u00edtsa a nativeLibraryPath attrib\u00fatumot, hogy a WebSphere MQ nat\u00edv f\u00fcggv\u00e9nyt\u00e1rak hely\u00e9re mutasson.
MONGO_CLASSLOADER_NEEDED_ACTION=Teend\u0151: Ahhoz, hogy a MongoDB Java illeszt\u0151programot el\u00e9rhet\u0151v\u00e9 tegye az alkalmaz\u00e1s sz\u00e1m\u00e1ra, m\u00e1solja \u00e1t az illeszt\u0151programot a(z) {0} megosztott k\u00f6nyvt\u00e1rba, vagy m\u00f3dos\u00edtsa a konfigur\u00e1ci\u00f3t, hogy az illeszt\u0151program hely\u00e9re mutasson.
MULTIPLE_REDIRECT_PORTS=Figyelem: Az SSL-k\u00e9pes {0} portot egy httpEndpoint elem m\u00e1r meghat\u00e1rozza, \u00e9s a(z) {1} httpEndpoint elemben le lett tiltva. Adjon meg egy el\u00e9rhet\u0151 portot a httpsPort attrib\u00fatumn\u00e1l az SSL enged\u00e9lyez\u00e9s\u00e9hez a httpEndpoint elemhez.  A Liberty nem t\u00e1mogat t\u00f6bb, azonos httpsPort attrib\u00fatum\u00e9rt\u00e9kkel be\u00e1ll\u00edtott httpEndpoint elemet. 
DEFAULT_SSL_GENERATED=Figyelem: Nem \u00e9szlelhet\u0151 SSL konfigur\u00e1ci\u00f3 az SSL-k\u00e9pes {0} porthoz. Az alap\u00e9rtelmezett SSL konfigur\u00e1ci\u00f3 el\u0151\u00e1ll\u00edt\u00e1sra ker\u00fclt. 
PASSWORD_ENCODE_WARNING=Figyelem: A kiszolg\u00e1l\u00f3 biztons\u00e1g\u00e1nak \u00e9rdek\u00e9ben m\u00f3dos\u00edtsa \u00e9s k\u00f3dolja a(z) {0} elem jelszav\u00e1t.
HTTPS_PORT_UNSUPPORTED_PROTOCOL=Figyelem: A(z) {1} port \u00e9rt\u00e9k\u0171 Tomcat Connector elem \u00e1ltal hivatkozott SSL-k\u00e9pes {0} port egy olyan protokollt haszn\u00e1l, amelyet a Liberty kiszolg\u00e1l\u00f3 nem t\u00e1mogat. A(z) {2} httpEndpoint elem httpsPort attrib\u00fatuma le lett tiltva.
HTTPS_CONNECTOR_MISSING=Figyelem: A(z) {0} portot tartalmaz\u00f3 Tomcat Connector elem egy olyan SSL-k\u00e9pes {1} portra hivatkozik, amely nincs meghat\u00e1rozva. A(z) {2} httpEndpoint elem httpsPort attrib\u00fatuma le lett tiltva.
UNCOMMENT_VIRTUAL_HOST=T\u00f6r\u00f6lje a megjegyz\u00e9sjelet az alkalmaz\u00e1s el\u0151nyben r\u00e9szes\u00edtett virtu\u00e1lis hosztj\u00e1n\u00e1l. A default_host virtu\u00e1lis hoszt a legegyszer\u0171bb konfigur\u00e1ci\u00f3khoz megfelel\u0151.
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=Nem, csak az alkalmaz\u00e1somat \u00e1ll\u00edtsa \u00e1t
DROPDOWN_DEFAULT_SELECT_AN_OPTION=V\u00e1lasszon
DROPDOWN_TOMCATSERVER_FILESYSTEM=Igen, \u00e1ll\u00edtson \u00e1t egy kiszolg\u00e1l\u00f3t is a f\u00e1jlrendszeremr\u0151l
DROPDOWN_TOMCATSERVER_WORKSPACE=Igen, \u00e1ll\u00edtson \u00e1t egy kiszolg\u00e1l\u00f3t is a munkater\u00fcletemr\u0151l
TITLE_INFO=Inform\u00e1ci\u00f3
TITLE_ERROR=Hiba
TITLE_LIBERTY_SELECT=Liberty kiszolg\u00e1l\u00f3 kiv\u00e1laszt\u00e1sa
TITLE_APP_ALREADY_MIGRATED=Az alkalmaz\u00e1s kor\u00e1bban \u00e1t lett \u00e1ll\u00edtva erre a kiszolg\u00e1l\u00f3ra
TITLE_SERVER_ALREADY_MIGRATED=A Tomcat kiszolg\u00e1l\u00f3 kor\u00e1bban \u00e1t lett \u00e1ll\u00edtva erre a kiszolg\u00e1l\u00f3ra
TITLE_SERVER_NOT_MIGRATED=Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 f\u00fcgg\u0151s\u00e9gek
TITLE_SUCCESS_DIALOG=A konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa siker\u00fclt
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=A konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa siker\u00fclt - Int\u00e9zked\u00e9s sz\u00fcks\u00e9ges
TITLE_TOMCAT_SELECT=Tomcat kiszolg\u00e1l\u00f3 kiv\u00e1laszt\u00e1sa
TITLE_VIRTUAL_HOST_SELECT=Alkalmaz\u00e1s k\u00f6t\u00e9se egy virtu\u00e1lis hoszthoz
APP_ALREADY_MIGRATED=A(z) {0} alkalmaz\u00e1s kor\u00e1bban \u00e1t lett \u00e1ll\u00edtva a kiv\u00e1lasztott {1} Liberty kiszolg\u00e1l\u00f3ra.\n\nHa folytatja az alkalmaz\u00e1s \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t, akkor a konfigur\u00e1ci\u00f3s f\u00e1jlok fel\u00fcl lesznek \u00edrva, \u00e9s a konfigur\u00e1ci\u00f3s f\u00e1jlokra mutat\u00f3 hivatkoz\u00e1sok elveszhetnek. A probl\u00e9m\u00e1k elker\u00fcl\u00e9se \u00e9rdek\u00e9ben \u00e1ll\u00edtsa \u00e1t az alkalmaz\u00e1st egy m\u00e1sik Liberty kiszolg\u00e1l\u00f3ra, vagy t\u00e1vol\u00edtsa el a kor\u00e1bban \u00e1t\u00e1ll\u00edtott konfigur\u00e1ci\u00f3t a Liberty kiszolg\u00e1l\u00f3r\u00f3l. \n\nFolytatja az alkalmaz\u00e1s \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t?
SERVER_ALREADY_MIGRATED=Egy Tomcat kiszolg\u00e1l\u00f3 kor\u00e1bban \u00e1t lett \u00e1ll\u00edtva a kiv\u00e1lasztott {0} Liberty kiszolg\u00e1l\u00f3ra.\n\nHa folytatja a kiv\u00e1lasztott {1} Tomcat kiszolg\u00e1l\u00f3 \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t, akkor a konfigur\u00e1ci\u00f3s f\u00e1jlok fel\u00fcl lesznek \u00edrva, \u00e9s a konfigur\u00e1ci\u00f3s f\u00e1jlokra mutat\u00f3 hivatkoz\u00e1sok elveszhetnek. A probl\u00e9m\u00e1k elker\u00fcl\u00e9se \u00e9rdek\u00e9ben \u00e1ll\u00edtsa \u00e1t a Tomcat kiszolg\u00e1l\u00f3t egy m\u00e1sik Liberty kiszolg\u00e1l\u00f3ra, vagy t\u00e1vol\u00edtsa el a kor\u00e1bban \u00e1t\u00e1ll\u00edtott konfigur\u00e1ci\u00f3t a Liberty kiszolg\u00e1l\u00f3r\u00f3l. \n\nFolytatja a kiszolg\u00e1l\u00f3 \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t?
SERVER_NOT_MIGRATED=Az alkalmaz\u00e1s f\u00fcgghet a megfelel\u0151 Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3ban meghat\u00e1rozott be\u00e1ll\u00edt\u00e1sokt\u00f3l. A probl\u00e9m\u00e1k elker\u00fcl\u00e9se \u00e9rdek\u00e9ben el\u0151sz\u00f6r \u00e1ll\u00edtsa \u00e1t a Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3t a Liberty kiszolg\u00e1l\u00f3ra, amely az alkalmaz\u00e1st futtatni fogja. \n\n\u00c1t\u00e1ll\u00edtja a Tomcat kiszolg\u00e1l\u00f3t, majd ut\u00e1na az alkalmaz\u00e1s\u00e1t?
LIBERTY_SERVER_CHECKBOX=Liberty kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3
APP_LOG_FILE_CHECKBOX=Alkalmaz\u00e1s\u00e1t\u00e1ll\u00edt\u00e1si napl\u00f3f\u00e1jl
SERVER_LOG_FILE_CHECKBOX=Kiszolg\u00e1l\u00f3\u00e1t\u00e1ll\u00edt\u00e1si napl\u00f3f\u00e1jl
DESC_LIBERTY_SELECT=V\u00e1lasszon ki egy Liberty kiszolg\u00e1l\u00f3t. \nA Tomcat konfigur\u00e1ci\u00f3 erre a kiszolg\u00e1l\u00f3ra lesz \u00e1t\u00e1ll\u00edtva.
MIGRATION_SUCCESS_DIALOG_SERVER=A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi int\u00e9zked\u00e9s sz\u00fcks\u00e9ges a konfigur\u00e1ci\u00f3 befejez\u00e9s\u00e9hez. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.\n\nV\u00e1lassza ki a megnyitni k\u00edv\u00e1nt f\u00e1jlokat:
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi int\u00e9zked\u00e9s sz\u00fcks\u00e9ges a konfigur\u00e1ci\u00f3 befejez\u00e9s\u00e9hez. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.\n\nV\u00e1lassza ki a megnyitni k\u00edv\u00e1nt f\u00e1jlokat:
MIGRATION_SUCCESS_DIALOG_APPLICATION=Az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=A Tomcat kiszolg\u00e1l\u00f3 \u00e9s az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlokat: \n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=Az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi int\u00e9zked\u00e9s sz\u00fcks\u00e9ges a konfigur\u00e1ci\u00f3 befejez\u00e9s\u00e9hez. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=A Tomcat kiszolg\u00e1l\u00f3 \u00e9s az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi int\u00e9zked\u00e9s sz\u00fcks\u00e9ges a konfigur\u00e1ci\u00f3 befejez\u00e9s\u00e9hez. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlokat: \n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=Az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.\n\nV\u00e1lassza ki a megnyitni k\u00edv\u00e1nt f\u00e1jlokat:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=A Tomcat kiszolg\u00e1l\u00f3 \u00e9s az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlokat: \n{1}\n{2}\n\nV\u00e1lassza ki a megnyitni k\u00edv\u00e1nt f\u00e1jlt:
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=Az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi int\u00e9zked\u00e9s sz\u00fcks\u00e9ges a konfigur\u00e1ci\u00f3 befejez\u00e9s\u00e9hez. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {1}.\n\nV\u00e1lassza ki a megnyitni k\u00edv\u00e1nt f\u00e1jlokat:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=A Tomcat kiszolg\u00e1l\u00f3 \u00e9s az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a k\u00f6vetkez\u0151 Liberty kiszolg\u00e1l\u00f3ra sikeres volt: {0}.\n\nTov\u00e1bbi int\u00e9zked\u00e9s sz\u00fcks\u00e9ges a konfigur\u00e1ci\u00f3 befejez\u00e9s\u00e9hez. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlokat: \n{1}\n{2}\n\nV\u00e1lassza ki a megnyitni k\u00edv\u00e1nt f\u00e1jlt:
MIGRATION_FAILURE_DIALOG=A konfigur\u00e1ci\u00f3 nem \u00e1ll\u00edthat\u00f3 \u00e1t a k\u00f6vetkez\u0151 kiv\u00e9tel miatt: \n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=Az alkalmaz\u00e1s hozz\u00e1ad\u00e1sa a Liberty kiszolg\u00e1l\u00f3hoz...
PROGRESS_COPYING_LIBERTY_SERVER=A Liberty server.xml f\u00e1jl m\u00e1sol\u00e1sa...
PROGRESS_GENERATING_CONFIG_FILE=A Liberty konfigur\u00e1ci\u00f3s f\u00e1jl el\u0151\u00e1ll\u00edt\u00e1sa...
PROGRESS_LOADING_CONFIG_INFO=Konfigur\u00e1ci\u00f3s inform\u00e1ci\u00f3k bet\u00f6lt\u00e9se...
PROGRESS_MIGRATING_APPLICATION=Az alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa folyamatban van.
PROGRESS_MIGRATING_CONTEXT_XML=Konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a context.xml f\u00e1jlb\u00f3l...
PROGRESS_MIGRATING_SERVER=A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa folyamatban van...
PROGRESS_MIGRATING_SERVER_XML=Konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a server.xml f\u00e1jlb\u00f3l...
PROGRESS_MIGRATING_SHARED_LIBRARIES=Adatforr\u00e1sok megosztott k\u00f6nyvt\u00e1rainak \u00e1t\u00e1ll\u00edt\u00e1sa... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Tomcat felhaszn\u00e1l\u00f3k \u00e9s szerepek \u00e1t\u00e1ll\u00edt\u00e1sa...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE=Tomcat felhaszn\u00e1l\u00f3k \u00e9s szerepek \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlb\u00f3l...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Tomcat felhaszn\u00e1l\u00f3k \u00e9s szerepek \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlba...
PROGRESS_ENCODING_X_PASSWORDS={0} jelsz\u00f3 k\u00f3dol\u00e1sa...
PROGRESS_ENCODING_PASSWORD_X_OF_Y={0} / {1} jelsz\u00f3 k\u00f3dol\u00e1sa...
PROGRESS_MIGRATING_VARIABLES=Tomcat v\u00e1ltoz\u00f3k \u00e1t\u00e1ll\u00edt\u00e1sa a catalina.properties f\u00e1jlb\u00f3l...
PROGRESS_MIGRATING_WEB_XML=Konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa a web.xml f\u00e1jlb\u00f3l...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=Az alkalmaz\u00e1s k\u00f6zz\u00e9t\u00e9tele a Liberty kiszolg\u00e1l\u00f3n...
PROGRESS_TITLE_CONFIG_MIGRATION=Tomcat konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1si folyamat
PROGRESS_UPDATING_LIBERTY_SERVER=A Liberty server.xml f\u00e1jl friss\u00edt\u00e9se...
PROGRESS_VALIDATING_LIBERTY_SERVER=A Liberty kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e9rv\u00e9nyes\u00edt\u00e9se...
PROGRESS_VERIFYING_VIRTUAL_HOST=Az alkalmaz\u00e1s virtu\u00e1lis hoszt konfigur\u00e1ci\u00f3j\u00e1nak ellen\u0151rz\u00e9se...
SELECTION_NOT_SUPPORTED=A jelenlegi v\u00e1laszt\u00e1s nem \u00e1ll\u00edthat\u00f3 \u00e1t. Egy Tomcat alkalmaz\u00e1st tartalmaz\u00f3 Tomcat kiszolg\u00e1l\u00f3t vagy egy Java projektet v\u00e1lasszon ki.
NO_CONFIG_FOUND=A jelenlegi v\u00e1laszt\u00e1s nem \u00e1ll\u00edthat\u00f3 \u00e1t. A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 nem tal\u00e1lhat\u00f3.
SERVER_TYPE_ERROR=A kiv\u00e1lasztott kiszolg\u00e1l\u00f3 nem \u00e1ll\u00edthat\u00f3 \u00e1t. V\u00e1lasszon ki egy Tomcat kiszolg\u00e1l\u00f3t.       
LIBERTY_CONFIG_NOT_FOUND=A konfigur\u00e1ci\u00f3 nem \u00e1ll\u00edthat\u00f3 \u00e1t, mert a Liberty kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 nem tal\u00e1lhat\u00f3.
INVALID_JAVA_PROJECT=A kiv\u00e1lasztott Java projekt nem \u00e1ll\u00edthat\u00f3 \u00e1t, mert nem tartalmaz egy {0} k\u00f6nyvt\u00e1rat.
NO_WEB_XML=A kiv\u00e1lasztott Java projekt nem \u00e1ll\u00edthat\u00f3 \u00e1t, mert nem tartalmaz egy {0} f\u00e1jlt.
NOT_TOMCAT_SERVER_DIR=A jelenlegi v\u00e1laszt\u00e1s nem \u00e1ll\u00edthat\u00f3 \u00e1t, mert az nem egy \u00e9rv\u00e9nyes Tomcat kiszolg\u00e1l\u00f3t.
NOT_TOMCAT_SERVER_FILE=A kiv\u00e1lasztott kiszolg\u00e1l\u00f3 nem \u00e1ll\u00edthat\u00f3 \u00e1t, mert nem tartalmazza a k\u00f6vetkez\u0151 f\u00e1jlt: {0}.
NO_LIBERTY_SERVER_XML=A kiv\u00e1lasztott Liberty kiszolg\u00e1l\u00f3 nem tartalmaz egy server.xml konfigur\u00e1ci\u00f3s f\u00e1jlt.
MISSING_LIBERTY_DIRECTORY=A kiv\u00e1lasztott Liberty kiszolg\u00e1l\u00f3 \u00e9rv\u00e9nytelen. Nem tartalmazza a(z) {0} k\u00f6nyvt\u00e1rat.
SELECT_TOMCAT_SERVER=V\u00e1lasszon ki egy \u00e1t\u00e1ll\u00edtand\u00f3 Tomcat kiszolg\u00e1l\u00f3t.
SELECT_VIRTUAL_HOST=V\u00e1lasszon ki egy virtu\u00e1lis hosztot az alkalmaz\u00e1s sz\u00e1m\u00e1ra. \n\nA default_host virtu\u00e1lis hoszt a legegyszer\u0171bb konfigur\u00e1ci\u00f3khoz megfelel\u0151.

# Exceptions
EXCEPT_LOG_CREATE_ERROR=A Tomcat konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem tudta l\u00e9trehozni a k\u00f6vetkez\u0151 napl\u00f3f\u00e1jlt: {0}.
INVALID_WAR_FILE=A megadott alkalmaz\u00e1s war f\u00e1jl nem l\u00e9tezik vagy nem egy .war f\u00e1jl: {0}.
INVALID_OUTPUT_DIRECTORY=A megadott kimeneti k\u00f6nyvt\u00e1r nem hozhat\u00f3 l\u00e9tre: {0}.
INVALID_DIRECTORY=A megadott k\u00f6nyvt\u00e1r \u00e9rv\u00e9nytelen: {0}.
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= A Liberty kiszolg\u00e1l\u00f3 k\u00f6nyvt\u00e1ra nem lett megadva.
TEMP_FILE_DELETE_FAIL=Az \u00e1t\u00e1ll\u00edt\u00e1s sor\u00e1n l\u00e9trehozott ideiglenes f\u00e1jl(ok) t\u00f6rl\u00e9se meghi\u00fasult.

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=Az alkalmaz\u00e1s hozz\u00e1ad\u00e1sra ker\u00fclt a Liberty kiszolg\u00e1l\u00f3hoz.
LOG_ADDED_INCLUDE_FILE=A(z) {0} kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3s f\u00e1jl bele lett foglalva a(z) {1} f\u00e1jlba. 
LOG_APP_CONFIG_MIG_FAILED=A Tomcat alkalmaz\u00e1s konfigur\u00e1ci\u00f3 nem \u00e1ll\u00edthat\u00f3 \u00e1t a k\u00f6vetkez\u0151 kiv\u00e9tel miatt: \n{0}
LOG_APP_CONFIG_MIG_NO_SERVER=A Tomcat alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t lett \u00e1ll\u00edtva, azonban az alkalmaz\u00e1s nem lett hozz\u00e1adva a Liberty kiszolg\u00e1l\u00f3hoz, mert nem lett megadva egy kiszolg\u00e1l\u00f3.
LOG_APP_CONFIG_MIG_WITH_ERROR=A Tomcat alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t lett \u00e1ll\u00edtva, azonban az alkalmaz\u00e1s egy kor\u00e1bban napl\u00f3zott k\u00f6zz\u00e9t\u00e9teli kiv\u00e9tel miatt nem lett hozz\u00e1adva a Liberty kiszolg\u00e1l\u00f3hoz.
LOG_APP_PUBLISH_FAILED=Az alkalmaz\u00e1s nem tehet\u0151 k\u00f6zz\u00e9 a Liberty kiszolg\u00e1l\u00f3n a k\u00f6vetkez\u0151 kiv\u00e9tel miatt: \n{0}
LOG_APP_PUBLISH_OK=Az alkalmaz\u00e1s sikeresen k\u00f6zz\u00e9 lett t\u00e9ve a Liberty kiszolg\u00e1l\u00f3n.
LOG_APP_RESOURCES_SKIP=Nem lesznek \u00e1t\u00e1ll\u00edtva alkalmaz\u00e1s er\u0151forr\u00e1sok, mert az alkalmaz\u00e1s context.xml f\u00e1jl nem l\u00e9tezik.
LOG_APP_RESOURCES_START=Az alkalmaz\u00e1s er\u0151forr\u00e1sok \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlb\u00f3l a(z) {1} f\u00e1jlba folyamatban van.
LOG_APP_VIRTUAL_HOST_GENERATE=Az alkalmaz\u00e1s ibm-web-bnd.xml f\u00e1jl el\u0151\u00e1ll\u00edt\u00e1sa a(z) {0} virtu\u00e1lis hoszttal folyamatban van.
LOG_APP_VIRTUAL_HOST_START=Az alkalmaz\u00e1s virtu\u00e1lis hosztj\u00e1nak konfigur\u00e1l\u00e1sa folyamatban van.
LOG_APP_VIRTUAL_HOST_UPDATE=Az alkalmaz\u00e1s ibm-web-bnd.xml f\u00e1jl friss\u00edt\u00e9se a(z) {0} virtu\u00e1lis hoszttal folyamatban van.
LOG_COPY_SERVER_XML=Az eredeti Liberty server.xml f\u00e1jl tartalma ment\u00e9sre ker\u00fclt a(z) {0} f\u00e1jlba.
LOG_COPY_APP_WEB_BND_XML=Az eredeti alkalmaz\u00e1s ibm-web-bnd.xml f\u00e1jl tartalma ment\u00e9sre ker\u00fclt a(z) {0} f\u00e1jlba.
LOG_GEN_TOP_LEVEL_CONFIG=A(z) {0} konfigur\u00e1ci\u00f3s f\u00e1jl el\u0151 lett \u00e1ll\u00edtva, \u00e9s bele lesz foglalva a Liberty server.xml f\u00e1jlba.
LOG_HDR_APP_CONTEXT_XML=Alkalmaz\u00e1s context.xml f\u00e1jl = {0}
LOG_HDR_APP_NAME=Alkalmaz\u00e1s neve = {0}
LOG_HDR_APP_WEB_XML=Alkalmaz\u00e1s web.xml f\u00e1jl = {0}
LOG_HDR_LIBERTY_SERVER_DIR=Liberty kiszolg\u00e1l\u00f3 k\u00f6nyvt\u00e1r = {0}
LOG_HDR_NO_APP_CONTEXT_XML=Nem l\u00e9tezik alkalmaz\u00e1s context.xml f\u00e1jl, \u00edgy nem lesz \u00e1t\u00e1ll\u00edtva.
LOG_HDR_TOMCAT_SERVER_DIR=Tomcat kiszolg\u00e1l\u00f3 k\u00f6nyvt\u00e1r = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=Tomcat kiszolg\u00e1l\u00f3 fut\u00e1si k\u00f6nyvt\u00e1r = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=Tomcat kiszolg\u00e1l\u00f3 fut\u00e1si k\u00f6nyvt\u00e1r a CATALINA_HOME alapj\u00e1n = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 k\u00f6nyvt\u00e1ra = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 k\u00f6nyvt\u00e1ra a CATALINA_HOME alapj\u00e1n = {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=Az alkalmaz\u00e1s nem lett hozz\u00e1adva a Liberty kiszolg\u00e1l\u00f3hoz a k\u00f6vetkez\u0151 kiv\u00e9tel miatt: \n{0}
LOG_BEGINNING={0} - napl\u00f3bejegyz\u00e9s kezd\u00e9se
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=yy/MM/dd kk:mm:ss:SSS z
LOG_DELETE_FILE_ERROR=A(z) {0} ideiglenes f\u00e1jl nem t\u00f6r\u00f6lhet\u0151.
LOG_END={0} - napl\u00f3bejegyz\u00e9s bez\u00e1r\u00e1sa
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE=A(z) {0} f\u00e1jl nem z\u00e1rhat\u00f3 be.
LOG_FILE_COPIED=A(z) {0} f\u00e1jl \u00e1t lett m\u00e1solva a(z) {1} k\u00f6nyvt\u00e1rb\u00f3l a(z) {2} k\u00f6nyvt\u00e1rba.
LOG_FILE_COPIED_ERROR=A(z) {0} f\u00e1jl nem lett \u00e1tm\u00e1solva a(z) {1} k\u00f6nyvt\u00e1rb\u00f3l a(z) {2} k\u00f6nyvt\u00e1rba a k\u00f6vetkez\u0151 hiba miatt:\n{3}.
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR=A(z) {0} adatb\u00e1zishoz sz\u00fcks\u00e9ges illeszt\u0151program nem lett \u00e1tm\u00e1solva a(z) {1} helyre, mert a c\u00e9lk\u00f6nyvt\u00e1r nem l\u00e9tezik.

LOG_MIME_TYPES_SKIP=Nem lesznek \u00e1t\u00e1ll\u00edtva kiszolg\u00e1l\u00f3 web.xml m\u0171term\u00e9kek, mert a(z) {0} f\u00e1jl nem l\u00e9tezik.
LOG_MIME_TYPES_START=A mime-mapping elemek \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlb\u00f3l a(z) {1} f\u00e1jlba folyamatban van.
LOG_RESOURCE_AND_HTTP_SKIP=Nem lesznek \u00e1t\u00e1ll\u00edtva Resource vagy HTTP Connector elemek, mert a(z) {0} f\u00e1jl nem l\u00e9tezik.
LOG_RESOURCE_AND_HTTP_START=A Resource vagy HTTP Connector elemek \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlb\u00f3l a(z) {1} f\u00e1jlba folyamatban van.
LOG_SEC_CONSTRAINTS_SKIP=Nincs be\u00e1ll\u00edtva \u00e9rt\u00e9k az allRolesMode attrib\u00fatumhoz a Tomcat alkalmaz\u00e1s biztons\u00e1gi megszor\u00edt\u00e1sokban. Az \u00e9rt\u00e9k az alap\u00e9rtelmezett 'strict' lesz.
LOG_SEC_CONSTRAINTS_START=Az alkalmaz\u00e1s biztons\u00e1gi megszor\u00edt\u00e1sok \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlb\u00f3l a(z) {1} f\u00e1jlba folyamatban van.
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=A Tomcat kiszolg\u00e1l konfigur\u00e1ci\u00f3 nem \u00e1ll\u00edthat\u00f3 \u00e1t a k\u00f6vetkez\u0151 kiv\u00e9tel miatt: \n{0}
LOG_SERVER_CONFIG_SUCCESSFUL=A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa siker\u00fclt.
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=A Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa siker\u00fclt, azonban a konfigur\u00e1ci\u00f3 tov\u00e1bbi friss\u00edt\u00e9se sz\u00fcks\u00e9ges. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a napl\u00f3f\u00e1jl el\u0151z\u0151 bejegyz\u00e9seit.
LOG_SERVER_NOT_MIGRATED=Figyelem: Az \u00e1t\u00e1ll\u00edtott alkalmaz\u00e1s f\u00fcgghet a megfelel\u0151 Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3ban meghat\u00e1rozott be\u00e1ll\u00edt\u00e1sokt\u00f3l. A probl\u00e9m\u00e1k elker\u00fcl\u00e9se \u00e9rdek\u00e9ben \u00e1ll\u00edtsa \u00e1t a Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3t az alkalmaz\u00e1s futtat\u00e1sa el\u0151tt.
LOG_SHARED_LIB_DATASOURCE=A(z) {0} megosztott f\u00fcggv\u00e9nyt\u00e1r konfigur\u00e1ci\u00f3 hozz\u00e1ad\u00e1sra ker\u00fcl a(z) {1} f\u00e1jlhoz. Erre a konfigur\u00e1ci\u00f3ra adatforr\u00e1s elemek hivatkoznak.
LOG_SHARED_LIB_CLASSLOADER=A(z) {0} megosztott f\u00fcggv\u00e9nyt\u00e1r konfigur\u00e1ci\u00f3 hozz\u00e1ad\u00e1sra ker\u00fcl a(z) {1} f\u00e1jlhoz. Erre a konfigur\u00e1ci\u00f3ra alkalmaz\u00e1s oszt\u00e1lybet\u00f6lt\u0151 elemek hivatkoznak.
LOG_STANDARD_MANAGER_SKIP=Nem lesznek \u00e1t\u00e1ll\u00edtva szabv\u00e1nyos Manager \u00e9s Resource elemek, mert a(z) {0} f\u00e1jl nem l\u00e9tezik.
LOG_STANDARD_MANAGER_START=A szabv\u00e1nyos Manager \u00e9s Resource elemek \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlb\u00f3l a(z) {1} f\u00e1jlba folyamatban van.
LOG_TOMCAT_APP_MIG_OK=A Tomcat alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa siker\u00fclt.
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=A Tomcat alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa siker\u00fclt, azonban a konfigur\u00e1ci\u00f3 tov\u00e1bbi friss\u00edt\u00e9se sz\u00fcks\u00e9ges. Tov\u00e1bbi inform\u00e1ci\u00f3k\u00e9rt tekintse meg a napl\u00f3f\u00e1jl el\u0151z\u0151 bejegyz\u00e9seit.
LOG_UPDATE_LIBERTY_SERVER_START=A Liberty kiszolg\u00e1l\u00f3 friss\u00edt\u00e9sre ker\u00fcl az \u00e1t\u00e1ll\u00edtott konfigur\u00e1ci\u00f3val.
LOG_USERS_EXCEPTION=Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z a k\u00f6vetkez\u0151 kiv\u00e9tel miatt nem tudta meg\u00e1llap\u00edtani, hogy vannak-e tov\u00e1bbi felhaszn\u00e1l\u00f3 \u00e9s szerep f\u00e1jlok: \n{0}
LOG_USERS_NO_FILE=Nem lettek \u00e1t\u00e1ll\u00edtva tomcat-users f\u00e1jlok. Annak kider\u00edt\u00e9s\u00e9hez, hogy a f\u00e1jlok az\u00e9rt lettek-e kihagyva, mert nem tal\u00e1lhat\u00f3k, tekintse meg e napl\u00f3f\u00e1jl egy\u00e9b bejegyz\u00e9seit.
LOG_USERS_SKIP=Nem lesznek \u00e1t\u00e1ll\u00edtva users \u00e9s roles elemek, mert a(z) {0} f\u00e1jl nem l\u00e9tezik.
LOG_USERS_START=A user \u00e9s role elemek \u00e1t\u00e1ll\u00edt\u00e1sa a(z) {0} f\u00e1jlb\u00f3l a(z) {1} f\u00e1jlba folyamatban van.
LOG_USERS_TEMP_FILE_ERROR=Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem tal\u00e1lta a(z) {0} ideiglenes f\u00e1jlt.
LOG_VARIABLES_START=Az el\u0151\u00e1ll\u00edtott konfigur\u00e1ci\u00f3 \u00e1ltal hivatkozott Tomcat tulajdons\u00e1gok \u00e1t\u00e1ll\u00edt\u00e1sra ker\u00fclnek a(z) {0} f\u00e1jlb\u00f3l a(z) {1} f\u00e1jlba.
LOG_VARIABLES_SCANNING_EXCEPTION=Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z a k\u00f6vetkez\u0151 kiv\u00e9tel miatt nem tudta meg\u00e1llap\u00edtani, hogy a(z) {0} f\u00e1jl hivatkozik-e b\u00e1rmilyen Tomcat tulajdons\u00e1gra:\n{1}
LOG_WAMT_EXCEPTION=Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z a k\u00f6vetkez\u0151 kiv\u00e9tel miatt nem tudta meg\u00e1llap\u00edtani, hogy az alkalmaz\u00e1s haszn\u00e1l-e MongoDB adatb\u00e1zist: {0}
LOG_WAMT_NOT_FOUND=Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem tudta meg\u00e1llap\u00edtani, hogy az alkalmaz\u00e1s haszn\u00e1l-e MongoDB adatb\u00e1zist. Ha az alkalmaz\u00e1s haszn\u00e1l MongoDB adatb\u00e1zist, akkor telep\u00edtse az Alkalmaz\u00e1s\u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z - Apache Tomcat -> WebSphere eszk\u00f6zt, \u00e9s \u00e1ll\u00edtsa \u00e1t \u00fajra az alkalmaz\u00e1st.

LOG_ACTION_VARIABLE_NOT_MIGRATED=Teend\u0151: A(z) {1} f\u00e1jlban hivatkozott {0} v\u00e1ltoz\u00f3 \u00e9rt\u00e9ke nem \u00e1llap\u00edthat\u00f3 meg. Konfigur\u00e1lja a v\u00e1ltoz\u00f3t a Liberty kiszolg\u00e1l\u00f3n, vagy m\u00f3dos\u00edtsa a konfigur\u00e1ci\u00f3t, hogy ne hivatkozzon a v\u00e1ltoz\u00f3ra. Az \u00e1t\u00e1ll\u00edtott v\u00e1ltoz\u00f3k alap\u00e9rtelmezett helye a migratedConfig/variables.xml f\u00e1jl.
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=Teend\u0151: A(z) {1} f\u00e1jlban hivatkozott {0} v\u00e1ltoz\u00f3 nem lett \u00e1t\u00e1ll\u00edtva, mert az nem egy \u00e9rv\u00e9nyes v\u00e1ltoz\u00f3n\u00e9v a Liberty kiszolg\u00e1l\u00f3n. Konfigur\u00e1ljon egy \u00e9rv\u00e9nyes nev\u0171 v\u00e1ltoz\u00f3t, vagy m\u00f3dos\u00edtsa a konfigur\u00e1ci\u00f3t, hogy ne hivatkozzon a v\u00e1ltoz\u00f3ra. Az \u00e1t\u00e1ll\u00edtott v\u00e1ltoz\u00f3k alap\u00e9rtelmezett helye a migratedConfig/variables.xml f\u00e1jl.
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=Teend\u0151: A(z) {2} f\u00e1jlban hivatkozott {1} v\u00e1ltoz\u00f3 {0} \u00e9rt\u00e9ke nem \u00e9rv\u00e9nyes a Liberty kiszolg\u00e1l\u00f3n, \u00edgy a v\u00e1ltoz\u00f3 nem lett \u00e1t\u00e1ll\u00edtva. Konfigur\u00e1ljon egy v\u00e1ltoz\u00f3t, amelynek \u00e9rt\u00e9ke nem egy v\u00e1ltoz\u00f3 hivatkoz\u00e1st tartalmaz, vagy m\u00f3dos\u00edtsa a konfigur\u00e1ci\u00f3t, hogy ne hivatkozzon a v\u00e1ltoz\u00f3ra. Az \u00e1t\u00e1ll\u00edtott v\u00e1ltoz\u00f3k alap\u00e9rtelmezett helye a migratedConfig/variables.xml f\u00e1jl.
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=Figyelem: A(z) {0} className attrib\u00fatumot tartalmaz\u00f3 Realm elem nem lett \u00e1t\u00e1ll\u00edtva. Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem t\u00e1mogatja az alkalmaz\u00e1s context.xml f\u00e1jlj\u00e1ban l\u00e9v\u0151 Realm elemek \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t. Ha \u00e1t szeretn\u00e9 \u00e1ll\u00edtani a Realm elemet, akkor helyezze \u00e1t az elemet a Tomcat conf k\u00f6nyvt\u00e1rban tal\u00e1lhat\u00f3 context.xml f\u00e1jlba, hogy az elem a Tomcat kiszolg\u00e1l\u00f3konfigur\u00e1ci\u00f3val legyen \u00e1t\u00e1ll\u00edtva.
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=Figyelem: A(z) {0} portot \u00e9s a(z) {1} protokollt tartalmaz\u00f3 Connector elem nem lett \u00e1t\u00e1ll\u00edtva. A Liberty kiszolg\u00e1l\u00f3 nem t\u00e1mogatja ezt a protokollt.
LOG_ATTENTION_CONNECTOR_PORT_ZERO=Figyelem: Egy 0-\u00e1s portot tartalmaz\u00f3 Connector elem nem lett \u00e1t\u00e1ll\u00edtva. A Liberty kiszolg\u00e1l\u00f3 nem t\u00e1mogatja egy 0-\u00e1s port meghat\u00e1roz\u00e1s\u00e1t.
LOG_ATTENTION_EXCEPTION=Figyelem: Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z a k\u00f6vetkez\u0151 kiv\u00e9tel miatt nem tudta meg\u00e1llap\u00edtani, hogy a(z) {0} f\u00e1jlban l\u00e9v\u0151 elemek \u00e1t\u00e1ll\u00edt\u00e1sa meghi\u00fasult-e:\n{0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=Figyelem: A(z) {0} name attrib\u00fatumot \u00e9s a(z) {1} driverClassName attrib\u00fatumot tartalmaz\u00f3 JDBC Resource elem nem lett \u00e1t\u00e1ll\u00edtva. Konfigur\u00e1lja a dataSource elemet a Liberty kiszolg\u00e1l\u00f3n, ha az elem sz\u00fcks\u00e9ges.
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=Figyelem: A(z) {0} dataSourceName attrib\u00fatumot tartalmaz\u00f3 Realm elem nem lett \u00e1t\u00e1ll\u00edtva. Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem t\u00e1mogatja ennek a Realm elemnek az \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t. Konfigur\u00e1ljon egy egy\u00e9ni felhaszn\u00e1l\u00f3i nyilv\u00e1ntart\u00e1st a Liberty kiszolg\u00e1l\u00f3n, ha az elem sz\u00fcks\u00e9ges.
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=Figyelem: A(z) {0} appName attrib\u00fatumot tartalmaz\u00f3 JAAS Realm elem nem lett \u00e1t\u00e1ll\u00edtva. Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem t\u00e1mogatja ennek a Realm elemnek az \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t. Konfigur\u00e1ljon egy JAAS egy\u00e9ni bejelentkez\u00e9si modult a Liberty kiszolg\u00e1l\u00f3n, ha az elem sz\u00fcks\u00e9ges. 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=Figyelem: A(z) {0} driverName attrib\u00fatumot tartalmaz\u00f3 JDBC Realm elem nem lett \u00e1t\u00e1ll\u00edtva. Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem t\u00e1mogatja ennek a Realm elemnek az \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t. Konfigur\u00e1ljon egy egy\u00e9ni felhaszn\u00e1l\u00f3i nyilv\u00e1ntart\u00e1st a Liberty kiszolg\u00e1l\u00f3n, ha az elem sz\u00fcks\u00e9ges.
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=Figyelem: A(z) {0} connectionURL attrib\u00fatumot tartalmaz\u00f3 JNDI Realm elem nem lett \u00e1t\u00e1ll\u00edtva. Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem t\u00e1mogatja ennek a Realm elemnek az \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t. Konfigur\u00e1ljon egy LDAP felhaszn\u00e1l\u00f3i nyilv\u00e1ntart\u00e1st a Liberty kiszolg\u00e1l\u00f3n, ha az elem sz\u00fcks\u00e9ges.
LOG_ATTENTION_MANAGER_NOT_MIGRATED=Figyelem: A(z) {0} className attrib\u00fatumot tartalmaz\u00f3 Manager elem nem lett \u00e1t\u00e1ll\u00edtva. Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem t\u00e1mogatja ennek a Manager elemnek az \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t. A munkamenet perzisztencia konfigur\u00e1l\u00e1s\u00e1hoz a Liberty kiszolg\u00e1l\u00f3n, adja hozz\u00e1 a sessionDatabase-1.0 szolg\u00e1ltat\u00e1st, \u00e9s adja meg a httpSession \u00e9s httpSessionDatabase elemet a szolg\u00e1ltat\u00e1sban.
LOG_ATTENTION_REALM_NOT_MIGRATED=Figyelem: A(z) {0} className attrib\u00fatumot tartalmaz\u00f3 Realm elem nem lett \u00e1t\u00e1ll\u00edtva. Az \u00e1t\u00e1ll\u00edt\u00e1si eszk\u00f6z nem t\u00e1mogatja ennek a Realm elemnek az \u00e1t\u00e1ll\u00edt\u00e1s\u00e1t.

LOG_WARNING_PW_NOT_ENCODED=Figyelem: A password attrib\u00fatum nem lett k\u00f3dolva.
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=Figyelem: A password attrib\u00fatum nem lett k\u00f3dolva, mert egy v\u00e1ltoz\u00f3ra hivatkozott. A kiszolg\u00e1l\u00f3 biztons\u00e1g\u00e1nak jav\u00edt\u00e1sa \u00e9rdek\u00e9ben keresse meg a hivatkozott v\u00e1ltoz\u00f3t, \u00e9s gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy annak \u00e9rt\u00e9ke k\u00f3dolva van.
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=Figyelem: A password attrib\u00fatum nem lett k\u00f3dolva a k\u00f6vetkez\u0151 kiv\u00e9tel miatt: \n{0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=Figyelem: A password attrib\u00fatumok nem lettek k\u00f3dolva, mert a Liberty bin k\u00f6nyvt\u00e1r nem tal\u00e1lhat\u00f3.

LOG_BINARY_SCANNER_NOT_FOUND=A bin\u00e1ris elemz\u0151 nem tal\u00e1lhat\u00f3 a f\u00e1jlrendszeren. Ennek eredm\u00e9nyek\u00e9nt a MongoDB konfigur\u00e1ci\u00f3 hi\u00e1nyozhat. Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy minden sz\u00fcks\u00e9ges konfigur\u00e1ci\u00f3 bele van foglalva, ha az alkalmaz\u00e1s MongoDB adatb\u00e1zist haszn\u00e1l.
LOG_RULE_DIR_NOT_CREATED=Nem hozhat\u00f3 l\u00e9tre egy ideiglenes k\u00f6nyvt\u00e1r a f\u00e1jlrendszeren. Ennek eredm\u00e9nyek\u00e9nt a MongoDB konfigur\u00e1ci\u00f3 hi\u00e1nyozhat. Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy minden sz\u00fcks\u00e9ges konfigur\u00e1ci\u00f3 bele van foglalva, ha az alkalmaz\u00e1s MongoDB adatb\u00e1zist haszn\u00e1l.
LOG_RULE_FILE_NOT_COPIED=A Mongo haszn\u00e1lat\u00e1t \u00e9szlel\u0151 szab\u00e1ly nem m\u00e1solhat\u00f3 \u00e1t a f\u00e1jlrendszerre. Ennek eredm\u00e9nyek\u00e9nt a Mongo konfigur\u00e1ci\u00f3 hi\u00e1nyozhat. Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy minden sz\u00fcks\u00e9ges konfigur\u00e1ci\u00f3 bele van foglalva, ha az alkalmaz\u00e1s MongoDB adatb\u00e1zist haszn\u00e1l.
LOG_BINARY_SCAN_FAILURE=A bin\u00e1ris elemz\u0151 futtat\u00e1sa meghi\u00fasult. Ennek eredm\u00e9nyek\u00e9nt a MongoDB konfigur\u00e1ci\u00f3 hi\u00e1nyozhat. Gy\u0151z\u0151dj\u00f6n meg r\u00f3la, hogy minden sz\u00fcks\u00e9ges konfigur\u00e1ci\u00f3 bele van foglalva, ha az alkalmaz\u00e1s MongoDB adatb\u00e1zist haszn\u00e1l.
LOG_SCAN_OUTPUT_FILE_FAILURE=A bin\u00e1ris elemz\u0151 kimeneti f\u00e1jlja nem hozhat\u00f3 l\u00e9tre a k\u00f6vetkez\u0151 hiba miatt:\n{0}
LOG_MONGO_EXCEPTION=A k\u00f6vetkez\u0151 kiv\u00e9tel t\u00f6rt\u00e9nt az alkalmaz\u00e1s elemz\u00e9sekor MongoDB haszn\u00e1lata tekintet\u00e9ben:\n{0}

TITLE_APP_CONFIG=Tomcat alkalmaz\u00e1s konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa
TITLE_SERVER_CONFIG=Tomcat kiszolg\u00e1l konfigur\u00e1ci\u00f3 \u00e1t\u00e1ll\u00edt\u00e1sa
