# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=Das Konfigurationsmigrationstool f\u00fcr Tomcat hat die folgende Konfiguration migriert.
MIGRATION_COMPLETE_NAMED_FILE=Das Konfigurationsmigrationstool f\u00fcr Tomcat hat die folgende Konfiguration aus der Datei {0} migriert.
MIGRATION_GENERATED=Das Konfigurationsmigrationstool f\u00fcr Tomcat hat die folgende Konfiguration generiert.
JMS_CLASS_CAST_WARNING=Achtung: Die JMS-Verbindungsfactory von Liberty implementiert nicht die Schnittstellen javax.jms.QueueConnectionFactory und javax.jms.TopiConnectionFactory. \nWenn JMS-Anwendungen versuchen, diese Verbindungsfactory auf eine dieser Schnittstellen umzustellen, empfangen sie eine ClassCastException.
FILE_UPDATED=Das Konfigurationsmigrationstool f\u00fcr Tomcat hat die folgende Konfiguration aktualisiert.
ACTION_JDBC_DRIVER=Ma\u00dfnahme erforderlich: Kopieren Sie den JDBC-Treiber an die Position {1} oder \u00e4ndern Sie die Konfiguration so, dass sie auf die Position des JDBC-Treibers zeigt, um den JDBC-Treiber f\u00fcr das dataSource-Element {0} zug\u00e4nglich zu machen.
ACTION_ORACLE_DRIVER=Ma\u00dfnahme erforderlich: Kopieren Sie den Inhalt des Oracle-Clientverzeichnisses an die Position f\u00fcr die gemeinsame Bibliothek {1} oder \u00e4ndern Sie die Konfiguration so, dass sie auf die Position des Oracle-Clientverzeichnisses zeigt, um den Oracle-Treiber f\u00fcr das dataSource-Element {0} zug\u00e4nglich zu machen.
ACTION_USER_PASSWORDS=Ma\u00dfnahme erforderlich: Verwenden Sie den Konfigurationseditor von Liberty, um die Kennwortattribute in der migrierten Konfiguration mit dem Hashalgorithmus auf die urspr\u00fcnglichen, unverschl\u00fcsselten Werte des Tomcat-Servers zu setzen. Die urspr\u00fcnglichen Kennw\u00f6rter wurden mit dem Hashalgorithmus {0} verschl\u00fcsselt und in ihrer verschl\u00fcsselten Form migriert.
STORAGE_REF_WARNING=Achtung: Liberty legt Sitzungsdaten standardm\u00e4\u00dfig im Hauptspeicher ab.\nF\u00fcgen Sie das Feature sessionDatabase-1.0 und ein Element httpSessionDatabase hinzu, um die Sitzungspersistenz zu konfigurieren.
PATHNAME_WARNING=Achtung: Das Attribut pathname des Tomcat Standard Manager wurde nicht migriert. Liberty legt Sitzungsdaten standardm\u00e4\u00dfig im Hauptspeicher ab.\nF\u00fcgen Sie das Feature sessionDatabase-1.0 und ein Element httpSessionDatabase hinzu, um die Sitzungspersistenz zu konfigurieren.
MQ_RESOURCE_ADAPTER_ACTION=Ma\u00dfnahme erforderlich: Kopieren Sie den WebSphere-MQ-Ressourcenadapter an die Position {0} oder \u00e4ndern Sie die Konfiguration so, dass sie auf die Position des WebSphere-MQ-Ressourcenadapters zeigt, um den Messaging-Provider von WebSphere MQ in Liberty verwenden zu k\u00f6nnen.
MQ_NATIVE_LIB_ACTION=Ma\u00dfnahme erforderlich: Modifizieren Sie das Attribut nativeLibraryPath so, dass es auf die Position der nativen WebSphere-MQ-Bibliotheken zeigt.
MONGO_CLASSLOADER_NEEDED_ACTION=Ma\u00dfnahme erforderlich: Kopieren Sie den MongoDB-Java-Treiber in die gemeinsame Bibliothek {0} oder modifizieren Sie die Konfiguration so, dass sie auf die Position des Treibers zeigt, um den Treiber f\u00fcr die Anwendung zug\u00e4nglich zu machen.
MULTIPLE_REDIRECT_PORTS=Achtung: Der SSL-Port {0} ist bereits in einem Element httpEndpoint definiert und wurde im httpEndpoint-Element {1} inaktiviert. Geben Sie f\u00fcr das Attribut httpsPort einen verf\u00fcgbaren Port an, um SSL f\u00fcr das Element httpEndpoint zu aktivieren. Liberty bietet keine Unterst\u00fctzung f\u00fcr mehrere httpEndpoint-Elemente mit demselben Attributwert f\u00fcr httpsPort. 
DEFAULT_SSL_GENERATED=Achtung: F\u00fcr den SSL-Port {0} wurde keine SSL-Konfiguration gefunden. Die Standard-SSL-Konfiguration wurde generiert. 
PASSWORD_ENCODE_WARNING=Achtung: \u00c4ndern und verschl\u00fcsseln Sie das Kennwort f\u00fcr das Element {0}, um die Sicherheit des Servers zu verbessern.
HTTPS_PORT_UNSUPPORTED_PROTOCOL=Achtung: Der SSL-Port {0}, den das Tomcat-Connector-Element als Port {1} referenziert, verwendet ein vom Liberty-Server nicht unterst\u00fctztes Protokoll. Das Attribut httpsPort des httpEndpoint-Elements {2} wurde inaktiviert.
HTTPS_CONNECTOR_MISSING=Achtung: Das Tomcat-Connector-Element mit dem Port {0} verweist auf einen nicht definierten SSL-Port ({1}). Das Attribut httpsPort des httpEndpoint-Elements {2} wurde inaktiviert.
UNCOMMENT_VIRTUAL_HOST=Entfernen Sie das Kommentarzeichen f\u00fcr den bevorzugten virtuellen Host f\u00fcr Ihre Anwendung. Der virtuelle Host default_host eignet sich f\u00fcr die meisten einfachen Konfigurationen.
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=Nein, nur meine Anwendung migrieren
DROPDOWN_DEFAULT_SELECT_AN_OPTION=Eine Option ausw\u00e4hlen
DROPDOWN_TOMCATSERVER_FILESYSTEM=Ja, auch einen Server aus meinem Dateisystem migrieren
DROPDOWN_TOMCATSERVER_WORKSPACE=Ja, auch einen Server aus meinem Arbeitsbereich migrieren
TITLE_INFO=Information
TITLE_ERROR=Fehler
TITLE_LIBERTY_SELECT=Auswahl des Liberty-Servers
TITLE_APP_ALREADY_MIGRATED=Zuvor auf diesen Server migrierte Anwendung
TITLE_SERVER_ALREADY_MIGRATED=Zuvor auf diesen Server migrierter Tomcat-Server
TITLE_SERVER_NOT_MIGRATED=Abh\u00e4ngigkeiten von der Tomcat-Serverkonfiguration
TITLE_SUCCESS_DIALOG=Konfiguration erfolgreich migriert
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=Konfiguration erfolgreich migriert - Ma\u00dfnahme erforderlich
TITLE_TOMCAT_SELECT=Auswahl des Tomcat-Servers
TITLE_VIRTUAL_HOST_SELECT=Bindung der Anwendung an einen virtuellen Host
APP_ALREADY_MIGRATED=Die Anwendung {0} wurde bereits auf den ausgew\u00e4hlten Liberty-Server {1} migriert.\n\nWenn Sie die Anwendungsmigration fortsetzen, werden Konfigurationsdateien \u00fcberschrieben. Au\u00dferdem k\u00f6nnen Referenzen auf Ihre Konfigurationsdateien verlorengehen. Migrieren Sie Ihre Anwendung auf einen anderen Liberty-Server oder entfernen Sie die zuvor migrierte Konfiguration von dem Liberty-Server, um Probleme zu vermeiden.\n\nM\u00f6chten Sie die Migration Ihrer Anwendung fortsetzen?
SERVER_ALREADY_MIGRATED=Ein Tomcat-Server wurde bereits auf den ausgew\u00e4hlten Liberty-Server {0} migriert.\n\nWenn Sie die Migration des ausgew\u00e4hlten Tomcat-Servers ({1}) fortsetzen, werden Konfigurationsdateien \u00fcberschrieben. Au\u00dferdem k\u00f6nnen Referenzen auf Ihre Konfigurationsdateien verlorengehen. Migrieren Sie Ihren Tomcat-Server auf einen anderen Liberty-Server oder entfernen Sie die zuvor migrierte Konfiguration von dem Liberty-Server, um Probleme zu vermeiden.\n\nM\u00f6chten Sie die Migration Ihres Tomcat-Servers fortsetzen?
SERVER_NOT_MIGRATED=Die Anwendung k\u00f6nnte von Einstellungen abh\u00e4ngen, die in der entsprechenden Tomcat-Serverkonfiguration definiert sind. Migrieren Sie zuerst die Tomcat-Serverkonfiguration auf den Liberty-Server, der die Anwendung bereitstellt, um Probleme zu vermeiden.\n\nM\u00f6chten Sie Ihren Tomcat-Server und dann Ihre Anwendung migrieren?
LIBERTY_SERVER_CHECKBOX=Konfiguration des Liberty-Servers
APP_LOG_FILE_CHECKBOX=Protokolldatei der Anwendungsmigration
SERVER_LOG_FILE_CHECKBOX=Protokolldatei der Servermigration
DESC_LIBERTY_SELECT=W\u00e4hlen Sie einen Liberty-Server aus.\nIhre Tomcat-Konfiguration wird auf diesen Server migriert.
MIGRATION_SUCCESS_DIALOG_SERVER=Die Tomcat-Serverkonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Informationen enth\u00e4lt die Protokolldatei {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=Die Tomcat-Serverkonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Ma\u00dfnahmen sind erforderlich, um die Konfiguration zu vervollst\u00e4ndigen. Weitere Informationen enth\u00e4lt die Protokolldatei {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=Die Tomcat-Serverkonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Informationen enth\u00e4lt die Protokolldatei {1}.\n\nW\u00e4hlen Sie die Dateien aus, die ge\u00f6ffnet werden sollen:
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=Die Tomcat-Serverkonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Ma\u00dfnahmen sind erforderlich, um die Konfiguration zu vervollst\u00e4ndigen. Weitere Informationen enth\u00e4lt die Protokolldatei {1}.\n\nW\u00e4hlen Sie die Dateien aus, die ge\u00f6ffnet werden sollen:
MIGRATION_SUCCESS_DIALOG_APPLICATION=Die Anwendungskonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Informationen enth\u00e4lt die Protokolldatei {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=Die Tomcat-Serverkonfiguration und die Anwendungskonfiguration wurden erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Informationen enthalten die folgenden Protokolldateien: \n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=Die Anwendungskonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Ma\u00dfnahmen sind erforderlich, um die Konfiguration zu vervollst\u00e4ndigen. Weitere Informationen enth\u00e4lt die Protokolldatei {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=Die Tomcat-Serverkonfiguration und die Anwendungskonfiguration wurden erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Ma\u00dfnahmen sind erforderlich, um die Konfiguration zu vervollst\u00e4ndigen. Weitere Informationen enthalten die folgenden Protokolldateien: \n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=Die Anwendungskonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Informationen enth\u00e4lt die Protokolldatei {1}.\n\nW\u00e4hlen Sie die Dateien aus, die ge\u00f6ffnet werden sollen:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=Die Tomcat-Serverkonfiguration und die Anwendungskonfiguration wurden erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Informationen enthalten die folgenden Protokolldateien: \n{1}\n{2}\n\nW\u00e4hlen Sie die Dateien aus, die ge\u00f6ffnet werden sollen:
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=Die Anwendungskonfiguration wurde erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Ma\u00dfnahmen sind erforderlich, um die Konfiguration zu vervollst\u00e4ndigen. Weitere Informationen enth\u00e4lt die Protokolldatei {1}.\n\nW\u00e4hlen Sie die Dateien aus, die ge\u00f6ffnet werden sollen:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=Die Tomcat-Serverkonfiguration und die Anwendungskonfiguration wurden erfolgreich auf folgenden Liberty-Server migriert: {0}.\n\nWeitere Ma\u00dfnahmen sind erforderlich, um die Konfiguration zu vervollst\u00e4ndigen. Weitere Informationen enthalten die folgenden Protokolldateien: \n{1}\n{2}\n\nW\u00e4hlen Sie die Dateien aus, die ge\u00f6ffnet werden sollen:
MIGRATION_FAILURE_DIALOG=Die Konfiguration kann wegen der folgenden Ausnahme nicht migriert werden:\n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=Anwendung wird zum Liberty-Server hinzugef\u00fcgt...
PROGRESS_COPYING_LIBERTY_SERVER=Datei server.xml von Liberty wird kopiert...
PROGRESS_GENERATING_CONFIG_FILE=Konfigurationsdatei von Liberty wird generiert...
PROGRESS_LOADING_CONFIG_INFO=Konfigurationsdaten werden geladen...
PROGRESS_MIGRATING_APPLICATION=Die Anwendungskonfiguration wird migriert.
PROGRESS_MIGRATING_CONTEXT_XML=Konfiguration aus der Datei context.xml wird migriert...
PROGRESS_MIGRATING_SERVER=Die Tomcat-Serverkonfiguration wird migriert.
PROGRESS_MIGRATING_SERVER_XML=Konfiguration aus der Datei server.xml wird migriert...
PROGRESS_MIGRATING_SHARED_LIBRARIES=Gemeinsame Bibliotheken f\u00fcr Datenquellen werden migriert... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Tomcat-Benutzer und -Rollen werden migriert...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE=Tomcat-Benutzer und Rollen aus der Datei {0} werden migriert...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Tomcat-Benutzer und Rollen werden in die Datei {0} migriert...
PROGRESS_ENCODING_X_PASSWORDS={0} Kennw\u00f6rter werden verschl\u00fcsselt...
PROGRESS_ENCODING_PASSWORD_X_OF_Y=Kennwort {0} von {1} wird verschl\u00fcsselt...
PROGRESS_MIGRATING_VARIABLES=Tomcat-Variablen aus der Datei catalina.properties werden migriert...
PROGRESS_MIGRATING_WEB_XML=Konfiguration aus der Datei web.xml wird migriert...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=Anwendung wird auf dem Liberty-Server ver\u00f6ffentlicht...
PROGRESS_TITLE_CONFIG_MIGRATION=Migration der Tomcat-Konfiguration
PROGRESS_UPDATING_LIBERTY_SERVER=Datei server.xml von Liberty wird aktualisiert...
PROGRESS_VALIDATING_LIBERTY_SERVER=Konfiguration des Liberty-Servers wird \u00fcberpr\u00fcft...
PROGRESS_VERIFYING_VIRTUAL_HOST=Konfiguration des virtuellen Hosts f\u00fcr die Anwendung wird verifiziert...
SELECTION_NOT_SUPPORTED=Die aktuelle Auswahl kann nicht migriert werden. W\u00e4hlen Sie einen Tomcat-Server oder ein Java-Projekt mit einer Tomcat-Anwendung aus.
NO_CONFIG_FOUND=Die aktuelle Auswahl kann nicht migriert werden. Die Tomcat-Serverkonfiguration wurde nicht gefunden.
SERVER_TYPE_ERROR=Der ausgew\u00e4hlte Server kann nicht migriert werden. W\u00e4hlen Sie einen Tomcat-Server aus. 
LIBERTY_CONFIG_NOT_FOUND=Die Konfiguration kann nicht migriert werden, weil die Konfiguration des Liberty-Servers nicht gefunden wurde.
INVALID_JAVA_PROJECT=Das ausgew\u00e4hlte Java-Projekt kann nicht migriert werden, weil es kein Verzeichnis {0} enth\u00e4lt.
NO_WEB_XML=Das ausgew\u00e4hlte Java-Projekt kann nicht migriert werden, weil es keine Datei {0} enth\u00e4lt.
NOT_TOMCAT_SERVER_DIR=Die aktuelle Auswahl kann nicht migriert werden, weil es sich nicht um einen g\u00fcltigen Tomcat-Server handelt.
NOT_TOMCAT_SERVER_FILE=Der ausgew\u00e4hlte Server kann nicht migriert werden, weil er nicht die folgende Datei enth\u00e4lt: {0}.
NO_LIBERTY_SERVER_XML=Der ausgew\u00e4hlte Liberty-Server enth\u00e4lt keine Konfigurationsdatei server.xml.
MISSING_LIBERTY_DIRECTORY=Der ausgew\u00e4hlte Liberty-Server ist ung\u00fcltig. Er enth\u00e4lt kein Verzeichnis {0}.
SELECT_TOMCAT_SERVER=W\u00e4hlen Sie den zu migrierenden Tomcat-Server aus.
SELECT_VIRTUAL_HOST=W\u00e4hlen Sie einen virtuellen Host f\u00fcr Ihre Anwendung aus.\n\nDer virtuelle Host default_host ist f\u00fcr die meisten einfachen Konfigurationen geeignet.

# Exceptions
EXCEPT_LOG_CREATE_ERROR=Das Konfigurationsmigrationstool f\u00fcr Tomcat konnte die folgende Protokolldatei nicht erstellen: {0}.
INVALID_WAR_FILE=Die angegebene Anwendungs-WAR-Datei ist nicht vorhanden oder sie ist keine .war-Datei: {0}.
INVALID_OUTPUT_DIRECTORY=Das angegebene Ausgabeverzeichnis konnte nicht erstellt werden: {0}.
INVALID_DIRECTORY=Das angegebene Verzeichnis ist nicht g\u00fcltig: {0}
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= Das Liberty-Serververzeichnis wurde nicht angegeben.
TEMP_FILE_DELETE_FAIL=Mindestens eine tempor\u00e4re Datei, die w\u00e4hrend der Migration erstellt wurde, konnte nicht gel\u00f6scht werden.

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=Die Anwendung wurde zum Liberty-Server hinzugef\u00fcgt.
LOG_ADDED_INCLUDE_FILE=Die Serverkonfigurationsdatei {0} wurde in die Datei {1} aufgenommen. 
LOG_APP_CONFIG_MIG_FAILED=Die Tomcat-Anwendungskonfiguration konnte wegen der folgenden Ausnahme nicht migriert werden:\n{0}
LOG_APP_CONFIG_MIG_NO_SERVER=Die Tomcat-Anwendungskonfiguration wurde migriert. Die Anwendung wurde jedoch nicht zum Liberty-Server hinzugef\u00fcgt, weil kein Server angegeben wurde.
LOG_APP_CONFIG_MIG_WITH_ERROR=Die Tomcat-Anwendungskonfiguration wurde migriert. Die Anwendung wurde jedoch wegen einer zuvor protokollierten Ver\u00f6ffentlichungsausnahme nicht zum Liberty-Server hinzugef\u00fcgt.
LOG_APP_PUBLISH_FAILED=Die Anwendung konnte wegen der folgenden Ausnahme nicht auf dem Liberty-Server ver\u00f6ffentlicht werden:\n{0}
LOG_APP_PUBLISH_OK=Die Anwendung wurde erfolgreich auf dem Liberty-Server ver\u00f6ffentlicht.
LOG_APP_RESOURCES_SKIP=Es werden keine Anwendungsressourcen migriert, weil die Anwendungsdatei context.xml nicht vorhanden ist.
LOG_APP_RESOURCES_START=Die Anwendungsressourcen werden von der Datei {0} in die Datei {1} migriert.
LOG_APP_VIRTUAL_HOST_GENERATE=Die Anwendungsdatei ibm-web-bnd.xml wird mit dem virtuellen Host {0} generiert.
LOG_APP_VIRTUAL_HOST_START=Der virtuelle Host f\u00fcr die Anwendung wird konfiguriert.
LOG_APP_VIRTUAL_HOST_UPDATE=Die Anwendungsdatei ibm-web-bnd.xml wird mit dem virtuellen Host {0} aktualisiert.
LOG_COPY_SERVER_XML=Der Inhalt der urspr\u00fcnglichen Liberty-Datei server.xml wurde in der Datei {0} gespeichert.
LOG_COPY_APP_WEB_BND_XML=Der Inhalt der urspr\u00fcnglichen Anwendungsdatei ibm-web-bnd.xml wurde in der Datei {0} gespeichert.
LOG_GEN_TOP_LEVEL_CONFIG=Die Konfigurationsdatei {0} wurde generiert und wird in die Liberty-Datei server.xml aufgenommen.
LOG_HDR_APP_CONTEXT_XML=Anwendungsdatei context.xml = {0}
LOG_HDR_APP_NAME=Anwendungsname = {0}
LOG_HDR_APP_WEB_XML=Anwendungsdatei web.xml = {0}
LOG_HDR_LIBERTY_SERVER_DIR=Liberty-Serververzeichnis = {0}
LOG_HDR_NO_APP_CONTEXT_XML=Eine Anwendungsdatei context.xml ist nicht vorhanden und kann daher nicht migriert werden.
LOG_HDR_TOMCAT_SERVER_DIR=Tomcat-Serververzeichnis = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=Tomcat-Serverlaufzeitverzeichnis = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=Tomcat-Serverlaufzeitverzeichnis von CATALINA_HOME = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=Tomcat-Serverkonfigurationsverzeichnis = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=Tomcat-Serverkonfigurationsverzeichnis von CATALINA_HOME = {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=Die Anwendung wurde wegen der folgenden Ausnahme nicht zum Liberty-Server hinzugef\u00fcgt:\n{0}
LOG_BEGINNING={0} - Anfang des Protokolleintrags
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=MM/dd/yy kk:mm:ss:SSS z
LOG_DELETE_FILE_ERROR=Die tempor\u00e4re Datei {0} konnte nicht gel\u00f6scht werden.
LOG_END={0} - Ende des Protokolleintrags
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE=Die Datei {0} konnte nicht geschlossen werden.
LOG_FILE_COPIED=Die Datei {0} wurde vom Verzeichnis {1} in das Verzeichnis {2} kopiert.
LOG_FILE_COPIED_ERROR=Die Datei {0} wurde wegen des folgenden Fehlers vom Verzeichnis {1} in das Verzeichnis {2} kopiert: \n{3}.
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR=Der f\u00fcr die Datenbank {0} erforderliche Treiber wurde nicht an die Position {1} kopiert, weil es das Zielverzeichnis nicht gibt.

LOG_MIME_TYPES_SKIP=Es werden keine Serverartefakte aus web.xml migriert, weil die Datei {0} nicht vorhanden ist.
LOG_MIME_TYPES_START=Die <mime-mapping>-Elemente werden von der Datei {0} in die Datei {1} migriert.
LOG_RESOURCE_AND_HTTP_SKIP=Es werden keine Ressourcenelemente oder HTTP-Connector-Elemente migriert, weil die Datei {0} nicht vorhanden ist.
LOG_RESOURCE_AND_HTTP_START=Die Ressourcenelemente und HTTP-Connector-Elemente werden von der Datei {0} in die Datei {1} migriert.
LOG_SEC_CONSTRAINTS_SKIP=In den Bedingungen f\u00fcr die Tomcat-Anwendungssicherheit ist f\u00fcr das Attribut allRolesMode kein Wert festgelegt. Standardm\u00e4\u00dfig wird der Wert 'strict' verwendet.
LOG_SEC_CONSTRAINTS_START=Die Bedingungen f\u00fcr die Anwendungssicherheit werden von der Datei {0} in die Datei {1} migriert.
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=Die Tomcat-Serverkonfiguration konnte wegen der folgenden Ausnahme nicht migriert werden:\n{0}
LOG_SERVER_CONFIG_SUCCESSFUL=Die Tomcat-Serverkonfiguration wurde erfolgreich migriert.
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=Die Tomcat-Serverkonfiguration wurde erfolgreich migriert. Die Konfiguration muss jedoch noch aktualisiert werden. Weitere Informationen enthalten die vorangegangenen Eintr\u00e4ge in dieser Protokolldatei.
LOG_SERVER_NOT_MIGRATED=Achtung: Die migrierte Anwendung k\u00f6nnte von Einstellungen abh\u00e4ngen, die in der entsprechenden Tomcat-Serverkonfiguration definiert sind. Migrieren Sie die Tomcat-Serverkonfiguration, bevor Sie die Anwendung ausf\u00fchren, um Probleme zu vermeiden.
LOG_SHARED_LIB_DATASOURCE=Die Konfiguration der gemeinsamen Bibliotheken ({0}) wird zur Datei {1} hinzugef\u00fcgt. Diese Konfiguration wird von dataSource-Elementen referenziert.
LOG_SHARED_LIB_CLASSLOADER=Die Konfiguration der gemeinsamen Bibliotheken ({0}) wird zur Datei {1} hinzugef\u00fcgt. Diese Konfiguration wird von classloader-Elementen der Anwendung referenziert.
LOG_STANDARD_MANAGER_SKIP=Es werden keine Standardmanager- und -ressourcenelemente migriert, weil die Datei {0} nicht vorhanden ist.
LOG_STANDARD_MANAGER_START=Die Standardmanager- und -ressourcenelemente werden von der Datei {0} in die Datei {1} migriert.
LOG_TOMCAT_APP_MIG_OK=Die Tomcat-Anwendungskonfiguration wurde erfolgreich migriert.
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=Die Tomcat-Anwendungskonfiguration wurde erfolgreich migriert. Die Konfiguration muss jedoch noch aktualisiert werden. Weitere Informationen enthalten die vorangegangenen Eintr\u00e4ge in dieser Protokolldatei.
LOG_UPDATE_LIBERTY_SERVER_START=Der Liberty-Server wird mit der migrierten Konfiguration aktualisiert.
LOG_USERS_EXCEPTION=Das Migrationstool konnte wegen der folgenden Ausnahme nicht feststellen, ob weitere Benutzer- und Rollendateien vorhanden sind:\n{0}
LOG_USERS_NO_FILE=Es wurden keine Dateien mit Tomcat-Benutzern migriert. Stellen Sie anhand der anderen Eintr\u00e4ge in dieser Protokolldatei fest, ob die Dateien \u00fcbergangen wurden, weil sie nicht gefunden werden konnten.
LOG_USERS_SKIP=Es werden keine Benutzer- und Rollenelemente migriert, weil die Datei {0} nicht vorhanden ist.
LOG_USERS_START=Die Benutzer- und Rollenelemente werden von der Datei {0} in die Datei {1} migriert.
LOG_USERS_TEMP_FILE_ERROR=Das Migrationstool konnte die tempor\u00e4re Datei {0} nicht finden.
LOG_VARIABLES_START=Die von der generierten Konfiguration referenzierten Tomcat-Eigenschaften werden von der Datei {0} in die Datei {1} migriert.
LOG_VARIABLES_SCANNING_EXCEPTION=Das Migrationstool konnte wegen der folgenden Ausnahme nicht feststellen, ob die Datei {0} auf Tomcat-Eigenschaften verweist:\n{1}
LOG_WAMT_EXCEPTION=Das Migrationstool konnte wegen der folgenden Ausnahme nicht feststellen, ob die Anwendung MongoDB verwendet: {0}.
LOG_WAMT_NOT_FOUND=Das Migrationstool konnte nicht feststellen, ob die Anwendung MongoDB verwendet. Wenn Ihre Anwendung MongoDB verwendet, installieren Sie das Anwendungsmigrationstool - Tomcat auf WebSphere und migrieren Sie die Anwendung erneut.

LOG_ACTION_VARIABLE_NOT_MIGRATED=Ma\u00dfnahme erforderlich: F\u00fcr die Variable {0}, die in der Datei {1} referenziert wird, konnte der Wert nicht ermittelt werden. Konfigurieren Sie die Variable auf dem Liberty-Server oder modifizieren Sie die Konfiguration so, dass sie nicht auf die Variable verweist. Die Standardposition f\u00fcr migrierte Variablen ist migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=Ma\u00dfnahme erforderlich: Die Variable {0}, die in der Datei {1} referenziert wird, wurde nicht migriert, weil ihr Name kein g\u00fcltiger Variablenname auf dem Liberty-Server ist. Konfigurieren Sie eine Variable mit g\u00fcltigem Namen oder modifizieren Sie die Konfiguration so, dass sie nicht auf die Variable verweist. Die Standardposition f\u00fcr migrierte Variablen ist migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=Ma\u00dfnahme erforderlich: Der Wert {0} der Variablen {1}, die in der Datei {2} referenziert wird, ist auf dem Liberty-Server ung\u00fcltig. Die Variable wurde daher nicht migriert. Konfigurieren Sie eine Variable ohne Variablenreferenz im Wert oder modifizieren Sie die Konfiguration so, dass die Variable nicht referenziert wird. Die Standardposition f\u00fcr migrierte Variablen ist migratedConfig/variables.xml.
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=Achtung: Das Realmelement mit dem classname-Attribut {0} wurde nicht migriert. Das Migrationstool unterst\u00fctzt nicht die Migration von Realmelementen in der Anwendungsdatei context.xml. Wenn Sie das Realmelement migrieren m\u00f6chten, verschieben Sie es in die Datei context.xml im Tomcat-Verzeichnis conf. Das Element wird dann mit der Tomcat-Serverkonfiguration migriert.
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=Achtung: Das Connector-Element mit dem Port {0} und dem Protokoll {1} wurde nicht migriert. Der Liberty-Server bietet keine Unterst\u00fctzung f\u00fcr dieses Protokoll.
LOG_ATTENTION_CONNECTOR_PORT_ZERO=Achtung: Ein Connector-Element mit dem Port 0 wurde nicht migriert. Der Liberty-Server bietet keine Unterst\u00fctzung f\u00fcr einen mit 0 definierten Port.
LOG_ATTENTION_EXCEPTION=Achtung: Das Migrationstool konnte wegen der folgenden Ausnahme nicht feststellen, ob Elemente aus der Datei {0} nicht migriert wurden:\n{0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=Achtung: Das JDBC-Ressourcenelement mit dem name-Attribut {0} und dem driverClassName-Attribut {1} wurde nicht migriert. Konfigurieren Sie das Element dataSource auf dem Liberty-Server, wenn das Element erforderlich ist.
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=Achtung: Das Realmelement der Datenquelle mit dem dataSourceName-Attribut {0} wurde nicht migriert. Das Migrationstool unterst\u00fctzt nicht die Migration dieses Realmelements. Konfigurieren Sie eine angepasste Benutzerregistry auf dem Liberty-Server, wenn das Element erforderlich ist.
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=Achtung: Das JAAS-Realmelement mit dem appName-Attribut {0} wurde nicht migriert. Das Migrationstool unterst\u00fctzt nicht die Migration dieses Realmelements. Konfigurieren Sie ein angepasstes JAAS-Anmeldemodul auf dem Liberty-Server, wenn das Element erforderlich ist. 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=Achtung: Das JDBC-Realmelement mit dem driverName-Attribut {0} wurde nicht migriert. Das Migrationstool unterst\u00fctzt nicht die Migration dieses Realmelements. Konfigurieren Sie eine angepasste Benutzerregistry auf dem Liberty-Server, wenn das Element erforderlich ist.
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=Achtung: Das JNDI-Realmelement mit dem connectionURL-Attribut {0} wurde nicht migriert. Das Migrationstool unterst\u00fctzt nicht die Migration dieses Realmelements. Konfigurieren Sie eine LDAP-Benutzerregistry auf dem Liberty-Server, wenn das Element erforderlich ist.
LOG_ATTENTION_MANAGER_NOT_MIGRATED=Achtung: Das Managerelement mit dem classname-Attribut {0} wurde nicht migriert. Das Migrationstool unterst\u00fctzt nicht die Migration dieses Managerelements. F\u00fcgen Sie das Feature sessionDatabase-1.0 hinzu und geben Sie in dem Feature die Elemente httpSession und httpSessionDatabase an, um Sitzungspersistenz f\u00fcr den Liberty-Server zu konfigurieren.
LOG_ATTENTION_REALM_NOT_MIGRATED=Achtung: Das Realmelement mit dem classname-Attribut {0} wurde nicht migriert. Das Migrationstool unterst\u00fctzt nicht die Migration dieses Realmelements.

LOG_WARNING_PW_NOT_ENCODED=Achtung: Das Attribut password wurde nicht verschl\u00fcsselt.
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=Achtung: Das Attribut password wurde nicht verschl\u00fcsselt, weil es auf eine Variable verweist. Suchen Sie die referenzierte Variable und stellen Sie sicher, dass der Wert dieser Variablen verschl\u00fcsselt ist, um die Sicherheit des Servers zu verbessern.
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=Achtung: Das Attribut password wurde wegen der folgenden Ausnahme nicht verschl\u00fcsselt:\n{0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=Achtung: Die password-Attribute wurden nicht verschl\u00fcsselt, weil das Liberty-Verzeichnis bin nicht gefunden wurde.

LOG_BINARY_SCANNER_NOT_FOUND=Der Bin\u00e4rscanner wurde nicht im Dateisystem gefunden. Deshalb kann die MongoDB-Konfiguration fehlen. Stellen Sie sicher, dass Sie alle erforderlichen Konfigurationsinformationen hinzuf\u00fcgen, wenn Ihre Anwendung MongoDB verwendet.
LOG_RULE_DIR_NOT_CREATED=Es konnte kein tempor\u00e4res Verzeichnis im Dateisystem erstellt werden. Deshalb kann die MongoDB-Konfiguration fehlen. Stellen Sie sicher, dass Sie alle erforderlichen Konfigurationsinformationen hinzuf\u00fcgen, wenn Ihre Anwendung MongoDB verwendet.
LOG_RULE_FILE_NOT_COPIED=Die Regel f\u00fcr die Erkennung der Mongo-Verwendung konnte nicht in das Dateisystem kopiert werden. Deshalb kann die Mongo-Konfiguration fehlen. Stellen Sie sicher, dass Sie alle erforderlichen Konfigurationsinformationen hinzuf\u00fcgen, wenn Ihre Anwendung MongoDB verwendet.
LOG_BINARY_SCAN_FAILURE=Der Bin\u00e4rscanner konnte nicht ausgef\u00fchrt werden. Deshalb kann die MongoDB-Konfiguration fehlen. Stellen Sie sicher, dass Sie alle erforderlichen Konfigurationsinformationen hinzuf\u00fcgen, wenn Ihre Anwendung MongoDB verwendet.
LOG_SCAN_OUTPUT_FILE_FAILURE=Die Ausgabedatei f\u00fcr den Bin\u00e4rscanner konnte wegen des folgenden Fehlers nicht erstellt werden:\n{0}
LOG_MONGO_EXCEPTION=Beim Scannen der Anwendung auf die Verwendung von MongoDB hin ist die folgende Ausnahme eingetreten:\n{0}

TITLE_APP_CONFIG=Migration der Tomcat-Anwendungskonfiguration
TITLE_SERVER_CONFIG=Migration der Tomcat-Serverkonfiguration
