# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=Poni\u017csza konfiguracja zosta\u0142a zmigrowana przy u\u017cyciu narz\u0119dzia Configuration Migration Tool serwera Tomcat.
MIGRATION_COMPLETE_NAMED_FILE=Poni\u017csza konfiguracja zosta\u0142a zmigrowana z pliku {0} przy u\u017cyciu narz\u0119dzia Configuration Migration Tool serwera Tomcat.
MIGRATION_GENERATED=Poni\u017csza konfiguracja zosta\u0142a wygenerowana przy u\u017cyciu narz\u0119dzia Configuration Migration Tool serwera Tomcat.
JMS_CLASS_CAST_WARNING=Uwaga: Klasa jmsConnectionFactory serwera Liberty nie implementuje interfejs\u00f3w javax.jms.QueueConnectionFactory i javax.jms.TopiConnectionFactory. \nW aplikacjach JMS wyst\u0105pi wyj\u0105tek ClassCastException, je\u015bli zostanie podj\u0119ta pr\u00f3ba rzutowania tej fabryki po\u0142\u0105cze\u0144 na dowolny z powy\u017cszych interfejs\u00f3w.
FILE_UPDATED=Poni\u017csza konfiguracja zosta\u0142a zaktualizowana przy u\u017cyciu narz\u0119dzia Configuration Migration Tool serwera Tomcat.
ACTION_JDBC_DRIVER=Wymagana czynno\u015b\u0107: W celu udost\u0119pnienia sterownika JDBC na potrzeby elementu dataSource {0} skopiuj sterownik JDBC do po\u0142o\u017cenia {1} lub zmodyfikuj konfiguracj\u0119 tak, aby wskazywa\u0142a po\u0142o\u017cenie sterownika JDBC.
ACTION_ORACLE_DRIVER=Wymagana czynno\u015b\u0107: W celu udost\u0119pnienia sterownika Oracle na potrzeby elementu dataSource {0} skopiuj zawarto\u015b\u0107 katalogu klienta Oracle do po\u0142o\u017cenia wsp\u00f3\u0142u\u017cytkowanej biblioteki {1} lub zmodyfikuj konfiguracj\u0119 tak, aby wskazywa\u0142a po\u0142o\u017cenie katalogu klienta Oracle.
ACTION_USER_PASSWORDS=Wymagana czynno\u015b\u0107: U\u017cyj edytora konfiguracji serwera Liberty, aby w migrowanej konfiguracji zmieni\u0107 atrybuty has\u0142a i ich kodowanie warto\u015bci\u0105 mieszaj\u0105c\u0105 na oryginalne niezaszyfrowane warto\u015bci z serwera Tomcat. Oryginalne has\u0142a s\u0105 szyfrowane przy u\u017cyciu algorytmu tworzenia skr\u00f3tu {0} i migrowane w postaci zaszyfrowanej.
STORAGE_REF_WARNING=Uwaga: Domy\u015blnie serwer Liberty przechowuje dane sesji w pami\u0119ci. \nAby skonfigurowa\u0107 trwa\u0142o\u015b\u0107 sesji w przypadku serwera Liberty, dodaj sk\u0142adnik sessionDatabase-1.0 i element httpSessionDatabase.
PATHNAME_WARNING=Uwaga: Atrybut pathname z mened\u017cera Standard Manager serwera Tomcat nie zosta\u0142 zmigrowany. Domy\u015blnie serwer Liberty przechowuje dane sesji w pami\u0119ci. \nAby skonfigurowa\u0107 trwa\u0142o\u015b\u0107 sesji w przypadku serwera Liberty, dodaj sk\u0142adnik sessionDatabase-1.0 i element httpSessionDatabase.
MQ_RESOURCE_ADAPTER_ACTION=Wymagana czynno\u015b\u0107: Aby m\u00f3c u\u017cywa\u0107 dostawcy przesy\u0142ania komunikat\u00f3w produktu WebSphere MQ na serwerze Liberty, skopiuj adapter zasob\u00f3w produktu WebSphere MQ do po\u0142o\u017cenia {0} lub zmodyfikuj konfiguracj\u0119 tak, aby wskazywa\u0142a po\u0142o\u017cenie adaptera zasob\u00f3w produktu WebSphere MQ.
MQ_NATIVE_LIB_ACTION=Wymagana czynno\u015b\u0107: Zmodyfikuj atrybut nativeLibraryPath tak, aby wskazywa\u0142 po\u0142o\u017cenie bibliotek rodzimych produktu WebSphere MQ.
MONGO_CLASSLOADER_NEEDED_ACTION=Wymagana czynno\u015b\u0107: W celu udost\u0119pnienia sterownika Java bazy danych MongoDB na potrzeby aplikacji skopiuj go do wsp\u00f3\u0142u\u017cytkowanej biblioteki {0} lub zmodyfikuj konfiguracj\u0119 tak, aby wskazywa\u0142a po\u0142o\u017cenie sterownika.
MULTIPLE_REDIRECT_PORTS=Uwaga: Port z obs\u0142ug\u0105 protoko\u0142u SSL {0} zosta\u0142 ju\u017c zdefiniowany przez element httpEndpoint i zosta\u0142 wy\u0142\u0105czony w elemencie httpEndpoint {1}. Podaj dost\u0119pny port w atrybucie httpsPort, aby w\u0142\u0105czy\u0107 obs\u0142ug\u0119 protok\u00f3\u0142 SSL w elemencie httpEndpoint.  Serwer Liberty nie obs\u0142uguje wielu element\u00f3w httpEndpoint z t\u0105 sam\u0105 warto\u015bci\u0105 atrybutu httpsPort. 
DEFAULT_SSL_GENERATED=Uwaga: Nie wykryto konfiguracji protoko\u0142u SSL w przypadku portu {0} z obs\u0142ug\u0105 protoko\u0142u SSL. Wygenerowano domy\u015bln\u0105 konfiguracj\u0119 protoko\u0142u SSL. 
PASSWORD_ENCODE_WARNING=Uwaga: Aby poprawi\u0107 bezpiecze\u0144stwo serwera, zmie\u0144 i zakoduj has\u0142o w elemencie {0}.
HTTPS_PORT_UNSUPPORTED_PROTOCOL=Uwaga: Port z obs\u0142ug\u0105 protoko\u0142u SSL {0}, do kt\u00f3rego odwo\u0142uje si\u0119 element konektora serwera Tomcat z portem {1}, korzysta z protoko\u0142u nieobs\u0142ugiwanego na serwerze Liberty. Wy\u0142\u0105czono atrybut httpsPort w elemencie httpEndpoint {2}.
HTTPS_CONNECTOR_MISSING=Uwaga: Element konektora serwera Tomcat z portem {0} odwo\u0142uje si\u0119 do portu z obs\u0142ug\u0105 protoko\u0142u SSL {1}, kt\u00f3ry nie zosta\u0142 zdefiniowany. Wy\u0142\u0105czono atrybut httpsPort w elemencie httpEndpoint {2}.
UNCOMMENT_VIRTUAL_HOST=Usu\u0144 oznaczenie preferowanego hosta wirtualnego aplikacji jako komentarza. Host wirtualny default_host (host_domy\u015blny) jest odpowiedni w przypadku wi\u0119kszo\u015bci prostych konfiguracji.
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=Nie, przeprowad\u017a migracj\u0119 tylko mojej aplikacji
DROPDOWN_DEFAULT_SELECT_AN_OPTION=Wybierz jedn\u0105 z opcji
DROPDOWN_TOMCATSERVER_FILESYSTEM=Tak, przeprowad\u017a r\u00f3wnie\u017c migracj\u0119 serwera z mojego systemu plik\u00f3w
DROPDOWN_TOMCATSERVER_WORKSPACE=Tak, przeprowad\u017a r\u00f3wnie\u017c migracj\u0119 serwera z mojego obszaru roboczego
TITLE_INFO=Informacja
TITLE_ERROR=B\u0142\u0105d
TITLE_LIBERTY_SELECT=Wyb\u00f3r serwera Liberty
TITLE_APP_ALREADY_MIGRATED=Aplikacja zosta\u0142a wcze\u015bniej zmigrowana na ten serwer
TITLE_SERVER_ALREADY_MIGRATED=Serwer Tomcat zosta\u0142 wcze\u015bniej zmigrowany na ten serwer
TITLE_SERVER_NOT_MIGRATED=Zale\u017cno\u015bci w konfiguracji serwera Tomcat
TITLE_SUCCESS_DIALOG=Konfiguracja zosta\u0142a pomy\u015blnie zmigrowana
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=Konfiguracja zosta\u0142a pomy\u015blnie zmigrowana \u2013 wymagana jest interwencja
TITLE_TOMCAT_SELECT=Wyb\u00f3r serwera Tomcat
TITLE_VIRTUAL_HOST_SELECT=Tworzenie powi\u0105zania aplikacji z hostem wirtualnym
APP_ALREADY_MIGRATED=Aplikacja {0} zosta\u0142a wcze\u015bniej zmigrowana do wybranego serwera Liberty ({1}). \n\nJe\u015bli b\u0119dziesz kontynuowa\u0107 migracj\u0119 aplikacji, pliki konfiguracyjne zostan\u0105 nadpisane, a odwo\u0142ania do plik\u00f3w konfiguracyjnych mog\u0105 zosta\u0107 utracone. Aby nie wyst\u0105pi\u0142y problemy, przeprowad\u017a migracj\u0119 aplikacji do innego serwera Liberty lub usu\u0144 wcze\u015bniej zmigrowan\u0105 konfiguracj\u0119 z serwera Liberty. \n\nCzy chcesz kontynuowa\u0107 migracj\u0119 aplikacji?
SERVER_ALREADY_MIGRATED=Serwer Tomcat zosta\u0142 wcze\u015bniej zmigrowany do wybranego serwera Liberty ({0}).\n\nJe\u015bli b\u0119dziesz kontynuowa\u0107 migracj\u0119 serwera Tomcat ({1}), pliki konfiguracyjne zostan\u0105 nadpisane, a odwo\u0142ania do plik\u00f3w konfiguracyjnych mog\u0105 zosta\u0107 utracone. Aby nie wyst\u0105pi\u0142y problemy, przeprowad\u017a migracj\u0119 serwera Tomcat do innego serwera Liberty lub usu\u0144 wcze\u015bniej zmigrowan\u0105 konfiguracj\u0119 z serwera Liberty. \n\nCzy chcesz kontynuowa\u0107 migracj\u0119 serwera Tomcat?
SERVER_NOT_MIGRATED=Aplikacja mo\u017ce by\u0107 zale\u017cna od ustawie\u0144 zdefiniowanych w odpowiedniej konfiguracji serwera Tomcat. Aby nie wyst\u0105pi\u0142y problemy, przeprowad\u017a najpierw migracj\u0119 konfiguracji serwera Tomcat do serwera Liberty, kt\u00f3ry b\u0119dzie udost\u0119pnia\u0142 aplikacj\u0119.\n\nCzy chcesz przeprowadzi\u0107 migracj\u0119 serwera Tomcat, a nast\u0119pnie przeprowadzi\u0107 migracj\u0119 aplikacji?
LIBERTY_SERVER_CHECKBOX=Konfiguracja serwera Liberty
APP_LOG_FILE_CHECKBOX=Plik dziennika migracji aplikacji
SERVER_LOG_FILE_CHECKBOX=Plik dziennika migracji serwera
DESC_LIBERTY_SELECT=Wybierz serwer Liberty. \nKonfiguracja serwera Tomcat zostanie zmigrowana do tego serwera.
MIGRATION_SUCCESS_DIALOG_SERVER=Konfiguracja serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nWi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=Konfiguracja serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nAby zako\u0144czy\u0107 konfiguracj\u0119, nale\u017cy wykona\u0107 dodatkowe czynno\u015bci. Wi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=Konfiguracja serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nWi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.\n\nWybierz pliki, kt\u00f3re chcesz otworzy\u0107:
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=Konfiguracja serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nAby zako\u0144czy\u0107 konfiguracj\u0119, nale\u017cy wykona\u0107 dodatkowe czynno\u015bci. Wi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.\n\nWybierz pliki, kt\u00f3re chcesz otworzy\u0107:
MIGRATION_SUCCESS_DIALOG_APPLICATION=Konfiguracja aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nWi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=Konfiguracja serwera Tomcat i aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nWi\u0119cej informacji na ten temat zawieraj\u0105 nast\u0119puj\u0105ce pliki dziennika:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=Konfiguracja aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nAby zako\u0144czy\u0107 konfiguracj\u0119, nale\u017cy wykona\u0107 dodatkowe czynno\u015bci. Wi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=Konfiguracja serwera Tomcat i aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nAby zako\u0144czy\u0107 konfiguracj\u0119, nale\u017cy wykona\u0107 dodatkowe czynno\u015bci. Wi\u0119cej informacji na ten temat zawieraj\u0105 nast\u0119puj\u0105ce pliki dziennika:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=Konfiguracja aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nWi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.\n\nWybierz pliki, kt\u00f3re chcesz otworzy\u0107:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=Konfiguracja serwera Tomcat i aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nWi\u0119cej informacji na ten temat zawieraj\u0105 nast\u0119puj\u0105ce pliki dziennika:\n{1}\n{2}\n\nWybierz pliki, kt\u00f3re chcesz otworzy\u0107:
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=Konfiguracja aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nAby zako\u0144czy\u0107 konfiguracj\u0119, nale\u017cy wykona\u0107 dodatkowe czynno\u015bci. Wi\u0119cej informacji na ten temat zawiera nast\u0119puj\u0105cy plik dziennika: {1}.\n\nWybierz pliki, kt\u00f3re chcesz otworzy\u0107:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=Konfiguracja serwera Tomcat i aplikacji zosta\u0142a pomy\u015blnie zmigrowana do nast\u0119puj\u0105cego serwera Liberty: {0}.\n\nAby zako\u0144czy\u0107 konfiguracj\u0119, nale\u017cy wykona\u0107 dodatkowe czynno\u015bci. Wi\u0119cej informacji na ten temat zawieraj\u0105 nast\u0119puj\u0105ce pliki dziennika:\n{1}\n{2}\n\nWybierz pliki, kt\u00f3re chcesz otworzy\u0107:
MIGRATION_FAILURE_DIALOG=Nie mo\u017cna przeprowadzi\u0107 migracji konfiguracji z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku:\n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=Dodawanie aplikacji do serwera Liberty...
PROGRESS_COPYING_LIBERTY_SERVER=Kopiowanie pliku server.xml serwera Liberty...
PROGRESS_GENERATING_CONFIG_FILE=Generowanie pliku konfiguracyjnego serwera Liberty...
PROGRESS_LOADING_CONFIG_INFO=\u0141adowanie informacji o konfiguracji...
PROGRESS_MIGRATING_APPLICATION=Trwa migracja konfiguracji aplikacji.
PROGRESS_MIGRATING_CONTEXT_XML=Migrowanie konfiguracji z pliku context.xml...
PROGRESS_MIGRATING_SERVER=Trwa migracja konfiguracji serwera Tomcat.
PROGRESS_MIGRATING_SERVER_XML=Migrowanie konfiguracji z pliku server.xml...
PROGRESS_MIGRATING_SHARED_LIBRARIES=Migrowanie bibliotek wsp\u00f3\u0142u\u017cytkowanych na potrzeby \u017ar\u00f3de\u0142 danych... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Migrowanie u\u017cytkownik\u00f3w i r\u00f3l serwera Tomcat...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE=Migrowanie u\u017cytkownik\u00f3w i r\u00f3l serwera Tomcat z pliku {0}...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Migrowanie u\u017cytkownik\u00f3w i r\u00f3l serwera Tomcat do pliku {0}...
PROGRESS_ENCODING_X_PASSWORDS=Kodowanie hase\u0142 ({0})...
PROGRESS_ENCODING_PASSWORD_X_OF_Y=Kodowanie hase\u0142: {0} z {1}...
PROGRESS_MIGRATING_VARIABLES=Migrowanie zmiennych serwera Tomcat z pliku catalina.properties...
PROGRESS_MIGRATING_WEB_XML=Migrowanie konfiguracji z pliku web.xml...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=Publikowanie aplikacji na serwerze Liberty...
PROGRESS_TITLE_CONFIG_MIGRATION=Post\u0119p migracji konfiguracji serwera Tomcat
PROGRESS_UPDATING_LIBERTY_SERVER=Aktualizowanie pliku server.xml serwera Liberty...
PROGRESS_VALIDATING_LIBERTY_SERVER=Sprawdzanie poprawno\u015bci konfiguracji serwera Liberty...
PROGRESS_VERIFYING_VIRTUAL_HOST=Sprawdzanie konfiguracji hosta wirtualnego na potrzeby aplikacji...
SELECTION_NOT_SUPPORTED=Nie mo\u017cna przeprowadzi\u0107 migracji bie\u017c\u0105cego wyboru. Wybierz serwer Tomcat lub projekt Java, kt\u00f3ry zawiera aplikacj\u0119 serwera Tomcat.
NO_CONFIG_FOUND=Nie mo\u017cna przeprowadzi\u0107 migracji bie\u017c\u0105cego wyboru. Nie znaleziono konfiguracji serwera Tomcat.
SERVER_TYPE_ERROR=Nie mo\u017cna przeprowadzi\u0107 migracji wybranego serwera. Wybierz serwer Tomcat.       
LIBERTY_CONFIG_NOT_FOUND=Nie mo\u017cna przeprowadzi\u0107 migracji konfiguracji, poniewa\u017c nie znaleziono konfiguracji serwera Liberty.
INVALID_JAVA_PROJECT=Nie mo\u017cna przeprowadzi\u0107 migracji wybranego projektu Java, poniewa\u017c nie zawiera on katalogu {0}.
NO_WEB_XML=Nie mo\u017cna przeprowadzi\u0107 migracji wybranego projektu Java, poniewa\u017c nie zawiera on pliku {0}.
NOT_TOMCAT_SERVER_DIR=Nie mo\u017cna przeprowadzi\u0107 migracji bie\u017c\u0105cego wyboru, poniewa\u017c nie jest on poprawnym serwerem Tomcat.
NOT_TOMCAT_SERVER_FILE=Nie mo\u017cna przeprowadzi\u0107 migracji wybranego serwera, poniewa\u017c nie zawiera on nast\u0119puj\u0105cego pliku: {0}.
NO_LIBERTY_SERVER_XML=Wybrany serwer Liberty nie zawiera pliku konfiguracyjnego server.xml.
MISSING_LIBERTY_DIRECTORY=Wybrany serwer Liberty nie jest poprawny. Nie zawiera on katalogu {0}.
SELECT_TOMCAT_SERVER=Wybierz serwer Tomcat do zmigrowania.
SELECT_VIRTUAL_HOST=Wybierz host wirtualny na potrzeby aplikacji.\n\nHost wirtualny default_host (host_domy\u015blny) jest odpowiedni w przypadku wi\u0119kszo\u015bci prostych konfiguracji.

# Exceptions
EXCEPT_LOG_CREATE_ERROR=Nie mo\u017cna utworzy\u0107 nast\u0119puj\u0105cego pliku dziennika przy u\u017cyciu narz\u0119dzia Configuration Migration Tool serwera Tomcat: {0}.
INVALID_WAR_FILE=Podany plik WAR aplikacji nie istnieje lub nie jest plikiem .war: {0}.
INVALID_OUTPUT_DIRECTORY=Nie mo\u017cna utworzy\u0107 podanego katalogu wyj\u015bciowego: {0}.
INVALID_DIRECTORY=Podany katalog nie jest poprawny: {0}.
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= Nie okre\u015blono katalogu serwera Liberty.
TEMP_FILE_DELETE_FAIL=Nie mo\u017cna usun\u0105\u0107 jednego lub kilku plik\u00f3w tymczasowych utworzonych podczas migracji.

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=Aplikacja zosta\u0142a dodana do serwera Liberty.
LOG_ADDED_INCLUDE_FILE=Plik konfiguracyjny serwera ({0}) zosta\u0142 uwzgl\u0119dniony w pliku {1}. 
LOG_APP_CONFIG_MIG_FAILED=Nie mo\u017cna przeprowadzi\u0107 migracji konfiguracji aplikacji serwera Tomcat z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku:\n{0}
LOG_APP_CONFIG_MIG_NO_SERVER=Konfiguracja aplikacji serwera Tomcat zosta\u0142a zmigrowana, ale aplikacja nie zosta\u0142a dodana do serwera Liberty, poniewa\u017c nie podano serwera.
LOG_APP_CONFIG_MIG_WITH_ERROR=Konfiguracja aplikacji serwera Tomcat zosta\u0142a zmigrowana, ale aplikacja nie zosta\u0142a dodana do serwera Liberty z powodu wyst\u0105pienia wcze\u015bniej zarejestrowanego wyj\u0105tku dotycz\u0105cego publikowania.
LOG_APP_PUBLISH_FAILED=Nie mo\u017cna opublikowa\u0107 aplikacji na serwerze Liberty z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku:\n{0}
LOG_APP_PUBLISH_OK=Aplikacja zosta\u0142a pomy\u015blnie opublikowana na serwerze Liberty.
LOG_APP_RESOURCES_SKIP=Nie zostan\u0105 zmigrowane \u017cadne zasoby aplikacji, poniewa\u017c plik context.xml aplikacji nie istnieje.
LOG_APP_RESOURCES_START=Trwa migracja zasob\u00f3w aplikacji z pliku {0} do pliku {1}.
LOG_APP_VIRTUAL_HOST_GENERATE=Trwa generowanie pliku aplikacji ibm-web-bnd.xml z hostem wirtualnym {0}.
LOG_APP_VIRTUAL_HOST_START=Trwa konfigurowanie hosta wirtualnego na potrzeby aplikacji.
LOG_APP_VIRTUAL_HOST_UPDATE=Trwa aktualizowanie pliku ibm-web-bnd.xml aplikacji informacjami o ho\u015bcie wirtualnym {0}.
LOG_COPY_SERVER_XML=Tre\u015b\u0107 oryginalnego pliku server.xml serwera Liberty zosta\u0142a zapisana w pliku {0}.
LOG_COPY_APP_WEB_BND_XML=Tre\u015b\u0107 oryginalnego pliku ibm-web-bnd.xml aplikacji zosta\u0142a zapisana w pliku {0}.
LOG_GEN_TOP_LEVEL_CONFIG=Plik konfiguracyjny {0} zosta\u0142 wygenerowany i zostanie uwzgl\u0119dniony w pliku server.xml serwera Liberty.
LOG_HDR_APP_CONTEXT_XML=Plik context.xml aplikacji: {0}
LOG_HDR_APP_NAME=Nazwa aplikacji: {0}
LOG_HDR_APP_WEB_XML=Plik web.xml aplikacji: {0}
LOG_HDR_LIBERTY_SERVER_DIR=Katalog serwera Liberty: {0}
LOG_HDR_NO_APP_CONTEXT_XML=Plik context.xml aplikacji nie istnieje, dlatego nie zostanie zmigrowany.
LOG_HDR_TOMCAT_SERVER_DIR=Katalog serwera Tomcat: {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=Katalog \u015brodowiska wykonawczego serwera Tomcat: {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=Katalog \u015brodowiska wykonawczego serwera Tomcat w katalogu CATALINA_HOME: {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=Katalog konfiguracji serwera Tomcat: {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=Katalog konfiguracji serwera Tomcat w katalogu CATALINA_HOME: {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=Aplikacja nie zosta\u0142a dodana do serwera Liberty z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku:\n{0}
LOG_BEGINNING={0} \u2013 pocz\u0105tkowy wpis w dzienniku
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=dd.MM.yyyy, kk:mm:ss:SSS z
LOG_DELETE_FILE_ERROR=Nie mo\u017cna usun\u0105\u0107 pliku tymczasowego {0}.
LOG_END={0} \u2013 ko\u0144cowy wpis w dzienniku
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE=Nie mo\u017cna zamkn\u0105\u0107 pliku {0}.
LOG_FILE_COPIED=Plik {0} zosta\u0142 skopiowany z katalogu {1} do katalogu {2}.
LOG_FILE_COPIED_ERROR=Plik {0} nie zosta\u0142 skopiowany z katalogu {1} do katalogu {2} z powodu wyst\u0105pienia nast\u0119puj\u0105cego b\u0142\u0119du: \n{3}.
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR=Sterownik wymagany na potrzeby bazy danych {0} nie zosta\u0142 skopiowany do po\u0142o\u017cenia {1}, poniewa\u017c katalog docelowy nie istnieje.

LOG_MIME_TYPES_SKIP=Artefakty web.xml serwera nie zostan\u0105 zmigrowane, poniewa\u017c plik {0} nie istnieje.
LOG_MIME_TYPES_START=Trwa migracja element\u00f3w mime-mapping z pliku {0} do pliku {1}.
LOG_RESOURCE_AND_HTTP_SKIP=Elementy zasob\u00f3w ani elementy konektora HTTP nie zostan\u0105 zmigrowane, poniewa\u017c plik {0} nie istnieje.
LOG_RESOURCE_AND_HTTP_START=Trwa migracja element\u00f3w zasob\u00f3w i element\u00f3w konektora HTTP z pliku {0} do pliku {1}.
LOG_SEC_CONSTRAINTS_SKIP=W ograniczeniach dotycz\u0105cych zabezpiecze\u0144 aplikacji serwera Tomcat nie zosta\u0142a ustawiona warto\u015b\u0107 atrybutu allRolesMode. Jako warto\u015b\u0107 zostanie domy\u015blnie ustawiona warto\u015b\u0107 'strict' ('\u015bcis\u0142e').
LOG_SEC_CONSTRAINTS_START=Trwa migracja ogranicze\u0144 dotycz\u0105cych zabezpiecze\u0144 aplikacji z pliku {0} do pliku {1}.
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=Nie mo\u017cna przeprowadzi\u0107 migracji konfiguracji serwera Tomcat z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku:\n{0}
LOG_SERVER_CONFIG_SUCCESSFUL=Konfiguracja serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana.
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=Konfiguracja serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana, ale nale\u017cy dodatkowo zaktualizowa\u0107 konfiguracj\u0119. Wi\u0119cej informacji na ten temat zawieraj\u0105 wcze\u015bniejsze wpisy w tym pliku dziennika.
LOG_SERVER_NOT_MIGRATED=Uwaga: Migrowana aplikacja mo\u017ce by\u0107 zale\u017cna od ustawie\u0144 zdefiniowanych w odpowiedniej konfiguracji serwera Tomcat. Aby nie wyst\u0105pi\u0142y problemy, przeprowad\u017a migracj\u0119 konfiguracji serwera Tomcat przed uruchomieniem aplikacji.
LOG_SHARED_LIB_DATASOURCE=Trwa dodawanie konfiguracji biblioteki wsp\u00f3\u0142u\u017cytkowanej {0} do pliku {1}. Ta konfiguracja jest przywo\u0142ywana przez elementy \u017ar\u00f3d\u0142a danych.
LOG_SHARED_LIB_CLASSLOADER=Trwa dodawanie konfiguracji biblioteki wsp\u00f3\u0142u\u017cytkowanej {0} do pliku {1}. Ta konfiguracja jest przywo\u0142ywana przez elementy programu \u0142aduj\u0105cego klasy aplikacji.
LOG_STANDARD_MANAGER_SKIP=Elementy zasob\u00f3w i elementy mened\u017cera Standard Manager nie zostan\u0105 zmigrowane, poniewa\u017c plik {0} nie istnieje.
LOG_STANDARD_MANAGER_START=Trwa migracja element\u00f3w zasob\u00f3w i element\u00f3w mened\u017cera Standard Manager z pliku {0} do pliku {1}.
LOG_TOMCAT_APP_MIG_OK=Konfiguracja aplikacji serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana.
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=Konfiguracja aplikacji serwera Tomcat zosta\u0142a pomy\u015blnie zmigrowana, ale nale\u017cy dodatkowo zaktualizowa\u0107 konfiguracj\u0119. Wi\u0119cej informacji na ten temat zawieraj\u0105 wcze\u015bniejsze wpisy w tym pliku dziennika.
LOG_UPDATE_LIBERTY_SERVER_START=Trwa aktualizacja serwera Liberty za pomoc\u0105 zmigrowanej konfiguracji.
LOG_USERS_EXCEPTION=Narz\u0119dzie migracji nie mo\u017ce okre\u015bli\u0107, czy istniej\u0105 dodatkowe pliki u\u017cytkownik\u00f3w i r\u00f3l z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku: \n{0}
LOG_USERS_NO_FILE=Nie zmigrowano plik\u00f3w u\u017cytkownik\u00f3w serwera Tomcat. Aby sprawdzi\u0107, czy pliki zosta\u0142y pomini\u0119te, poniewa\u017c nie mo\u017cna by\u0142o ich znale\u017a\u0107, przejrzyj inne wpisy w tym pliku dziennika.
LOG_USERS_SKIP=Elementy u\u017cytkownik\u00f3w i r\u00f3l nie zostan\u0105 zmigrowane, poniewa\u017c plik {0} nie istnieje.
LOG_USERS_START=Trwa migracja element\u00f3w u\u017cytkownik\u00f3w i r\u00f3l z pliku {0} do pliku {1}.
LOG_USERS_TEMP_FILE_ERROR=Narz\u0119dzie migracji nie mo\u017ce znale\u017a\u0107 pliku tymczasowego {0}.
LOG_VARIABLES_START=Trwa migracja w\u0142a\u015bciwo\u015bci serwera Tomcat przywo\u0142ywanych przez wygenerowan\u0105 konfiguracj\u0119 z pliku {0} do pliku {1}.
LOG_VARIABLES_SCANNING_EXCEPTION=Narz\u0119dzie migracji nie mo\u017ce okre\u015bli\u0107, czy w pliku {0} istniej\u0105 odwo\u0142ania do w\u0142a\u015bciwo\u015bci serwera Tomcat z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku:\n {1}
LOG_WAMT_EXCEPTION=Narz\u0119dzie migracji nie mo\u017ce okre\u015bli\u0107, czy aplikacja korzysta z bazy danych MongoDB z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku: {0}
LOG_WAMT_NOT_FOUND=Narz\u0119dzie migracji nie mo\u017ce okre\u015bli\u0107, czy aplikacja korzysta z bazy danych MongoDB. Je\u015bli aplikacja korzysta z bazy danych MongoDB, zainstaluj narz\u0119dzie Application Migration Tool \u2013 Apache Tomcat to WebSphere, a nast\u0119pnie ponownie przeprowad\u017a migracj\u0119.

LOG_ACTION_VARIABLE_NOT_MIGRATED=Wymagana czynno\u015b\u0107: Nie mo\u017cna okre\u015bli\u0107 warto\u015bci zmiennej {0}, do kt\u00f3rej istnieje odwo\u0142anie w pliku {1}. Skonfiguruj zmienn\u0105 na serwerze Liberty lub zmodyfikuj konfiguracj\u0119 tak, aby nie istnia\u0142o odwo\u0142anie do tej zmiennej. Domy\u015blnie zmienne s\u0105 migrowane do pliku migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=Wymagana czynno\u015b\u0107: Zmienna {0}, do kt\u00f3rej istnieje odwo\u0142anie w pliku {1}, nie zosta\u0142a zmigrowana, poniewa\u017c jej nazwa nie jest poprawn\u0105 nazw\u0105 zmiennej na serwerze Liberty. Skonfiguruj zmienn\u0105 z poprawn\u0105 nazw\u0105 lub zmodyfikuj konfiguracj\u0119 tak, aby nie istnia\u0142o odwo\u0142anie do tej zmiennej. Domy\u015blnie zmienne s\u0105 migrowane do pliku migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=Wymagana czynno\u015b\u0107: Warto\u015b\u0107 {0} zmiennej {1}, do kt\u00f3rej istnieje odwo\u0142anie w pliku {2}, nie jest poprawna na serwerze Liberty, dlatego zmienna nie zosta\u0142a zmigrowana. Skonfiguruj zmienn\u0105 bez odwo\u0142ania do zmiennej w jej warto\u015bci lub zmodyfikuj konfiguracj\u0119 tak, aby nie istnia\u0142o odwo\u0142anie do zmiennej. Domy\u015blnie zmienne s\u0105 migrowane do pliku migratedConfig/variables.xml.
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=Uwaga: Element dziedziny z atrybutem className {0} nie zosta\u0142 zmigrowany. Narz\u0119dzie migracji nie obs\u0142uguje migrowania element\u00f3w dziedzin znajduj\u0105cych si\u0119 w pliku context.xml aplikacji. Aby przeprowadzi\u0107 migracj\u0119 elementu dziedziny, przenie\u015b element do pliku context.xml znajduj\u0105cego si\u0119 w katalogu conf serwera Tomcat, aby element zosta\u0142 zmigrowany z konfiguracj\u0105 serwera Tomcat.
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=Uwaga: Element konektora z portem {0} i protoko\u0142em {1} nie zosta\u0142 zmigrowany. Serwer Liberty nie obs\u0142uguje tego protoko\u0142u.
LOG_ATTENTION_CONNECTOR_PORT_ZERO=Uwaga: Element konektora z portem 0 nie zosta\u0142 zmigrowany. Serwer Liberty nie obs\u0142uguje definicji portu 0.
LOG_ATTENTION_EXCEPTION=Uwaga: Narz\u0119dzie migracji nie mo\u017ce okre\u015bli\u0107, czy jakie\u015b elementy nie zosta\u0142y zmigrowane z pliku {0} z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku: \n{0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=Uwaga: Element zasobu JDBC z atrybutem name {0} i atrybutem driverClassName {1} nie zosta\u0142 zmigrowany. Je\u015bli ten element jest wymagany, skonfiguruj element dataSource na serwerze Liberty.
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=Uwaga: Element dziedziny \u017ar\u00f3d\u0142a danych z atrybutem dataSourceName {0} nie zosta\u0142 zmigrowany. Narz\u0119dzie migracji nie obs\u0142uguje migrowania tego elementu dziedziny. Je\u015bli ten element jest wymagany, skonfiguruj niestandardowy rejestr u\u017cytkownik\u00f3w na serwerze Liberty.
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=Uwaga: Element dziedziny JAAS z atrybutem appName {0} nie zosta\u0142 zmigrowany. Narz\u0119dzie migracji nie obs\u0142uguje migrowania tego elementu dziedziny. Je\u015bli ten element jest wymagany, skonfiguruj niestandardowy modu\u0142 logowania JAAS na serwerze Liberty. 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=Uwaga: Element dziedziny JDBC z atrybutem driverName {0} nie zosta\u0142 zmigrowany. Narz\u0119dzie migracji nie obs\u0142uguje migrowania tego elementu dziedziny. Je\u015bli ten element jest wymagany, skonfiguruj niestandardowy rejestr u\u017cytkownik\u00f3w na serwerze Liberty.
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=Uwaga: Element dziedziny JNDI z atrybutem connectionURL {0} nie zosta\u0142 zmigrowany. Narz\u0119dzie migracji nie obs\u0142uguje migrowania tego elementu dziedziny. Je\u015bli ten element jest wymagany, skonfiguruj rejestr u\u017cytkownik\u00f3w LDAP na serwerze Liberty.
LOG_ATTENTION_MANAGER_NOT_MIGRATED=Uwaga: Element mened\u017cera z atrybutem className {0} nie zosta\u0142 zmigrowany. Narz\u0119dzie migracji nie obs\u0142uguje migrowania tego elementu mened\u017cera. Aby skonfigurowa\u0107 trwa\u0142o\u015b\u0107 sesji w przypadku serwera Liberty, dodaj sk\u0142adnik sessionDatabase-1.0 i okre\u015bl elementy httpSession i httpSessionDatabase w sk\u0142adniku.
LOG_ATTENTION_REALM_NOT_MIGRATED=Uwaga: Element dziedziny z atrybutem className {0} nie zosta\u0142 zmigrowany. Narz\u0119dzie migracji nie obs\u0142uguje migrowania tego elementu dziedziny.

LOG_WARNING_PW_NOT_ENCODED=Uwaga: Atrybut has\u0142a nie zosta\u0142 zakodowany.
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=Uwaga: Atrybut has\u0142a nie zosta\u0142 zakodowany, poniewa\u017c odwo\u0142uje si\u0119 do zmiennej. Aby poprawi\u0107 bezpiecze\u0144stwo serwera, znajd\u017a przywo\u0142ywan\u0105 zmienn\u0105 i upewnij si\u0119, \u017ce warto\u015b\u0107 jest kodowana.
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=Uwaga: Atrybut has\u0142a nie zosta\u0142 zakodowany z powodu wyst\u0105pienia nast\u0119puj\u0105cego wyj\u0105tku: \n{0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=Uwaga: Atrybuty hase\u0142 nie zosta\u0142y zakodowane, poniewa\u017c nie mo\u017cna znale\u017a\u0107 katalogu bin serwera Liberty.

LOG_BINARY_SCANNER_NOT_FOUND=Nie mo\u017cna znale\u017a\u0107 skanera binarnego w systemie plik\u00f3w. Oznacza to, \u017ce mo\u017ce brakowa\u0107 konfiguracji bazy danych MongoDB. Je\u015bli aplikacja korzysta z bazy danych MongoDB, sprawd\u017a, czy uwzgl\u0119dniono wszystkie niezb\u0119dne konfiguracje.
LOG_RULE_DIR_NOT_CREATED=Nie mo\u017cna utworzy\u0107 katalogu tymczasowego w systemie plik\u00f3w. Oznacza to, \u017ce mo\u017ce brakowa\u0107 konfiguracji bazy danych MongoDB. Je\u015bli aplikacja korzysta z bazy danych MongoDB, sprawd\u017a, czy uwzgl\u0119dniono wszystkie niezb\u0119dne konfiguracje.
LOG_RULE_FILE_NOT_COPIED=Nie mo\u017cna skopiowa\u0107 regu\u0142y wykrywania wyst\u0105pie\u0144 u\u017cycia bazy danych Mongo do systemu plik\u00f3w. Oznacza to, \u017ce mo\u017ce brakowa\u0107 konfiguracji bazy danych Mongo. Je\u015bli aplikacja korzysta z bazy danych MongoDB, sprawd\u017a, czy uwzgl\u0119dniono wszystkie niezb\u0119dne konfiguracje.
LOG_BINARY_SCAN_FAILURE=Nie powiod\u0142a si\u0119 pr\u00f3ba uruchomienia skanera binarnego. Oznacza to, \u017ce mo\u017ce brakowa\u0107 konfiguracji bazy danych MongoDB. Je\u015bli aplikacja korzysta z bazy danych MongoDB, sprawd\u017a, czy uwzgl\u0119dniono wszystkie niezb\u0119dne konfiguracje.
LOG_SCAN_OUTPUT_FILE_FAILURE=Nie mo\u017cna utworzy\u0107 pliku wyj\u015bciowego skanera binarnego z powodu wyst\u0105pienia nast\u0119puj\u0105cego b\u0142\u0119du:\n {0}
LOG_MONGO_EXCEPTION=Podczas skanowania aplikacji w celu sprawdzenia, czy korzysta z bazy danych MongoDB, wyst\u0105pi\u0142 nast\u0119puj\u0105cy wyj\u0105tek:\n {0}

TITLE_APP_CONFIG=Migracja konfiguracji aplikacji serwera Tomcat
TITLE_SERVER_CONFIG=Migracja konfiguracji serwera Tomcat
