# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=A configura\u00e7\u00e3o a seguir foi migrada pela ferramenta de migra\u00e7\u00e3o de configura\u00e7\u00e3o do Tomcat.
MIGRATION_COMPLETE_NAMED_FILE=A configura\u00e7\u00e3o a seguir foi migrada do arquivo {0} pela ferramenta de migra\u00e7\u00e3o de configura\u00e7\u00e3o do Tomcat.
MIGRATION_GENERATED=A configura\u00e7\u00e3o a seguir foi gerada pela ferramenta de migra\u00e7\u00e3o de configura\u00e7\u00e3o do Tomcat.
JMS_CLASS_CAST_WARNING=Aten\u00e7\u00e3o: O jmsConnectionFactory do Liberty n\u00e3o implementa as interfaces javax.jms.QueueConnectionFactory e javax.jms.TopiConnectionFactory. \nOs aplicativos JMS obter\u00e3o uma ClassCastException se tentarem converter esse connection factory em qualquer interface.
FILE_UPDATED=A configura\u00e7\u00e3o a seguir foi atualizada pela ferramenta de migra\u00e7\u00e3o de configura\u00e7\u00e3o do Tomcat.
ACTION_JDBC_DRIVER=A\u00e7\u00e3o necess\u00e1ria: Para tornar o driver JDBC acess\u00edvel para o elemento dataSource {0}, copie o driver JDBC no local {1} ou modifique a configura\u00e7\u00e3o para apontar para o local do driver JDBC.
ACTION_ORACLE_DRIVER=A\u00e7\u00e3o necess\u00e1ria: Para disponibilizar o driver do Oracle acess\u00edvel para o elemento dataSource {0}, copie o conte\u00fado do diret\u00f3rio do cliente Oracle no local para a biblioteca compartilhada {1} ou modifique a configura\u00e7\u00e3o para apontar para o local do diret\u00f3rio do cliente Oracle.
ACTION_USER_PASSWORDS=A\u00e7\u00e3o necess\u00e1ria: Use o Editor de configura\u00e7\u00e3o do Liberty para mudar e efetuar codifica\u00e7\u00e3o hash dos atributos de senha na configura\u00e7\u00e3o migrada para os valores originais n\u00e3o criptografados do servidor Tomcat. As senhas original foram criptografadas com o algoritmo digest {0} e foram migradas em sua forma criptografada.
STORAGE_REF_WARNING=Aten\u00e7\u00e3o: Por padr\u00e3o, o Liberty armazena dados de sess\u00e3o na mem\u00f3ria. \nPara configurar persist\u00eancia de sess\u00e3o para o servidor Liberty, inclua o recurso sessionDatabase-1.0 e um elemento httpSessionDatabase para configurar a persist\u00eancia de sess\u00e3o.
PATHNAME_WARNING=Aten\u00e7\u00e3o: O atributo pathname do Tomcat Standard Manager n\u00e3o foi migrado. Por padr\u00e3o, o Liberty armazena dados de sess\u00e3o na mem\u00f3ria. \nPara configurar persist\u00eancia de sess\u00e3o para o servidor Liberty, inclua o recurso sessionDatabase-1.0 e um elemento httpSessionDatabase para configurar a persist\u00eancia de sess\u00e3o.
MQ_RESOURCE_ADAPTER_ACTION=A\u00e7\u00e3o necess\u00e1ria: Para usar o provedor de sistemas de mensagens do WebSphere MQ no Liberty, copie o adaptador de recursos do WebSphere MQ no local {0} ou modifique a configura\u00e7\u00e3o para apontar para o local do adaptador de recursos do WebSphere MQ.
MQ_NATIVE_LIB_ACTION=A\u00e7\u00e3o necess\u00e1ria: Modifique o atributo nativeLibraryPath para apontar para o local das bibliotecas nativas do WebSphere MQ.
MONGO_CLASSLOADER_NEEDED_ACTION=A\u00e7\u00e3o necess\u00e1ria: Para tornar o Driver Java MongoDB acess\u00edvel para o aplicativo, copie o driver na biblioteca compartilhada {0} ou modifique a configura\u00e7\u00e3o para apontar para o local do driver.
MULTIPLE_REDIRECT_PORTS=Aten\u00e7\u00e3o: A porta ativada para SSL {0} j\u00e1 est\u00e1 definida por um elemento httpEndpoint e foi desativada no elemento httpEndpoint {1}. Especifique uma porta dispon\u00edvel no atributo httpsPort para ativar o SSL no elemento httpEndpoint.  O Liberty n\u00e3o suporta elementos httpEndpoint m\u00faltiplos com o mesmo valor de atributo httpsPort. 
DEFAULT_SSL_GENERATED=Aten\u00e7\u00e3o: Nenhuma configura\u00e7\u00e3o SSL foi detectada para a porta ativada SSL {0}. A configura\u00e7\u00e3o SSL padr\u00e3o foi gerada. 
PASSWORD_ENCODE_WARNING=Aten\u00e7\u00e3o: Para melhorar a seguran\u00e7a do servidor, mude e codifique a senha no elemento {0}.
HTTPS_PORT_UNSUPPORTED_PROTOCOL=Aten\u00e7\u00e3o: A porta ativada para SSL {0} que \u00e9 referenciada pelo elemento de Conector do Tomcat com a porta {1} usa um protocolo que n\u00e3o \u00e9 suportado no servidor Liberty. O atributo httpsPort no elemento httpEndpoint {2} foi desativado.
HTTPS_CONNECTOR_MISSING=Aten\u00e7\u00e3o: O elemento de Conector do Tomcat com a porta {0} faz refer\u00eancia a uma porta ativada para SSL {1} que n\u00e3o est\u00e1 definida. O atributo httpsPort no elemento httpEndpoint {2} foi desativado.
UNCOMMENT_VIRTUAL_HOST=Remova o coment\u00e1rio do host virtual preferencial para o seu aplicativo. O host virtual default_host \u00e9 adequado para a maioria das configura\u00e7\u00f5es simples.
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=N\u00e3o, migrar o meu aplicativo apenas
DROPDOWN_DEFAULT_SELECT_AN_OPTION=Selecione um
DROPDOWN_TOMCATSERVER_FILESYSTEM=Sim, migrar tamb\u00e9m um servidor do meu sistema de arquivos
DROPDOWN_TOMCATSERVER_WORKSPACE=Sim, migrar tamb\u00e9m um servidor da minha \u00e1rea de trabalho
TITLE_INFO=Informa\u00e7\u00f5es
TITLE_ERROR=Erro
TITLE_LIBERTY_SELECT=Sele\u00e7\u00e3o do servidor Liberty
TITLE_APP_ALREADY_MIGRATED=Aplicativo migrado anteriormente para esse servidor
TITLE_SERVER_ALREADY_MIGRATED=Servidor Tomcat migrado anteriormente para esse servidor
TITLE_SERVER_NOT_MIGRATED=Depend\u00eancias da configura\u00e7\u00e3o do servidor Tomcat
TITLE_SUCCESS_DIALOG=Configura\u00e7\u00e3o migrada com \u00eaxito
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=Configura\u00e7\u00e3o migrada com \u00eaxito - A\u00e7\u00e3o necess\u00e1ria
TITLE_TOMCAT_SELECT=Sele\u00e7\u00e3o do servidor Tomcat
TITLE_VIRTUAL_HOST_SELECT=Aplicativo de liga\u00e7\u00e3o para um host virtual
APP_ALREADY_MIGRATED=O aplicativo {0} foi migrado anteriormente para o servidor Liberty selecionado, {1}.\n\nSe voc\u00ea continuar a migrar o aplicativo, os arquivos de configura\u00e7\u00e3o ser\u00e3o sobrescritos e refer\u00eancias para os arquivos de configura\u00e7\u00e3o poder\u00e3o ser perdidas. Para evitar problemas, migre seu aplicativo para um servidor Liberty diferente ou remova a configura\u00e7\u00e3o migrada anteriormente do servidor Liberty.\n\nDeseja continuar a migrar seu aplicativo?
SERVER_ALREADY_MIGRATED=Um servidor Tomcat foi migrado anteriormente para o servidor Liberty selecionado, {0}.\n\nSe voc\u00ea continuar a migrar o servidor Tomcat selecionado, {1}, arquivos de configura\u00e7\u00e3o ser\u00e3o sobrescritos e refer\u00eancias para os arquivos de configura\u00e7\u00e3o poder\u00e3o ser perdidas. Para evitar problemas, migre o servidor Tomcat para um servidor Liberty diferente ou remova a configura\u00e7\u00e3o migrada anteriormente do servidor Liberty.\n\nDeseja continuar a migrar seu servidor Tomcat?
SERVER_NOT_MIGRATED=O aplicativo pode depender de configura\u00e7\u00f5es definidas na configura\u00e7\u00e3o do servidor Tomcat correspondente. Para evitar problemas, primeiro migre a configura\u00e7\u00e3o do servidor Tomcat para o servidor Liberty que hospedar\u00e1 o aplicativo.\n\nDeseja migrar o servidor Tomcat e depois migrar o aplicativo?
LIBERTY_SERVER_CHECKBOX=Configura\u00e7\u00e3o do servidor Liberty
APP_LOG_FILE_CHECKBOX=Arquivo de log de migra\u00e7\u00e3o do aplicativo
SERVER_LOG_FILE_CHECKBOX=Arquivo de log de migra\u00e7\u00e3o do servidor
DESC_LIBERTY_SELECT=Selecione um servidor Liberty. \nA configura\u00e7\u00e3o do Tomcat ser\u00e1 migrada para esse servidor.
MIGRATION_SUCCESS_DIALOG_SERVER=A configura\u00e7\u00e3o do servidor Tomcat foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\nPara obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=A configura\u00e7\u00e3o do servidor Tomcat foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\n\u00c9 necess\u00e1ria a\u00e7\u00e3o posterior para concluir a configura\u00e7\u00e3o. Para obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=A configura\u00e7\u00e3o do servidor Tomcat foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\nPara obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.\n\nSelecione os arquivos que voc\u00ea deseja abrir:
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=A configura\u00e7\u00e3o do servidor Tomcat foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\n\u00c9 necess\u00e1ria a\u00e7\u00e3o posterior para concluir a configura\u00e7\u00e3o. Para obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.\n\nSelecione os arquivos que voc\u00ea deseja abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION=A configura\u00e7\u00e3o do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\nPara obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=A configura\u00e7\u00e3o do servidor Tomcat e do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\nPara obter mais informa\u00e7\u00f5es, veja os arquivos de log a seguir:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=A configura\u00e7\u00e3o do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\n\u00c9 necess\u00e1ria a\u00e7\u00e3o posterior para concluir a configura\u00e7\u00e3o. Para obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=A configura\u00e7\u00e3o do servidor Tomcat e do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\n\u00c9 necess\u00e1ria a\u00e7\u00e3o posterior para concluir a configura\u00e7\u00e3o. Para obter mais informa\u00e7\u00f5es, veja os arquivos de log a seguir:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=A configura\u00e7\u00e3o do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\nPara obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.\n\nSelecione os arquivos que voc\u00ea deseja abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=A configura\u00e7\u00e3o do servidor Tomcat e do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\nPara obter mais informa\u00e7\u00f5es, veja os arquivos de log a seguir:\n{1}\n{2}\n\nSelecione os arquivos que voc\u00ea deseja abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=A configura\u00e7\u00e3o do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\n\u00c9 necess\u00e1ria a\u00e7\u00e3o posterior para concluir a configura\u00e7\u00e3o. Para obter mais informa\u00e7\u00f5es, veja o arquivo de log a seguir: {1}.\n\nSelecione os arquivos que voc\u00ea deseja abrir:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=A configura\u00e7\u00e3o do servidor Tomcat e do aplicativo foi migrada com \u00eaxito para o servidor Liberty a seguir: {0}.\n\n\u00c9 necess\u00e1ria a\u00e7\u00e3o posterior para concluir a configura\u00e7\u00e3o. Para obter mais informa\u00e7\u00f5es, veja os arquivos de log a seguir:\n{1}\n{2}\n\nSelecione os arquivos que voc\u00ea deseja abrir:
MIGRATION_FAILURE_DIALOG=A configura\u00e7\u00e3o n\u00e3o pode ser migrada por causa desta exce\u00e7\u00e3o:\n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=Incluindo o aplicativo no servidor Liberty...
PROGRESS_COPYING_LIBERTY_SERVER=Copiando o arquivo server.xml do Liberty...
PROGRESS_GENERATING_CONFIG_FILE=Gerando o arquivo de configura\u00e7\u00e3o do Liberty...
PROGRESS_LOADING_CONFIG_INFO=Carregando informa\u00e7\u00f5es de configura\u00e7\u00e3o...
PROGRESS_MIGRATING_APPLICATION=A configura\u00e7\u00e3o do aplicativo est\u00e1 sendo migrada.
PROGRESS_MIGRATING_CONTEXT_XML=Migrando a configura\u00e7\u00e3o do arquivo context.xml...
PROGRESS_MIGRATING_SERVER=A configura\u00e7\u00e3o do servidor Tomcat est\u00e1 sendo migrada.
PROGRESS_MIGRATING_SERVER_XML=Migrando a configura\u00e7\u00e3o do arquivo server.xml...
PROGRESS_MIGRATING_SHARED_LIBRARIES=Migrando bibliotecas compartilhadas para origens de dados... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Migrando usu\u00e1rios e fun\u00e7\u00f5es do Tomcat...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE=Migrando usu\u00e1rios e fun\u00e7\u00f5es do Tomcat do arquivo {0}...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Migrando usu\u00e1rios e fun\u00e7\u00f5es do Tomcat para o arquivo {0}...
PROGRESS_ENCODING_X_PASSWORDS=Codificando senhas {0}...
PROGRESS_ENCODING_PASSWORD_X_OF_Y=Codificando a senha {0} de {1}...
PROGRESS_MIGRATING_VARIABLES=Migrando vari\u00e1veis do Tomcat do arquivo catalina.properties...
PROGRESS_MIGRATING_WEB_XML=Migrando a configura\u00e7\u00e3o do arquivo web.xml...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=Publicando o aplicativo no servidor Liberty...
PROGRESS_TITLE_CONFIG_MIGRATION=Progresso da migra\u00e7\u00e3o da configura\u00e7\u00e3o do Tomcat
PROGRESS_UPDATING_LIBERTY_SERVER=Atualizando o arquivo server.xml do Liberty...
PROGRESS_VALIDATING_LIBERTY_SERVER=Validando a configura\u00e7\u00e3o do servidor Liberty...
PROGRESS_VERIFYING_VIRTUAL_HOST=Verificando a configura\u00e7\u00e3o do host virtual do aplicativo...
SELECTION_NOT_SUPPORTED=A sele\u00e7\u00e3o atual n\u00e3o pode ser migrada. Selecione um servidor Tomcat ou um projeto Java que contenha um aplicativo Tomcat.
NO_CONFIG_FOUND=A sele\u00e7\u00e3o atual n\u00e3o pode ser migrada. A configura\u00e7\u00e3o do servidor Tomcat n\u00e3o foi localizada.
SERVER_TYPE_ERROR=O servidor selecionado n\u00e3o pode ser migrado. Selecione um servidor Tomcat.       
LIBERTY_CONFIG_NOT_FOUND=A configura\u00e7\u00e3o n\u00e3o pode ser migrada porque a configura\u00e7\u00e3o do servidor Liberty n\u00e3o foi localizada.
INVALID_JAVA_PROJECT=O projeto Java selecionado n\u00e3o pode ser migrado porque n\u00e3o cont\u00e9m um diret\u00f3rio {0}.
NO_WEB_XML=O projeto Java selecionado n\u00e3o pode ser migrado porque n\u00e3o cont\u00e9m um arquivo {0}.
NOT_TOMCAT_SERVER_DIR=A sele\u00e7\u00e3o atual n\u00e3o pode ser migrada porque n\u00e3o \u00e9 um servidor Tomcat v\u00e1lido.
NOT_TOMCAT_SERVER_FILE=O servidor selecionado n\u00e3o pode ser migrado porque n\u00e3o cont\u00e9m este arquivo: {0}.
NO_LIBERTY_SERVER_XML=O servidor Liberty selecionado n\u00e3o cont\u00e9m um arquivo de configura\u00e7\u00e3o server.xml.
MISSING_LIBERTY_DIRECTORY=O servidor Liberty selecionado n\u00e3o \u00e9 v\u00e1lido. Ele n\u00e3o cont\u00e9m o diret\u00f3rio {0}.
SELECT_TOMCAT_SERVER=Selecione um servidor Tomcat a ser migrado.
SELECT_VIRTUAL_HOST=Selecione um host virtual para o seu aplicativo.\n\nO host virtual default_host \u00e9 adequado para as configura\u00e7\u00f5es mais simples.

# Exceptions
EXCEPT_LOG_CREATE_ERROR=A ferramenta de migra\u00e7\u00e3o de configura\u00e7\u00e3o do Tomcat n\u00e3o p\u00f4de criar o arquivo de log a seguir: {0}.
INVALID_WAR_FILE=O arquivo war do aplicativo especificado n\u00e3o existe ou n\u00e3o \u00e9 um arquivo .war: {0}.
INVALID_OUTPUT_DIRECTORY=O diret\u00f3rio de sa\u00edda especificado n\u00e3o p\u00f4de ser criado: {0}.
INVALID_DIRECTORY=O diret\u00f3rio especificado n\u00e3o \u00e9 v\u00e1lido: {0}.
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= O diret\u00f3rio do servidor Liberty n\u00e3o foi especificado.
TEMP_FILE_DELETE_FAIL=Um ou mais arquivos tempor\u00e1rios criados durante a migra\u00e7\u00e3o n\u00e3o puderam ser exclu\u00eddos.

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=O aplicativo foi inclu\u00eddo no servidor Liberty.
LOG_ADDED_INCLUDE_FILE=O arquivo de configura\u00e7\u00e3o do servidor, {0}, foi inclu\u00eddo no arquivo {1}. 
LOG_APP_CONFIG_MIG_FAILED=A configura\u00e7\u00e3o do aplicativo Tomcat n\u00e3o p\u00f4de ser migrada por causa desta exce\u00e7\u00e3o:\n{0}
LOG_APP_CONFIG_MIG_NO_SERVER=A configura\u00e7\u00e3o do aplicativo Tomcat foi migrada, mas o aplicativo n\u00e3o foi inclu\u00eddo no servidor Liberty porque um servidor n\u00e3o foi fornecido.
LOG_APP_CONFIG_MIG_WITH_ERROR=A configura\u00e7\u00e3o do aplicativo Tomcat foi migrada, mas o aplicativo n\u00e3o foi inclu\u00eddo no servidor Liberty devido a uma exce\u00e7\u00e3o de publica\u00e7\u00e3o registrada anteriormente.
LOG_APP_PUBLISH_FAILED=O aplicativo n\u00e3o p\u00f4de ser migrado no servidor Liberty por causa da exce\u00e7\u00e3o a seguir:\n{0}
LOG_APP_PUBLISH_OK=O aplicativo foi publicado com \u00eaxito no servidor Liberty.
LOG_APP_RESOURCES_SKIP=Nenhum recurso de aplicativo ser\u00e1 migrado porque o arquivo context.xml do aplicativo n\u00e3o existe.
LOG_APP_RESOURCES_START=Os recursos de aplicativo est\u00e3o sendo migrados do arquivo {0} para o arquivo {1}.
LOG_APP_VIRTUAL_HOST_GENERATE=O arquivo ibm-web-bnd.xml do aplicativo est\u00e1 sendo gerado com o host virtual {0}.
LOG_APP_VIRTUAL_HOST_START=O host virtual para o aplicativo est\u00e1 sendo configurado.
LOG_APP_VIRTUAL_HOST_UPDATE=O arquivo ibm-web-bnd.xml do aplicativo est\u00e1 sendo atualizado com o host virtual {0}.
LOG_COPY_SERVER_XML=O conte\u00fado do arquivo server.xml do Liberty original foi salvo no arquivo {0}.
LOG_COPY_APP_WEB_BND_XML=O conte\u00fado do arquivo ibm-web-bnd.xml do aplicativo original foi salvo no arquivo {0}.
LOG_GEN_TOP_LEVEL_CONFIG=O arquivo de configura\u00e7\u00e3o {0} foi gerado e ser\u00e1 inclu\u00eddo no arquivo server.xml do Liberty.
LOG_HDR_APP_CONTEXT_XML=Arquivo context.xml do aplicativo = {0}
LOG_HDR_APP_NAME=Nome do aplicativo = {0}
LOG_HDR_APP_WEB_XML=Arquivo web.xml do aplicativo = {0}
LOG_HDR_LIBERTY_SERVER_DIR=Diret\u00f3rio do servidor Liberty = {0}
LOG_HDR_NO_APP_CONTEXT_XML=Um arquivo context.xml de aplicativo n\u00e3o existe, de modo que n\u00e3o ser\u00e1 migrado.
LOG_HDR_TOMCAT_SERVER_DIR=Diret\u00f3rio do servidor Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=Diret\u00f3rio de tempo de execu\u00e7\u00e3o do servidor Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=Diret\u00f3rio de tempo de execu\u00e7\u00e3o do servidor Tomcat do CATALINA_HOME = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=Diret\u00f3rio de configura\u00e7\u00e3o do servidor Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=Diret\u00f3rio de configura\u00e7\u00e3o do servidor Tomcat do CATALINA_HOME = {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=O aplicativo n\u00e3o foi inclu\u00eddo no servidor Liberty por causa desta exce\u00e7\u00e3o:\n{0}
LOG_BEGINNING={0} - iniciando entrada de log
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=MM/dd/yy kk:mm:ss:SSS z
LOG_DELETE_FILE_ERROR=O arquivo tempor\u00e1rio {0} n\u00e3o p\u00f4de ser exclu\u00eddo.
LOG_END={0} - fechando a entrada de log
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE=O arquivo {0} n\u00e3o p\u00f4de ser fechado.
LOG_FILE_COPIED=O arquivo {0} foi copiado do diret\u00f3rio {1} para o diret\u00f3rio {2}.
LOG_FILE_COPIED_ERROR=O arquivo {0} n\u00e3o foi copiado do diret\u00f3rio {1} para o diret\u00f3rio {2} devido a este erro:\n{3}.
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR=O driver requerido para o banco de dados {0} n\u00e3o foi copiado para o local {1} porque o diret\u00f3rio de destino n\u00e3o existe.

LOG_MIME_TYPES_SKIP=Nenhum artefato web.xml do servidor ser\u00e1 migrado porque o arquivo {0} n\u00e3o existe.
LOG_MIME_TYPES_START=O elementos mime-mapping est\u00e3o sendo migrados do arquivo {0} para o arquivo {1}.
LOG_RESOURCE_AND_HTTP_SKIP=Nenhum elemento de Recurso ou Conector HTTP ser\u00e1 migrado porque o arquivo {0} n\u00e3o existe.
LOG_RESOURCE_AND_HTTP_START=Os elementos de Recurso e Conector HTTP est\u00e3o sendo migrados do arquivo {0} para o arquivo {1}.
LOG_SEC_CONSTRAINTS_SKIP=N\u00e3o h\u00e1 nenhum valor configurado no atributo allRolesMode nas restri\u00e7\u00f5es de seguran\u00e7a do aplicativo Tomcat. O valor ser\u00e1 padronizado como 'strict'.
LOG_SEC_CONSTRAINTS_START=As restri\u00e7\u00f5es de seguran\u00e7a do aplicativo est\u00e3o sendo migradas do arquivo {0} para o arquivo {1}.
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=A configura\u00e7\u00e3o do servidor Tomcat n\u00e3o p\u00f4de ser migrada por causa desta exce\u00e7\u00e3o:\n{0}
LOG_SERVER_CONFIG_SUCCESSFUL=A configura\u00e7\u00e3o do servidor Tomcat foi migrada com \u00eaxito.
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=A configura\u00e7\u00e3o do servidor Tomcat foi migrada com \u00eaxito, mas atualiza\u00e7\u00f5es adicionais na configura\u00e7\u00e3o s\u00e3o necess\u00e1rias. Para obter mais informa\u00e7\u00f5es, veja as entradas anteriores nesse arquivo de log.
LOG_SERVER_NOT_MIGRATED=Aten\u00e7\u00e3o: O aplicativo migrado pode depender de configura\u00e7\u00f5es definidas na configura\u00e7\u00e3o do servidor Tomcat correspondente. Para evitar problemas, migre a configura\u00e7\u00e3o do servidor Tomcat antes de executar o aplicativo.
LOG_SHARED_LIB_DATASOURCE=A configura\u00e7\u00e3o da biblioteca compartilhada {0} est\u00e1 sendo inclu\u00edda no arquivo {1}. Essa configura\u00e7\u00e3o \u00e9 referenciado por elementos de origem de dados.
LOG_SHARED_LIB_CLASSLOADER=A configura\u00e7\u00e3o da biblioteca compartilhada {0} est\u00e1 sendo inclu\u00edda no arquivo {1}. Essa configura\u00e7\u00e3o \u00e9 referenciada por elementos do carregador de classes do aplicativo.
LOG_STANDARD_MANAGER_SKIP=Nenhum elemento padr\u00e3o de Gerenciador e Recurso ser\u00e1 migrado porque o arquivo {0} n\u00e3o existe.
LOG_STANDARD_MANAGER_START=Os elementos padr\u00e3o de Gerenciador e Recurso est\u00e3o sendo migrados do arquivo {0} para o arquivo {1}.
LOG_TOMCAT_APP_MIG_OK=A configura\u00e7\u00e3o do aplicativo Tomcat foi migrada com \u00eaxito.
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=A configura\u00e7\u00e3o do aplicativo Tomcat foi migrada com \u00eaxito, mas atualiza\u00e7\u00f5es adicionais na configura\u00e7\u00e3o s\u00e3o necess\u00e1rias. Para obter mais informa\u00e7\u00f5es, veja as entradas anteriores nesse arquivo de log.
LOG_UPDATE_LIBERTY_SERVER_START=O servidor Liberty est\u00e1 sendo atualizado com a configura\u00e7\u00e3o migrada.
LOG_USERS_EXCEPTION=A ferramenta de migra\u00e7\u00e3o n\u00e3o p\u00f4de determinar se existem arquivos adicionais de usu\u00e1rio e de fun\u00e7\u00f5es por causa da exce\u00e7\u00e3o a seguir:\n{0}
LOG_USERS_NO_FILE=Nenhum arquivo tomcat-users foi migrado. Para ver se os arquivos foram ignorados porque n\u00e3o puderam ser localizados, veja outras entradas nesse arquivo de log.
LOG_USERS_SKIP=Nenhum elemento de usu\u00e1rios e fun\u00e7\u00f5es ser\u00e1 migrado porque o arquivo {0} n\u00e3o existe.
LOG_USERS_START=Os elementos de usu\u00e1rio e fun\u00e7\u00e3o est\u00e3o sendo migrados do arquivo {0} para o arquivo {1}.
LOG_USERS_TEMP_FILE_ERROR=A ferramenta de migra\u00e7\u00e3o n\u00e3o p\u00f4de localizar o arquivo tempor\u00e1rio {0}.
LOG_VARIABLES_START=As propriedades do Tomcat que s\u00e3o referenciadas pela configura\u00e7\u00e3o gerada est\u00e3o sendo migradas do arquivo {0} para o arquivo {1}.
LOG_VARIABLES_SCANNING_EXCEPTION=A ferramenta de migra\u00e7\u00e3o n\u00e3o p\u00f4de determinar se o arquivo {0} faz refer\u00eancia a quaisquer propriedades do Tomcat por causa desta exce\u00e7\u00e3o:\n{1}
LOG_WAMT_EXCEPTION=A ferramenta de migra\u00e7\u00e3o n\u00e3o p\u00f4de determinar se o aplicativo usa MongoDB devido a esta exce\u00e7\u00e3o: {0}
LOG_WAMT_NOT_FOUND=A ferramenta de migra\u00e7\u00e3o n\u00e3o p\u00f4de determinar se o aplicativo usa MongoDB. Se o seu aplicativo usar MongoDB, instale a Ferramenta de migra\u00e7\u00e3o do aplicativo \u2013 Apache Tomcat para WebSphere e migre o aplicativo novamente.

LOG_ACTION_VARIABLE_NOT_MIGRATED=A\u00e7\u00e3o necess\u00e1ria: O valor da vari\u00e1vel {0} que \u00e9 referenciado no arquivo {1} n\u00e3o p\u00f4de ser determinado. Configure a vari\u00e1vel no servidor Liberty ou modifique a configura\u00e7\u00e3o para n\u00e3o referenciar a vari\u00e1vel. O local padr\u00e3o para vari\u00e1veis migradas \u00e9 migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=A\u00e7\u00e3o necess\u00e1ria: A vari\u00e1vel {0} que \u00e9 referenciada no arquivo {1} n\u00e3o foi migrada porque n\u00e3o \u00e9 um nome de vari\u00e1vel v\u00e1lido no servidor Liberty. Configure uma vari\u00e1vel com um nome v\u00e1lido, ou modifique a configura\u00e7\u00e3o para n\u00e3o fazer refer\u00eancia \u00e0 vari\u00e1vel. O local padr\u00e3o para vari\u00e1veis migradas \u00e9 migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=A\u00e7\u00e3o necess\u00e1ria: O valor {0} da vari\u00e1vel {1} que \u00e9 referenciado no arquivo {2} n\u00e3o \u00e9 v\u00e1lido no servidor Liberty, de modo que a vari\u00e1vel n\u00e3o foi migrada. Configure uma vari\u00e1vel sem uma refer\u00eancia de vari\u00e1vel em seu valor ou modifique a configura\u00e7\u00e3o para n\u00e3o referenciar a vari\u00e1vel. O local padr\u00e3o para vari\u00e1veis migradas \u00e9 migratedConfig/variables.xml.
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Regi\u00e3o com o atributo className {0} n\u00e3o foi migrado. A ferramenta de migra\u00e7\u00e3o n\u00e3o suporta a migra\u00e7\u00e3o de elementos de Regi\u00e3o localizados no arquivo context.xml do aplicativo. Se voc\u00ea desejar migrar o elemento de Regi\u00e3o, mova o elemento para o arquivo context.xml que est\u00e1 localizado no diret\u00f3rio de configura\u00e7\u00e3o do Tomcat para que o elemento seja migrado com a configura\u00e7\u00e3o do servidor Tomcat.
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Conector com a porta {0} e o protocolo {1} n\u00e3o foi migrado. O servidor Liberty n\u00e3o suporta esse protocolo.
LOG_ATTENTION_CONNECTOR_PORT_ZERO=Aten\u00e7\u00e3o: Um elemento de Conector com a porta 0 n\u00e3o foi migrado. O servidor Liberty n\u00e3o suporta uma defini\u00e7\u00e3o de porta 0.
LOG_ATTENTION_EXCEPTION=Aten\u00e7\u00e3o: A ferramenta de migra\u00e7\u00e3o n\u00e3o p\u00f4de determinar se os elementos n\u00e3o foram migrados do arquivo {0} por causa desta exce\u00e7\u00e3o:\n{0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Recurso JDBC com o atributo de nome {0} e o atributo driverClassName {1} n\u00e3o foi migrado. Configure o elemento dataSource no servidor Liberty se o elemento for necess\u00e1rio.
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Regi\u00e3o da origem de dados com o atributo dataSourceName {0} n\u00e3o foi migrado. A ferramenta de migra\u00e7\u00e3o n\u00e3o suporta a migra\u00e7\u00e3o desse elemento de Regi\u00e3o. Configure um registro de usu\u00e1rio customizado no servidor Liberty, se o elemento for necess\u00e1rio.
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Regi\u00e3o JAAS com o atributo appName {0} n\u00e3o foi migrado. A ferramenta de migra\u00e7\u00e3o n\u00e3o suporta a migra\u00e7\u00e3o desse elemento de Regi\u00e3o. Configure um m\u00f3dulo de login customizado JAAS no servidor Liberty se o elemento for necess\u00e1rio. 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Regi\u00e3o JDBC com o atributo driverName {0} n\u00e3o foi migrado. A ferramenta de migra\u00e7\u00e3o n\u00e3o suporta a migra\u00e7\u00e3o desse elemento de Regi\u00e3o. Configure um registro de usu\u00e1rio customizado no servidor Liberty, se o elemento for necess\u00e1rio.
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Regi\u00e3o JNDI com o atributo connectionURL {0} n\u00e3o foi migrado. A ferramenta de migra\u00e7\u00e3o n\u00e3o suporta a migra\u00e7\u00e3o desse elemento de Regi\u00e3o. Configure um registro de usu\u00e1rio LDAP no servidor Liberty se o elemento for necess\u00e1rio.
LOG_ATTENTION_MANAGER_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Gerenciador com o atributo className {0} n\u00e3o foi migrado. A ferramenta de migra\u00e7\u00e3o n\u00e3o suporta a migra\u00e7\u00e3o desse elemento de Gerenciador. Para configurar persist\u00eancia de sess\u00e3o para o servidor Liberty, inclua o recurso sessionDatabase-1.0 e especifique os elementos httpSession e httpSessionDatabase no recurso.
LOG_ATTENTION_REALM_NOT_MIGRATED=Aten\u00e7\u00e3o: O elemento de Regi\u00e3o com o atributo className {0} n\u00e3o foi migrado. A ferramenta de migra\u00e7\u00e3o n\u00e3o suporta a migra\u00e7\u00e3o desse elemento de Regi\u00e3o.

LOG_WARNING_PW_NOT_ENCODED=Aten\u00e7\u00e3o: O atributo de senha n\u00e3o foi codificado.
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=Aten\u00e7\u00e3o: O atributo de senha n\u00e3o foi codificado porque fez refer\u00eancia a uma vari\u00e1vel. Para melhorar a seguran\u00e7a do servidor, localize a vari\u00e1vel referenciada e assegure-se de que o valor seja codificado.
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=Aten\u00e7\u00e3o: O atributo de senha n\u00e3o foi codificado por causa desta exce\u00e7\u00e3o:\n{0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=Aten\u00e7\u00e3o: Os atributos de senha n\u00e3o foram codificados porque o diret\u00f3rio bin do Liberty n\u00e3o p\u00f4de ser localizado.

LOG_BINARY_SCANNER_NOT_FOUND=O scanner bin\u00e1rio n\u00e3o p\u00f4de ser localizado no sistema de arquivos. Como resultado, a configura\u00e7\u00e3o do MongoDB pode estar ausente. Verifique se voc\u00ea incluiu qualquer configura\u00e7\u00e3o necess\u00e1ria se o seu aplicativo usar o MongoDB.
LOG_RULE_DIR_NOT_CREATED=Um diret\u00f3rio tempor\u00e1rio n\u00e3o p\u00f4de ser criado no sistema de arquivos. Como resultado, a configura\u00e7\u00e3o do MongoDB pode estar ausente. Verifique se voc\u00ea incluiu qualquer configura\u00e7\u00e3o necess\u00e1ria se o seu aplicativo usar o MongoDB.
LOG_RULE_FILE_NOT_COPIED=A regra para detectar o uso do Mongo n\u00e3o p\u00f4de ser copiada para o sistema de arquivos. Como resultado, a configura\u00e7\u00e3o do Mongo pode estar ausente. Verifique se voc\u00ea incluiu qualquer configura\u00e7\u00e3o necess\u00e1ria se o seu aplicativo usar o MongoDB.
LOG_BINARY_SCAN_FAILURE=O scanner bin\u00e1rio falhou ao executar. Como resultado, a configura\u00e7\u00e3o do MongoDB pode estar ausente. Verifique se voc\u00ea incluiu qualquer configura\u00e7\u00e3o necess\u00e1ria se o seu aplicativo usar o MongoDB.
LOG_SCAN_OUTPUT_FILE_FAILURE=O arquivo de sa\u00edda para o scanner bin\u00e1rio n\u00e3o p\u00f4de ser criado devido ao erro a seguir:\n{0}
LOG_MONGO_EXCEPTION=A exce\u00e7\u00e3o a seguir ocorreu ao varrer o aplicativo para uso do MongoDB:\n{0}

TITLE_APP_CONFIG=Migra\u00e7\u00e3o da configura\u00e7\u00e3o do aplicativo Tomcat
TITLE_SERVER_CONFIG=Migra\u00e7\u00e3o da configura\u00e7\u00e3o do servidor Tomcat
