# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=Urm\u0103toarea configura\u0163ie a fost migrat\u0103 de Tomcat Configuration Migration Tool.
MIGRATION_COMPLETE_NAMED_FILE=Urm\u0103toarea configura\u0163ie a fost migrat\u0103 de la fi\u015fierul {0} de Tomcat Configuration Migration Tool.
MIGRATION_GENERATED=Urm\u0103toarea configura\u0163ie a fost generat\u0103 de Tomcat Configuration Migration Tool.
JMS_CLASS_CAST_WARNING=Aten\u0163ie: jmsConnectionFactory din Liberty nu implementeaz\u0103 interfe\u0163ele javax.jms.QueueConnectionFactory \u015fi javax.jms.TopiConnectionFactory. \nAplica\u0163iile JMS vor primi ClassCastException dac\u0103 \u00eencearc\u0103 s\u0103 transforme (cast) aceast\u0103 fabric\u0103 de conexiuni la orice interfa\u0163\u0103.
FILE_UPDATED=Urm\u0103toarea configura\u0163ie a fost actualizat\u0103 de Tomcat Configuration Migration Tool.
ACTION_JDBC_DRIVER=Ac\u0163iune necesar\u0103: Pentru a face accesibil driver-ul JDBC pentru elementul dataSource {0}, copia\u0163i driver-ul JDBC \u00een loca\u0163ia {1} sau modifica\u0163i configura\u0163ia pentru a indica la loca\u0163ia driver-ului JDBC.
ACTION_ORACLE_DRIVER=Ac\u0163iune necesar\u0103: Pentru a face accesibil driver-ul Oracle pentru elementul dataSource {0}, copia\u0163i con\u0163inutul directorului clientului Oracle \u00een loca\u0163ia pentru biblioteca partajat\u0103 {1} sau modifica\u0163i configura\u0163ia pentru a indica la loca\u0163ia directorului de client Oracle.
ACTION_USER_PASSWORDS=Ac\u0163iune necesar\u0103: Utiliza\u0163i Liberty Configuration Editor pentru a modifica \u015fi a codifica hash atributele de parol\u0103 \u00een configura\u0163ia migrat\u0103 la valorile originale necriptate de la serverul Tomcat. Parolele originale au fost criptate cu algoritmul digest {0} \u015fi au fost migrate \u00een forma lor criptat\u0103.
STORAGE_REF_WARNING=Aten\u0163ie: \u00cen mod implicit, Liberty stocheaz\u0103 datele de sesiune \u00een memorie. \nPentru a configura persisten\u0163a sesiunii pentru serverul Liberty, ad\u0103uga\u0163i caracteristica sessionDatabase-1.0 \u015fi un element httpSessionDatabase pentru a configura persisten\u0163a sesiunii.
PATHNAME_WARNING=Aten\u0163ie: Atributul pathname de la Tomcat Standard Manager nu a fost migrat. \u00cen mod implicit, Liberty stocheaz\u0103 datele de sesiune \u00een memorie. \nPentru a configura persisten\u0163a sesiunii pentru serverul Liberty, ad\u0103uga\u0163i caracteristica sessionDatabase-1.0 \u015fi un element httpSessionDatabase pentru a configura persisten\u0163a sesiunii.
MQ_RESOURCE_ADAPTER_ACTION=Ac\u0163iune necesar\u0103: Pentru a utiliza furnizorul de mesagerie WebSphere MQ pe Liberty, copia\u0163i WebSphere MQ Resource Adapter la loca\u0163ia {0} sau modifica\u0163i configura\u0163ia pentru a indica la loca\u0163ia WebSphere MQ Resource Adapter.
MQ_NATIVE_LIB_ACTION=Ac\u0163iune necesar\u0103: Modifica\u0163i atributul nativeLibraryPath s\u0103 indice la loca\u0163ia bibliotecilor native WebSphere MQ.
MONGO_CLASSLOADER_NEEDED_ACTION=Ac\u0163iune necesar\u0103: Pentru a face accesibil driver-ul Java MongoDB pentru aplica\u0163ie, copia\u0163i driver-ul la biblioteca partajat\u0103 {0} sau modifica\u0163i configura\u0163ia pentru a indica la loca\u0163ia driver-ului.
MULTIPLE_REDIRECT_PORTS=Aten\u0163ie: Portul activat SSL {0} este deja definit de un element httpEndpoint \u015fi a fost dezactivat \u00een elementul httpEndpoint {1}. Specifica\u0163i un port disponibil pe pe atributul httpsPort pentru a activa SSL pe elementul httpEndpoint.  Liberty nu suport\u0103 mai multe elemente httpEndpoint cu aceea\u015fi valoare de atribut httpsPort. 
DEFAULT_SSL_GENERATED=Aten\u0163ie: Nu a fost detectat\u0103 nicio configura\u0163ie SSL pentru portul activat SSL {0}. A fost generat\u0103 configura\u0163ia SSL implicit\u0103. 
PASSWORD_ENCODE_WARNING=Aten\u0163ie: Pentru a \u00eembun\u0103t\u0103\u0163i securitatea serverului, modifica\u0163i \u015fi codifica\u0163i parola pe elementul {0}.
HTTPS_PORT_UNSUPPORTED_PROTOCOL=Aten\u0163ie: Portul activat SSL {0} la care face referire elementul Tomcat Connector cu portul {1} utilizeaz\u0103 un protocol care nu este suportat pe serverul Liberty. Atributul httpsPort pe elementul httpEndpoint {2} a fost dezactivat.
HTTPS_CONNECTOR_MISSING=Aten\u0163ie: Elementul Tomcat Connector cu portul {0} face referin\u0163\u0103 la un port activat SSL {1} care nu este definit. Atributul httpsPort pe elementul httpEndpoint {2} a fost dezactivat.
UNCOMMENT_VIRTUAL_HOST=Decomenta\u0163i gazda virtual\u0103 preferat\u0103 pentru aplica\u0163ia dumneavoastr\u0103. Gazda virtual\u0103 default_host este potrivit\u0103 pentru cele mai multe configura\u0163ii simple.
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=Nu, se migreaz\u0103 doar aplica\u0163ia mea
DROPDOWN_DEFAULT_SELECT_AN_OPTION=Selecta\u0163i una
DROPDOWN_TOMCATSERVER_FILESYSTEM=Da, se migreaz\u0103 de asemenea un server de la sistemul meu de fi\u015fiere
DROPDOWN_TOMCATSERVER_WORKSPACE=Da, se migreaz\u0103 de asemenea un server de la cadrul meu de lucru
TITLE_INFO=Informa\u0163ii
TITLE_ERROR=Eroare
TITLE_LIBERTY_SELECT=Selectare server Liberty
TITLE_APP_ALREADY_MIGRATED=Aplica\u0163ia migrat\u0103 anterior pe acest server
TITLE_SERVER_ALREADY_MIGRATED=Tomcat Server migrat anterior la acest server
TITLE_SERVER_NOT_MIGRATED=Dependen\u0163e pe configura\u0163ia Tomcat Server
TITLE_SUCCESS_DIALOG=Configura\u0163ia a fost migrat\u0103 cu succes
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=Configura\u0163ia a fost migrat\u0103 cu succes - Ac\u0163iune necesar\u0103
TITLE_TOMCAT_SELECT=Selectare server Tomcat
TITLE_VIRTUAL_HOST_SELECT=Legare aplica\u0163ie la o gazd\u0103 virtual\u0103
APP_ALREADY_MIGRATED=Aplica\u0163ia {0} a fost migrat\u0103 anterior la serverul Liberty selectat, {1}.\n\nDac\u0103 ve\u0163i continua s\u0103 migra\u0163i aplica\u0163ia, fi\u015fierele de configura\u0163ie vor fi suprascrise, iar referin\u0163ele la fi\u015fierele dumneavoastr\u0103 de configura\u0163ie s-ar putea pierde. Pentru a evita problemele, migra\u0163i aplica\u0163ia dumneavoastr\u0103 la un alt server Liberty sau \u00eenl\u0103tura\u0163i configura\u0163ia migrat\u0103 anterior de pe serverul Liberty. \n\nDori\u0163i s\u0103 continua\u0163i s\u0103 migra\u0163i aplica\u0163ia?
SERVER_ALREADY_MIGRATED=Un server Tomcat a fost migrat anterior la serverul Liberty selectat, {0}.\n\nDac\u0103 continua\u0163i s\u0103 migra\u0163i serverul Tomcat selectat, {1}, fi\u015fierele de configura\u0163ie vor fi suprascrise, iar referin\u0163ele la fi\u015fierele dumneavoastr\u0103 de configura\u0163ie s-ar putea pierde. Pentru a evita problemele, migra\u0163i serverul dumneavoastr\u0103 Tomcat dumneavoastr\u0103 la un alt server Liberty sau \u00eenl\u0103tura\u0163i configura\u0163ia migrat\u0103 anterior de pe serverul Liberty.\n\nDori\u0163i s\u0103 continua\u0163i s\u0103 migra\u0163i serverul Tomcat?
SERVER_NOT_MIGRATED=Aplica\u0163ia ar putea depinde de set\u0103rile corespunz\u0103toare definite \u00een configura\u0163ia serverului Tomcat. Pentru a evita problemele, migra\u0163i mai \u00eent\u00e2i configura\u0163ia serverului Tomcat la serverul Liberty care va g\u0103zdui aplica\u0163ia. \n\nDori\u0163i s\u0103 migra\u0163i serverul Tomcat \u015fi apoi s\u0103 migra\u0163i aplica\u0163ia dumneavoastr\u0103?
LIBERTY_SERVER_CHECKBOX=Configura\u0163ie server Liberty
APP_LOG_FILE_CHECKBOX=Fi\u015fier istoric de migrare aplica\u0163ie
SERVER_LOG_FILE_CHECKBOX=Fi\u015fier istoric de migrare server
DESC_LIBERTY_SELECT=Selecta\u0163i un server Liberty. \nConfigura\u0163ia dumneavoastr\u0103 Tomcat va fi migrat\u0103 la acest server.
MIGRATION_SUCCESS_DIALOG_SERVER=Configura\u0163ia serverului Tomcat a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\nPentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=Configura\u0163ia serverului Tomcat a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\n\u00cen continuare este necesar\u0103 o ac\u0163iune pentru a finaliza configurarea. Pentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=Configura\u0163ia serverului Tomcat a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\nPentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.\n\nSelecta\u0163i fi\u015fierele pe care vre\u0163i s\u0103 le deschide\u0163i:
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=Configura\u0163ia serverului Tomcat a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\n\u00cen continuare este necesar\u0103 o ac\u0163iune pentru a finaliza configurarea. Pentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.\n\nSelecta\u0163i fi\u015fierele pe care vre\u0163i s\u0103 le deschide\u0163i:
MIGRATION_SUCCESS_DIALOG_APPLICATION=Configura\u0163ia aplica\u0163iei a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\nPentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=Configura\u0163ia serverului Tomcat \u015fi a aplica\u0163iei au fost migrate cu succes la urm\u0103torul server Liberty: {0}.\n\nPentru informa\u0163ii suplimentare, vede\u0163i urm\u0103toarele fi\u015fiere istoric:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=Configura\u0163ia aplica\u0163iei a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\n\u00cen continuare este necesar\u0103 o ac\u0163iune pentru a finaliza configurarea. Pentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=Configura\u0163ia serverului Tomcat \u015fi a aplica\u0163iei au fost migrate cu succes la urm\u0103torul server Liberty: {0}.\n\n\u00cen continuare este necesar\u0103 o ac\u0163iune pentru a finaliza configurarea. Pentru informa\u0163ii suplimentare, vede\u0163i urm\u0103toarele fi\u015fiere istoric:\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=Configura\u0163ia aplica\u0163iei a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\nPentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.\n\nSelecta\u0163i fi\u015fierele pe care vre\u0163i s\u0103 le deschide\u0163i:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=Configura\u0163ia serverului Tomcat \u015fi a aplica\u0163iei au fost migrate cu succes la urm\u0103torul server Liberty: {0}.\n\nPentru informa\u0163ii suplimentare, vede\u0163i urm\u0103toarele fi\u015fiere istoric:\n{1}\n{2}\n\nSelecta\u0163i fi\u015fierele pe care vre\u0163i s\u0103 le deschide\u0163i:
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=Configura\u0163ia aplica\u0163iei a fost migrat\u0103 cu succes la urm\u0103torul server Liberty: {0}.\n\n\u00cen continuare este necesar\u0103 o ac\u0163iune pentru a finaliza configurarea. Pentru informa\u0163ii suplimentare, vede\u0163i fi\u015fierul istoric: {1}.\n\nSelecta\u0163i fi\u015fierele pe care vre\u0163i s\u0103 le deschide\u0163i:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=Configura\u0163ia serverului Tomcat \u015fi a aplica\u0163iei au fost migrate cu succes la urm\u0103torul server Liberty: {0}.\n\n\u00cen continuare este necesar\u0103 o ac\u0163iune pentru a finaliza configurarea. Pentru informa\u0163ii suplimentare, vede\u0163i urm\u0103toarele fi\u015fiere istoric:\n{1}\n{2}\n\nSelecta\u0163i fi\u015fierele pe care vre\u0163i s\u0103 le deschide\u0163i:
MIGRATION_FAILURE_DIALOG=Configura\u0163ia nu poate fi migrat\u0103 din cauza urm\u0103toarei excep\u0163ii: \n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=Ad\u0103ugare aplica\u0163ie la serverul Liberty...
PROGRESS_COPYING_LIBERTY_SERVER=Copiere fi\u015fier server.xml Liberty...
PROGRESS_GENERATING_CONFIG_FILE=Generare fi\u015fier de configura\u0163ie Liberty...
PROGRESS_LOADING_CONFIG_INFO=\u00cenc\u0103rcare informa\u0163ii de configura\u0163ie...
PROGRESS_MIGRATING_APPLICATION=Configura\u0163ia aplica\u0163iei este \u00een curs de migrare.
PROGRESS_MIGRATING_CONTEXT_XML=Migrare configura\u0163ie de la fi\u015fierul context.xml ...
PROGRESS_MIGRATING_SERVER=Configura\u0163ia serverului Tomcat este \u00een curs de migrare.
PROGRESS_MIGRATING_SERVER_XML=Migrare configura\u0163ie de la fi\u015fierul server.xml ...
PROGRESS_MIGRATING_SHARED_LIBRARIES=Migrare biblioteci partajate pentru sursele de date... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Migrare utilizatori \u015fi grupuri Tomcat...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE=Migrare utilizatori \u015fi roluri Tomcat de la fi\u015fierul {0} ...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Migrare utilizatori \u015fi roluri Tomcat la fi\u015fierul {0} ...
PROGRESS_ENCODING_X_PASSWORDS=Codificare parole {0}...
PROGRESS_ENCODING_PASSWORD_X_OF_Y=Codificarea parolei {0} din {1}...
PROGRESS_MIGRATING_VARIABLES=Migrare variabile Tomcat de la fi\u015fierul catalina.properties ...
PROGRESS_MIGRATING_WEB_XML=Migrare configura\u0163ie de la fi\u015fierul web.xml ...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=Publicare aplica\u0163ie pe serverul Liberty...
PROGRESS_TITLE_CONFIG_MIGRATION=Progres migrare configura\u0163ie Tomcat
PROGRESS_UPDATING_LIBERTY_SERVER=Actualizare fi\u015fier server.xml Liberty...
PROGRESS_VALIDATING_LIBERTY_SERVER=Validare configura\u0163ie server Liberty...
PROGRESS_VERIFYING_VIRTUAL_HOST=Verificare configura\u0163ie gazd\u0103 virtual\u0103 pentru aplica\u0163ie...
SELECTION_NOT_SUPPORTED=Selec\u0163ia curent\u0103 nu poate fi migrat\u0103. Selecta\u0163i fie un server Tomcat, fie un proiect Java care con\u0163ine o aplica\u0163ie Tomcat.
NO_CONFIG_FOUND=Selec\u0163ia curent\u0103 nu poate fi migrat\u0103. Configura\u0163ia serverui Tomcat nu a fost g\u0103sit\u0103.
SERVER_TYPE_ERROR=Serverul selectat nu poate fi migrat. Selecta\u0163i un server Tomcat.       
LIBERTY_CONFIG_NOT_FOUND=Configura\u0163ia nu poate fi migrat\u0103 deoarece configura\u0163ia serverului Liberty nu a fost g\u0103sit\u0103.
INVALID_JAVA_PROJECT=Proiectul Java selectat nu poate fi migrat deoarece nu con\u0163ine un director {0}.
NO_WEB_XML=Proiectul Java selectat nu poate fi migrat deoarece nu con\u0163ine un fi\u015fier {0}.
NOT_TOMCAT_SERVER_DIR=Selec\u0163ia curent\u0103 nu poate fi migrat\u0103 deoarece nu este un server Tomcat valid.
NOT_TOMCAT_SERVER_FILE=Serverul selectat nu poate fi migrat deoarece nu con\u0163ine fi\u015fierul urm\u0103tor: {0}.
NO_LIBERTY_SERVER_XML=Serverul Liberty selectat nu con\u0163ine un fi\u015fier de configura\u0163ie server.xml.
MISSING_LIBERTY_DIRECTORY=Server Liberty selectat nu este valid. Nu con\u0163ine un director {0}.
SELECT_TOMCAT_SERVER=Selecta\u0163i un server Tomcat pentru migrare.
SELECT_VIRTUAL_HOST=Selecta\u0163i o gazd\u0103 virtual\u0103 pentru aplica\u0163ia dumneavoastr\u0103.\n\nGazda virtual\u0103 default_host este potrivit\u0103 pentru majoritatea configura\u0163iilor.

# Exceptions
EXCEPT_LOG_CREATE_ERROR=Unealta de migrarea configura\u0163iei Tomcat nu a putut crea urm\u0103torul fi\u015fier istoric: {0}.
INVALID_WAR_FILE=Fi\u015fierul war al aplica\u0163iei fie nu exist\u0103, fie nu este un fi\u015fier .war: {0}.
INVALID_OUTPUT_DIRECTORY=Directorul de ie\u015fire specificat nu poate fi creat: {0}.
INVALID_DIRECTORY=Directorul specificat nu este valid: {0}.
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= Nu a fost specificat directorul de server Liberty.
TEMP_FILE_DELETE_FAIL=Unul sau mai multe fi\u015fiere temporare create \u00een timpul migr\u0103rii nu au putut fi \u015fterse.

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=Aplica\u0163ia a fost ad\u0103ugat\u0103 la serverul Liberty.
LOG_ADDED_INCLUDE_FILE=Fi\u015fierul de configura\u0163ie server, {0}, a fost inclus \u00een fi\u015fierul {1}. 
LOG_APP_CONFIG_MIG_FAILED=Configura\u0163ia aplica\u0163iei Tomcat nu poate fi migrat\u0103 din cauza urm\u0103toarei excep\u0163ii: \n{0}
LOG_APP_CONFIG_MIG_NO_SERVER=Configura\u0163ia aplica\u0163iei Tomcat a fost migrat\u0103, dar aplica\u0163ia nu a fost ad\u0103ugat\u0103 la serverul Liberty, deoarece nu a fost furnizat un server.
LOG_APP_CONFIG_MIG_WITH_ERROR=Configura\u0163ia aplica\u0163iei Tomcat a fost migrat\u0103, dar aplica\u0163ia nu a fost ad\u0103ugat\u0103 la serverul Liberty, din cauza unei excep\u0163ii de publicare jurnalizat\u0103 anterior.
LOG_APP_PUBLISH_FAILED=Aplica\u0163ia nu a putut fi publicat\u0103 pe serverul Liberty din cauza urm\u0103toarei excep\u0163ii: \n{0}
LOG_APP_PUBLISH_OK=Aplica\u0163ia a fost publicat\u0103 cu succes pe serverul Liberty.
LOG_APP_RESOURCES_SKIP=Nu va fi migrat\u0103 nicio resurs\u0103 a aplica\u0163iei, deoarece nu exist\u0103 fi\u015fierul context.xml al aplica\u0163iei.
LOG_APP_RESOURCES_START=Resursele aplica\u0163iei sunt migrate de la fi\u015fierul {0} la fi\u015fierul {1}.
LOG_APP_VIRTUAL_HOST_GENERATE=Fi\u015fierul ibm-web-bnd.xml al aplica\u0163iei este generat cu gazda virtual\u0103 {0}.
LOG_APP_VIRTUAL_HOST_START=Gazda virtual\u0103 pentru aplica\u0163ie este \u00een curs de configurare.
LOG_APP_VIRTUAL_HOST_UPDATE=Fi\u015fierul ibm-web-bnd.xml al aplica\u0163iei este actualizat cu gazda virtual\u0103 {0}.
LOG_COPY_SERVER_XML=Con\u0163inutul fi\u015fierului server.xml Liberty original a fost salvat la fi\u015fierul {0}.
LOG_COPY_APP_WEB_BND_XML=Con\u0163inutul fi\u015fierului ibm-web-bnd.xml original al aplica\u0163iei a fost salvat la fi\u015fierul {0}.
LOG_GEN_TOP_LEVEL_CONFIG=Fi\u015fierul de configura\u0163ie {0} a fost generat \u015fi va fi inclus \u00een fi\u015fierul server.xml Liberty.
LOG_HDR_APP_CONTEXT_XML=Fi\u015fier context.xml aplica\u0163ie = {0}
LOG_HDR_APP_NAME=Nume aplica\u0163ie = {0}
LOG_HDR_APP_WEB_XML=Fi\u015fier web.xml aplica\u0163ie = {0}
LOG_HDR_LIBERTY_SERVER_DIR=Director server Liberty = {0}
LOG_HDR_NO_APP_CONTEXT_XML=Nu exist\u0103 un fi\u015fier context.xml al aplica\u0163iei, deci nu va fi migrat.
LOG_HDR_TOMCAT_SERVER_DIR=Director server Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=Director runtime server Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=Director runtime server Tomcat de la CATALINA_HOME = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=Director configura\u0163ie server Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=Director configura\u0163ie server Tomcat de la CATALINA_HOME = {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=Aplica\u0163ia nu a fost ad\u0103ugat\u0103 la serverul Liberty din cauza urm\u0103toarei excep\u0163ii: \n{0}
LOG_BEGINNING={0} - intrare istoric de \u00eenceput
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=dd.MM.yy HH:mm:ss:SSS z
LOG_DELETE_FILE_ERROR=Fi\u015fierul {0} nu poate fi \u015fters.
LOG_END={0} - intrare de istoric de sf\u00e2r\u015fit
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE=Fi\u015fierul {0} nu a putut fi \u00eenchis.
LOG_FILE_COPIED=Fi\u015fierul {0} a fost copiat de la directorul {1} la directorul {2}.
LOG_FILE_COPIED_ERROR=Fi\u015fierul {0} nu a fost copiat de la directorul {1} la directorul {2} din cauza erorii urm\u0103toare:\n{3}.
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR=Driver-ul necesar pentru baza de date {0} nu a fost copiat la loca\u0163ia {1} deoarece directorul \u0163int\u0103 nu exist\u0103.

LOG_MIME_TYPES_SKIP=Nu va fi migrat niciun artefact web.xml deoarece fi\u015fierul {0} nu exist\u0103.
LOG_MIME_TYPES_START=Elementele mime-mapping sunt migrate de la fi\u015fierul {0} la fi\u015fierul {1}.
LOG_RESOURCE_AND_HTTP_SKIP=Nu va fi migrat niciun element Resource sau HTTP Connector deoarece fi\u015fierul {0} nu exist\u0103.
LOG_RESOURCE_AND_HTTP_START=Elementele Resource \u015fi HTTP Connector sunt migrate de la fi\u015fierul {0} la fi\u015fierul {1}.
LOG_SEC_CONSTRAINTS_SKIP=Nu exist\u0103 nici o valoare setat\u0103 la atributul allRolesMode \u00een constr\u00e2ngerile de securitate ale aplica\u0163iei Tomcat. Va fi setat\u0103 valoarea implicit\u0103 'strict'.
LOG_SEC_CONSTRAINTS_START=Constr\u00e2ngerile de securitate ale aplica\u0163iei sunt migrate de la fi\u015fierul {0} la fi\u015fierul {1}.
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=Configura\u0163ia serverului Tomcat nu poate fi migrat\u0103 din cauza urm\u0103toarei excep\u0163ii: \n{0}
LOG_SERVER_CONFIG_SUCCESSFUL=Configura\u0163ia serverului Tomcat a fost migrat\u0103 cu succes.
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=Configura\u0163ia serverului Tomcat a fost migrat\u0103 cu succes, dar sunt necesare actualiz\u0103ri ulterioare la configura\u0163ie. Pentru mai multe informa\u0163ii, vede\u0163i mesajele anterioare acestei intr\u0103ri din fi\u015fierul istoric.
LOG_SERVER_NOT_MIGRATED=Aten\u0163ie: Aplica\u0163ia migrat\u0103 poate depinde de set\u0103ri definite \u00een configura\u0163ia serverului Tomcat corespondent. Pentru a evita problemele, migra\u0163i mai \u00eent\u00e2i configura\u0163ia serverului Tomcat \u00eenainte de a rula aplica\u0163ia.
LOG_SHARED_LIB_DATASOURCE=Configura\u0163ia bibliotecii partajate {0} este ad\u0103ugat\u0103 la fi\u015fierul {1}. Configura\u0163ia este referit\u0103 de elementele datasource.
LOG_SHARED_LIB_CLASSLOADER=Configura\u0163ia bibliotecii partajate {0} este ad\u0103ugat\u0103 la fi\u015fierul {1}. Aceast\u0103 configura\u0163ie este referit\u0103 de elementele classloader ale aplica\u0163iei.
LOG_STANDARD_MANAGER_SKIP=Nu va fi migrat niciun element standard Manager sau Resource deoarece fi\u015fierul {0} nu exist\u0103.
LOG_STANDARD_MANAGER_START=Elementele standard Manager \u015fi Resource sunt migrate de la fi\u015fierul {0} la fi\u015fierul {1}.
LOG_TOMCAT_APP_MIG_OK=Configura\u0163ia aplica\u0163iei Tomcat a fost migrat\u0103 cu succes.
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=Configura\u0163ia aplica\u0163iei Tomcat a fost migrat\u0103 cu succes, dar sunt necesare actualiz\u0103ri ulterioare la configura\u0163ie. Pentru mai multe informa\u0163ii, vede\u0163i mesajele anterioare acestei intr\u0103ri din fi\u015fierul istoric.
LOG_UPDATE_LIBERTY_SERVER_START=Serverul Liberty este actualizat cu configura\u0163ia migrat\u0103.
LOG_USERS_EXCEPTION=Unealta de migrare nu a putut determina dac\u0103 exist\u0103 fi\u015fiere suplimentare de utilizator \u015fi roluri din cauza urm\u0103toarei excep\u0163ii:\n{0}
LOG_USERS_NO_FILE=Au fost migrate fi\u015fierele tomcat-users. Pentru a vedea dac\u0103 fi\u015fierele au fost s\u0103rite pentru c\u0103 nu a putut fi g\u0103site, vede\u0163i alte intr\u0103ri din acest fi\u015fier istoric.
LOG_USERS_SKIP=Niciun element de utilizatori \u015fi niciun element de roluri nu vor fi migrate deoarece fi\u015fierul {0} nu exist\u0103.
LOG_USERS_START=Elementele user \u015fi role sunt migrate de la fi\u015fierul {0} la fi\u015fierul {1}.
LOG_USERS_TEMP_FILE_ERROR=Unealta de migrare nu a putut g\u0103si fi\u015fierul temporar {0}.
LOG_VARIABLES_START=Propriet\u0103\u0163ile Tomcat care sunt referite de configura\u0163ia generat\u0103 sunt migrate de la fi\u015fierul {0} la fi\u015fierul {1}.
LOG_VARIABLES_SCANNING_EXCEPTION=Unealta de migrare nu a putut determina dac\u0103 fi\u015fierul {0} face referire la vreo proprietate Tomcat din cauza urm\u0103toarei excep\u0163ii:\n{1}
LOG_WAMT_EXCEPTION=Unealta de migrare nu a putut determina dac\u0103 aplica\u0163ia folose\u015fte MongoDB din cauza urm\u0103toarei excep\u0163ii: {0}
LOG_WAMT_NOT_FOUND=Unealta de migrare nu a putut determina dac\u0103 aplica\u0163ia folose\u015fte MongoDB. Dac\u0103 aplica\u0163ia dumneavoastr\u0103 utilizeaz\u0103 MongoDB, instala\u0163i Application Migration Tool - Apache Tomcat to WebSphere \u015fi migra\u0163i din nou.

LOG_ACTION_VARIABLE_NOT_MIGRATED=Ac\u0163iune necesar\u0103: Valoarea variabilei {0} care este referit\u0103 \u00een fi\u015fierul {1} nu a putut fi determinat\u0103. Configura\u0163i variabila \u00een serverul Liberty sau modifica\u0163i configura\u0163ia s\u0103 nu fac\u0103 referin\u0163\u0103 la variabil\u0103. Loca\u0163ia implicit\u0103 pentru variabilele migrate este migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=Ac\u0163iune necesar\u0103: Variabila {0} care este referit\u0103 \u00een fi\u015fierul {1} nu a fost migrat\u0103 deoarece  nu este un nume de variabil\u0103 valid \u00een serverul Liberty. Configura\u0163i o variabil\u0103 cu un nume valid sau modifica\u0163i configura\u0163ia ca s\u0103 nu mai fac\u0103 referin\u0163\u0103 la variabil\u0103. Loca\u0163ia implicit\u0103 pentru variabilele migrate este migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=Ac\u0163iune necesar\u0103: Valoarea {0} a variabilei {1} care este referit\u0103 \u00een fi\u015fierul {2} nu este valid\u0103 \u00een serverul Liberty, a\u015fa c\u0103 variabila nu a fost migrat\u0103. Configura\u0163i o variabil\u0103 f\u0103r\u0103 o referin\u0163\u0103 de variabil\u0103 \u00een valoarea sa sau modifica\u0163i configura\u0163ia ca s\u0103 nu fac\u0103 referin\u0163\u0103 la variabil\u0103. Loca\u0163ia implicit\u0103 pentru variabilele migrate este migratedConfig/variables.xml.
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=Aten\u0163ie: Elementul Realm cu atributul className {0} nu a fost migrat. Unealta de migrare nu suport\u0103 migrarea elementelor Realm aflate \u00een fi\u015fierul context.xml al aplica\u0163iei. Dac\u0103 dori\u0163i s\u0103 migra\u0163i elementul Realm, muta\u0163i elementul la fi\u015fierul context.xml care este localizat \u00een directorul conf pentru Tomcat, astfel elementul este migrat cu configura\u0163ia serverului Tomcat.
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=Aten\u0163ie: Elementul Connector cu portul {0} \u015fi protocolul {1} nu a fost migrat. Serverul Liberty nu suport\u0103 acest protocol.
LOG_ATTENTION_CONNECTOR_PORT_ZERO=Aten\u0163ie: Un element Connector cu portul 0 nu a fost migrat. Serverul Liberty nu suport\u0103 o defini\u0163ie de port de 0.
LOG_ATTENTION_EXCEPTION=Aten\u0163ie: Unealta de migrare nu a putut determina dac\u0103 elementele nu au fost migrate de la fi\u015fierul {0} din cauza urm\u0103toarei excep\u0163ii:\n{0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=Aten\u0163ie: Elementul JDBC Resource cu atributul de nume {0} \u015fi atributul driverClassName {1} nu a fost migrat. Configura\u0163i elementul dataSource \u00een serverul Liberty dac\u0103 elementul este necesar.
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=Aten\u0163ie: Elementul Realm de surs\u0103 de date cu atributul dataSourceName {0} nu a fost migrat. Unealta de migrare nu suport\u0103 migrarea acestui element Realm. Configura\u0163i un registru de utilizatori personalizat \u00een serverul Liberty dac\u0103 elementul este necesar.
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=Aten\u0163ie: Elementul JAAS Realm cu atributul appName {0} nu a fost migrat. Unealta de migrare nu suport\u0103 migrarea acestui element Realm. Configura\u0163i un modul de logare personalizat JAAS \u00een serverul Liberty dac\u0103 elementul este necesar. 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=Aten\u0163ie: Elementul JDBC Realm cu atributul driverName {0} nu a fost migrat. Unealta de migrare nu suport\u0103 migrarea acestui element Realm. Configura\u0163i un registru de utilizatori personalizat \u00een serverul Liberty dac\u0103 elementul este necesar.
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=Aten\u0163ie: Elementul JNDI Realm cu atributul connectionURL {0} nu a fost migrat. Unealta de migrare nu suport\u0103 migrarea acestui element Realm. Configura\u0163i un registru de utilizatori LDAP \u00een serverul Liberty dac\u0103 elementul este necesar.
LOG_ATTENTION_MANAGER_NOT_MIGRATED=Aten\u0163ie: Elementul Manager cu atributul className {0} nu a fost migrat. Unealta de migrare nu suport\u0103 migrarea acestui element Manager. Pentru a configura persisten\u0163a de sesiune pentru serverul Liberty, ad\u0103uga\u0163i caracteristica sessionDatabase-1.0 \u015fi specifica\u0163i elementele httpSession \u015fi httpSessionDatabase \u00een caracteristic\u0103.
LOG_ATTENTION_REALM_NOT_MIGRATED=Aten\u0163ie: Elementul Realm cu atributul className {0} nu a fost migrat. Unealta de migrare nu suport\u0103 migrarea acestui element Realm.

LOG_WARNING_PW_NOT_ENCODED=Aten\u0163ie: Atributul de parol\u0103 nu a fost codificat.
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=Aten\u0163ie: Atributul de parol\u0103 nu a fost codificat deoarece face referin\u0163\u0103 la o variabil\u0103. Pentru a \u00eembun\u0103t\u0103\u0163i securitatea serverului, localiza\u0163i variabila referit\u0103 \u015fi asigura\u0163i-v\u0103 c\u0103 valoarea este codificat\u0103.
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=Aten\u0163ie: Atributul de parol\u0103 nu a fost codificat din cauza urm\u0103toarei excep\u0163ii:\n{0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=Aten\u0163ie: Atributele de parol\u0103 nu au fost codificate deoarece nu a putut fi g\u0103sit directorul Liberty, bin.

LOG_BINARY_SCANNER_NOT_FOUND=Scanerul binar nu a putut fi g\u0103sit pe sistemul de fi\u015fiere. Ca rezultat, configura\u0163ia MongoDB ar putea s\u0103 lipseasc\u0103. Verifica\u0163i c\u0103 include\u0163i toate configura\u0163iile necesare dac\u0103 aplica\u0163ia dumneavoastr\u0103 folose\u015fte MongoDB.
LOG_RULE_DIR_NOT_CREATED=Un director temporar nu a putut fi creat pe sistemul de fi\u015fiere. Ca rezultat, configura\u0163ia MongoDB ar putea s\u0103 lipseasc\u0103. Verifica\u0163i c\u0103 include\u0163i toate configura\u0163iile necesare dac\u0103 aplica\u0163ia dumneavoastr\u0103 folose\u015fte MongoDB.
LOG_RULE_FILE_NOT_COPIED=Regula de detectare a utiliz\u0103rii Mongo nu a putut fi copiat\u0103 pe sistemul de fi\u015fiere. Ca rezultat, configura\u0163ia Mongo ar putea s\u0103 lipseasc\u0103. Verifica\u0163i c\u0103 include\u0163i toate configura\u0163iile necesare dac\u0103 aplica\u0163ia dumneavoastr\u0103 folose\u015fte MongoDB.
LOG_BINARY_SCAN_FAILURE=Scanerul binar a e\u015fuat s\u0103 ruleze. Ca rezultat, configura\u0163ia MongoDB ar putea s\u0103 lipseasc\u0103. Verifica\u0163i c\u0103 include\u0163i toate configura\u0163iile necesare dac\u0103 aplica\u0163ia dumneavoastr\u0103 folose\u015fte MongoDB.
LOG_SCAN_OUTPUT_FILE_FAILURE=Fi\u015fierul de ie\u015fire pentru scanerul binar nu a putut fi creat din cauza urm\u0103toarei erori:\n{0}
LOG_MONGO_EXCEPTION=Urm\u0103toarea excep\u0163ie a ap\u0103rut \u00een timpul scan\u0103rii aplica\u0163iei pentru utilizarea  MongoDB:\n{0}

TITLE_APP_CONFIG=Migrare configura\u0163ie aplica\u0163ie Tomcat
TITLE_SERVER_CONFIG=Migrare configura\u0163ie server Tomcat
