# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=\u6b21\u306e\u69cb\u6210\u304c Tomcat \u69cb\u6210\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306b\u3088\u3063\u3066\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002
MIGRATION_COMPLETE_NAMED_FILE=\u6b21\u306e\u69cb\u6210\u304c Tomcat \u69cb\u6210\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306b\u3088\u3063\u3066 {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002
MIGRATION_GENERATED=\u6b21\u306e\u69cb\u6210\u304c Tomcat \u69cb\u6210\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306b\u3088\u3063\u3066\u751f\u6210\u3055\u308c\u307e\u3057\u305f\u3002
JMS_CLASS_CAST_WARNING=\u91cd\u8981: Liberty jmsConnectionFactory \u306f\u3001javax.jms.QueueConnectionFactory \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u304a\u3088\u3073 javax.jms.TopiConnectionFactory \u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u3092\u5b9f\u88c5\u3057\u307e\u305b\u3093\u3002\nJMS \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u3053\u306e\u63a5\u7d9a\u30d5\u30a1\u30af\u30c8\u30ea\u30fc\u3092\u3044\u305a\u308c\u304b\u306e\u30a4\u30f3\u30bf\u30fc\u30d5\u30a7\u30fc\u30b9\u306b\u30ad\u30e3\u30b9\u30c8\u3059\u308b\u3053\u3068\u3092\u8a66\u307f\u305f\u5834\u5408\u3001ClassCastException \u3092\u53d7\u3051\u53d6\u308a\u307e\u3059\u3002
FILE_UPDATED=\u6b21\u306e\u69cb\u6210\u304c Tomcat \u69cb\u6210\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306b\u3088\u3063\u3066\u66f4\u65b0\u3055\u308c\u307e\u3057\u305f\u3002
ACTION_JDBC_DRIVER=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u304c {0} dataSource \u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u306b\u306f\u3001JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u3092 {1} \u306e\u5834\u6240\u306b\u30b3\u30d4\u30fc\u3059\u308b\u304b\u3001JDBC \u30c9\u30e9\u30a4\u30d0\u30fc\u306e\u5834\u6240\u3092\u6307\u3059\u3088\u3046\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ACTION_ORACLE_DRIVER=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: Oracle \u30c9\u30e9\u30a4\u30d0\u30fc\u304c {0} dataSource \u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u306b\u306f\u3001Oracle \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306e\u5185\u5bb9\u3092 {1} \u5171\u6709\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u5834\u6240\u306b\u30b3\u30d4\u30fc\u3059\u308b\u304b\u3001Oracle \u30af\u30e9\u30a4\u30a2\u30f3\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306e\u5834\u6240\u3092\u6307\u3059\u3088\u3046\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
ACTION_USER_PASSWORDS=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: Liberty \u69cb\u6210\u30a8\u30c7\u30a3\u30bf\u30fc\u3092\u4f7f\u7528\u3057\u3066\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u305f\u69cb\u6210\u5185\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u3092 Tomcat \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u306e\u5143\u306e\u6697\u53f7\u5316\u3055\u308c\u3066\u3044\u306a\u3044\u5024\u306b\u5909\u66f4\u3057\u3001\u30cf\u30c3\u30b7\u30e5\u30fb\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3067\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u5143\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u306f\u3001{0} \u30c0\u30a4\u30b8\u30a7\u30b9\u30c8\u30fb\u30a2\u30eb\u30b4\u30ea\u30ba\u30e0\u3092\u4f7f\u7528\u3057\u3066\u6697\u53f7\u5316\u3055\u308c\u3001\u305d\u308c\u3089\u306e\u6697\u53f7\u5316\u5f62\u5f0f\u3067\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u3066\u3044\u307e\u3057\u305f\u3002
STORAGE_REF_WARNING=\u91cd\u8981: \u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3001Liberty \u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u3092\u30e1\u30e2\u30ea\u30fc\u306b\u4fdd\u7ba1\u3057\u307e\u3059\u3002\nLiberty \u30b5\u30fc\u30d0\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30b9\u3092\u69cb\u6210\u3059\u308b\u306b\u306f\u3001sessionDatabase-1.0 \u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u304a\u3088\u3073 httpSessionDatabase \u30a8\u30ec\u30e1\u30f3\u30c8\u3092\u8ffd\u52a0\u3057\u3066\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30b9\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
PATHNAME_WARNING=\u91cd\u8981: Tomcat \u6a19\u6e96 Manager \u304b\u3089\u306e\u30d1\u30b9\u540d\u5c5e\u6027\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u3067\u306f\u3001Liberty \u306f\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30c7\u30fc\u30bf\u3092\u30e1\u30e2\u30ea\u30fc\u306b\u4fdd\u7ba1\u3057\u307e\u3059\u3002\nLiberty \u30b5\u30fc\u30d0\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30b9\u3092\u69cb\u6210\u3059\u308b\u306b\u306f\u3001sessionDatabase-1.0 \u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u304a\u3088\u3073 httpSessionDatabase \u30a8\u30ec\u30e1\u30f3\u30c8\u3092\u8ffd\u52a0\u3057\u3066\u3001\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30b9\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQ_RESOURCE_ADAPTER_ACTION=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: Liberty \u5185\u306e WebSphere MQ \u30e1\u30c3\u30bb\u30fc\u30b8\u30f3\u30b0\u30fb\u30d7\u30ed\u30d0\u30a4\u30c0\u30fc\u3092\u4f7f\u7528\u3059\u308b\u306b\u306f\u3001WebSphere MQ \u30ea\u30bd\u30fc\u30b9\u30fb\u30a2\u30c0\u30d7\u30bf\u30fc\u3092 {0} \u306e\u5834\u6240\u306b\u30b3\u30d4\u30fc\u3059\u308b\u304b\u3001WebSphere MQ \u30ea\u30bd\u30fc\u30b9\u30fb\u30a2\u30c0\u30d7\u30bf\u30fc\u306e\u5834\u6240\u3092\u6307\u3059\u3088\u3046\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MQ_NATIVE_LIB_ACTION=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: nativeLibraryPath \u5c5e\u6027\u3092\u3001WebSphere MQ \u30cd\u30a4\u30c6\u30a3\u30d6\u30fb\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306e\u5834\u6240\u3092\u6307\u3059\u3088\u3046\u306b\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MONGO_CLASSLOADER_NEEDED_ACTION=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: MongoDB Java \u30c9\u30e9\u30a4\u30d0\u30fc\u304c\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306b\u30a2\u30af\u30bb\u30b9\u3067\u304d\u308b\u3088\u3046\u306b\u3059\u308b\u306b\u306f\u3001\u305d\u306e\u30c9\u30e9\u30a4\u30d0\u30fc\u3092 {0} \u5171\u6709\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u306b\u30b3\u30d4\u30fc\u3059\u308b\u304b\u3001\u30c9\u30e9\u30a4\u30d0\u30fc\u306e\u5834\u6240\u3092\u6307\u3059\u3088\u3046\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MULTIPLE_REDIRECT_PORTS=\u91cd\u8981: SSL \u5bfe\u5fdc\u30dd\u30fc\u30c8 {0} \u304c httpEndpoint \u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u3088\u3063\u3066\u65e2\u306b\u5b9a\u7fa9\u3055\u308c\u3066\u304a\u308a\u3001{1} httpEndpoint \u30a8\u30ec\u30e1\u30f3\u30c8\u3067\u4f7f\u7528\u4e0d\u53ef\u306b\u3055\u308c\u307e\u3057\u305f\u3002 httpsPort \u5c5e\u6027\u3067\u4f7f\u7528\u53ef\u80fd\u306a\u30dd\u30fc\u30c8\u3092\u6307\u5b9a\u3057\u3066\u3001httpEndpoint \u30a8\u30ec\u30e1\u30f3\u30c8\u4e0a\u3067 SSL \u3092\u4f7f\u7528\u53ef\u80fd\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002  Liberty \u306f\u3001\u540c\u3058 httpsPort \u5c5e\u6027\u5024\u3092\u6301\u3064\u8907\u6570\u306e httpEndpoint \u30a8\u30ec\u30e1\u30f3\u30c8\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 
DEFAULT_SSL_GENERATED=\u91cd\u8981: SSL \u5bfe\u5fdc\u30dd\u30fc\u30c8 {0} \u306e SSL \u69cb\u6210\u304c\u691c\u51fa\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30c7\u30d5\u30a9\u30eb\u30c8\u306e SSL \u69cb\u6210\u304c\u751f\u6210\u3055\u308c\u307e\u3057\u305f\u3002 
PASSWORD_ENCODE_WARNING=\u91cd\u8981: \u30b5\u30fc\u30d0\u30fc\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u3092\u5f37\u5316\u3059\u308b\u305f\u3081\u306b\u3001{0} \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u5909\u66f4\u3057\u3001\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u3066\u304f\u3060\u3055\u3044\u3002
HTTPS_PORT_UNSUPPORTED_PROTOCOL=\u91cd\u8981: \u30dd\u30fc\u30c8 {1} \u3092\u4f7f\u7528\u3059\u308b Tomcat Connector \u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u3088\u3063\u3066\u53c2\u7167\u3055\u308c\u308b SSL \u5bfe\u5fdc\u30dd\u30fc\u30c8 {0} \u304c\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u4e0a\u3067\u30b5\u30dd\u30fc\u30c8\u3055\u308c\u3066\u3044\u306a\u3044\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u4f7f\u7528\u3057\u3066\u3044\u307e\u3059\u3002 {2} httpEndpoint \u30a8\u30ec\u30e1\u30f3\u30c8\u4e0a\u306e httpsPort \u5c5e\u6027\u304c\u4f7f\u7528\u4e0d\u53ef\u306b\u306a\u308a\u307e\u3057\u305f\u3002
HTTPS_CONNECTOR_MISSING=\u91cd\u8981: \u30dd\u30fc\u30c8 {0} \u3092\u4f7f\u7528\u3059\u308b Tomcat Connector \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u3001\u672a\u5b9a\u7fa9\u306e SSL \u5bfe\u5fdc\u30dd\u30fc\u30c8 {1} \u3092\u53c2\u7167\u3057\u3066\u3044\u307e\u3059\u3002 {2} httpEndpoint \u30a8\u30ec\u30e1\u30f3\u30c8\u4e0a\u306e httpsPort \u5c5e\u6027\u304c\u4f7f\u7528\u4e0d\u53ef\u306b\u306a\u308a\u307e\u3057\u305f\u3002
UNCOMMENT_VIRTUAL_HOST=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u512a\u5148\u4eee\u60f3\u30db\u30b9\u30c8\u3092\u30a2\u30f3\u30b3\u30e1\u30f3\u30c8\u3057\u307e\u3059\u3002default_host \u4eee\u60f3\u30db\u30b9\u30c8\u306f\u3001\u307b\u3068\u3093\u3069\u306e\u7c21\u6613\u69cb\u6210\u306b\u9069\u3057\u3066\u3044\u307e\u3059\u3002
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=\u3044\u3044\u3048\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u307f\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u307e\u3059
DROPDOWN_DEFAULT_SELECT_AN_OPTION=1 \u3064\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044
DROPDOWN_TOMCATSERVER_FILESYSTEM=\u306f\u3044\u3001\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u304b\u3089\u30b5\u30fc\u30d0\u30fc\u3082\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u307e\u3059
DROPDOWN_TOMCATSERVER_WORKSPACE=\u306f\u3044\u3001\u30ef\u30fc\u30af\u30b9\u30da\u30fc\u30b9\u304b\u3089\u30b5\u30fc\u30d0\u30fc\u3082\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u307e\u3059
TITLE_INFO=\u60c5\u5831
TITLE_ERROR=\u30a8\u30e9\u30fc
TITLE_LIBERTY_SELECT=Liberty \u30b5\u30fc\u30d0\u30fc\u306e\u9078\u629e
TITLE_APP_ALREADY_MIGRATED=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u4ee5\u524d\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3
TITLE_SERVER_ALREADY_MIGRATED=\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u4ee5\u524d\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u305f Tomcat \u30b5\u30fc\u30d0\u30fc
TITLE_SERVER_NOT_MIGRATED=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u4e0a\u306e\u4f9d\u5b58\u95a2\u4fc2
TITLE_SUCCESS_DIALOG=\u69cb\u6210\u304c\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=\u69cb\u6210\u304c\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f - \u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u3059
TITLE_TOMCAT_SELECT=Tomcat \u30b5\u30fc\u30d0\u30fc\u306e\u9078\u629e
TITLE_VIRTUAL_HOST_SELECT=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u4eee\u60f3\u30db\u30b9\u30c8\u306b\u30d0\u30a4\u30f3\u30c9
APP_ALREADY_MIGRATED={0} \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f\u3001\u9078\u629e\u3057\u305f Liberty \u30b5\u30fc\u30d0\u30fc {1} \u306b\u4ee5\u524d\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u7d9a\u884c\u3059\u308b\u3068\u3001\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u304c\u4e0a\u66f8\u304d\u3055\u308c\u3001\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u53c2\u7167\u304c\u5931\u308f\u308c\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002 \u554f\u984c\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5225\u306e Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3059\u308b\u304b\u3001\u4ee5\u524d\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u305f\u69cb\u6210\u3092 Liberty \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u524a\u9664\
    \u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u7d9a\u884c\u3057\u307e\u3059\u304b?
SERVER_ALREADY_MIGRATED=Tomcat \u30b5\u30fc\u30d0\u30fc\u306f\u3001\u9078\u629e\u3057\u305f Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u4ee5\u524d\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u9078\u629e\u3057\u305f Tomcat \u30b5\u30fc\u30d0\u30fc {1} \u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u7d9a\u884c\u3059\u308b\u3068\u3001\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u304c\u4e0a\u66f8\u304d\u3055\u308c\u3001\u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3078\u306e\u53c2\u7167\u304c\u5931\u308f\u308c\u308b\u5834\u5408\u304c\u3042\u308a\u307e\u3059\u3002 \u554f\u984c\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001Tomcat \u30b5\u30fc\u30d0\u30fc\u3092\u5225\u306e Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3059\u308b\u304b\u3001\u4ee5\u524d\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u305f\u69cb\u6210\u3092 Liberty \u30b5\u30fc\u30d0\u30fc\u304b\u3089\u524a\u9664\u3057\u3066\u304f\
    \u3060\u3055\u3044\u3002\n\nTomcat \u30b5\u30fc\u30d0\u30fc\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u7d9a\u884c\u3057\u307e\u3059\u304b?
SERVER_NOT_MIGRATED=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u5bfe\u5fdc\u3059\u308b Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u8a2d\u5b9a\u306b\u4f9d\u5b58\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 \u554f\u984c\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001\u307e\u305a\u3053\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30db\u30b9\u30c8\u3059\u308b Liberty \u30b5\u30fc\u30d0\u30fc\u306b Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\nTomcat \u30b5\u30fc\u30d0\u30fc\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3001\u6b21\u306b\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u307e\u3059\u304b?
LIBERTY_SERVER_CHECKBOX=Liberty \u30b5\u30fc\u30d0\u30fc\u69cb\u6210
APP_LOG_FILE_CHECKBOX=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb
SERVER_LOG_FILE_CHECKBOX=\u30b5\u30fc\u30d0\u30fc\u30fb\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb
DESC_LIBERTY_SELECT=Liberty \u30b5\u30fc\u30d0\u30fc\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\nTomcat \u69cb\u6210\u304c\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3059\u3002
MIGRATION_SUCCESS_DIALOG_SERVER=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u69cb\u6210\u3092\u5b8c\u4e86\u3059\u308b\u306b\u306f\u3055\u3089\u306a\u308b\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u958b\u304f\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044:
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u69cb\u6210\u3092\u5b8c\u4e86\u3059\u308b\u306b\u306f\u3055\u3089\u306a\u308b\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u958b\u304f\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044:
MIGRATION_SUCCESS_DIALOG_APPLICATION=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=Tomcat \u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u6b21\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u69cb\u6210\u3092\u5b8c\u4e86\u3059\u308b\u306b\u306f\u3055\u3089\u306a\u308b\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=Tomcat \u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u69cb\u6210\u3092\u5b8c\u4e86\u3059\u308b\u306b\u306f\u3055\u3089\u306a\u308b\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u6b21\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u958b\u304f\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=Tomcat \u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u6b21\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n{1}\n{2}\n\n\u958b\u304f\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044:
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u69cb\u6210\u3092\u5b8c\u4e86\u3059\u308b\u306b\u306f\u3055\u3089\u306a\u308b\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {1} \u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\n\u958b\u304f\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044:
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=Tomcat \u30b5\u30fc\u30d0\u30fc\u304a\u3088\u3073\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c Liberty \u30b5\u30fc\u30d0\u30fc {0} \u306b\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002\n\n\u69cb\u6210\u3092\u5b8c\u4e86\u3059\u308b\u306b\u306f\u3055\u3089\u306a\u308b\u30a2\u30af\u30b7\u30e7\u30f3\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u6b21\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n{1}\n{2}\n\n\u958b\u304f\u30d5\u30a1\u30a4\u30eb\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044:
MIGRATION_FAILURE_DIALOG=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093:\n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092 Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u8ffd\u52a0\u3057\u3066\u3044\u307e\u3059...
PROGRESS_COPYING_LIBERTY_SERVER=Liberty server.xml \u30d5\u30a1\u30a4\u30eb\u3092\u30b3\u30d4\u30fc\u3057\u3066\u3044\u307e\u3059...
PROGRESS_GENERATING_CONFIG_FILE=Liberty \u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u3092\u751f\u6210\u3057\u3066\u3044\u307e\u3059...
PROGRESS_LOADING_CONFIG_INFO=\u69cb\u6210\u60c5\u5831\u3092\u30ed\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059...
PROGRESS_MIGRATING_APPLICATION=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
PROGRESS_MIGRATING_CONTEXT_XML=context.xml \u30d5\u30a1\u30a4\u30eb\u304b\u3089\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059...
PROGRESS_MIGRATING_SERVER=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
PROGRESS_MIGRATING_SERVER_XML=server.xml \u30d5\u30a1\u30a4\u30eb\u304b\u3089\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059...
PROGRESS_MIGRATING_SHARED_LIBRARIES=\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u306e\u5171\u6709\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Tomcat \u30e6\u30fc\u30b6\u30fc\u3068\u5f79\u5272\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE={0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 Tomcat \u30e6\u30fc\u30b6\u30fc\u3068\u5f79\u5272\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Tomcat \u30e6\u30fc\u30b6\u30fc\u3068\u5f79\u5272\u3092 {0} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059...
PROGRESS_ENCODING_X_PASSWORDS={0} \u500b\u306e\u30d1\u30b9\u30ef\u30fc\u30c9\u3092\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059...
PROGRESS_ENCODING_PASSWORD_X_OF_Y={0}/{1} \u306e\u30d1\u30b9\u30ef\u30fc\u30c9 \u3092\u30a8\u30f3\u30b3\u30fc\u30c9\u3057\u3066\u3044\u307e\u3059...
PROGRESS_MIGRATING_VARIABLES=catalina.properties \u30d5\u30a1\u30a4\u30eb\u304b\u3089 Tomcat \u5909\u6570\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059...
PROGRESS_MIGRATING_WEB_XML=web.xml \u30d5\u30a1\u30a4\u30eb\u304b\u3089\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092 Liberty \u30b5\u30fc\u30d0\u30fc\u4e0a\u306b\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3057\u3066\u3044\u307e\u3059...
PROGRESS_TITLE_CONFIG_MIGRATION=Tomcat \u69cb\u6210\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u306e\u9032\u884c
PROGRESS_UPDATING_LIBERTY_SERVER=Liberty server.xml \u30d5\u30a1\u30a4\u30eb\u3092\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059...
PROGRESS_VALIDATING_LIBERTY_SERVER=Liberty \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059...
PROGRESS_VERIFYING_VIRTUAL_HOST=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u69cb\u6210\u3092\u691c\u8a3c\u3057\u3066\u3044\u307e\u3059...
SELECTION_NOT_SUPPORTED=\u73fe\u5728\u306e\u9078\u629e\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002 Tomcat \u30b5\u30fc\u30d0\u30fc\u3001\u307e\u305f\u306f Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u542b\u3080 Java \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306e\u3044\u305a\u308c\u304b\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
NO_CONFIG_FOUND=\u73fe\u5728\u306e\u9078\u629e\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002 Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002
SERVER_TYPE_ERROR=\u9078\u629e\u3057\u305f\u30b5\u30fc\u30d0\u30fc\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002 Tomcat \u30b5\u30fc\u30d0\u30fc\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002       
LIBERTY_CONFIG_NOT_FOUND=Liberty \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c\u898b\u3064\u304b\u3089\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002
INVALID_JAVA_PROJECT=\u9078\u629e\u3057\u305f Java \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b {0} \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002
NO_WEB_XML=\u9078\u629e\u3057\u305f Java \u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u306b {0} \u30d5\u30a1\u30a4\u30eb\u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u30d7\u30ed\u30b8\u30a7\u30af\u30c8\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002
NOT_TOMCAT_SERVER_DIR=\u73fe\u5728\u306e\u9078\u629e\u304c\u6709\u52b9\u306a Tomcat \u30b5\u30fc\u30d0\u30fc\u3067\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u9078\u629e\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002
NOT_TOMCAT_SERVER_FILE=\u9078\u629e\u3057\u305f\u30b5\u30fc\u30d0\u30fc\u306b\u30d5\u30a1\u30a4\u30eb {0} \u304c\u542b\u307e\u308c\u3066\u3044\u306a\u3044\u305f\u3081\u3001\u3053\u306e\u30b5\u30fc\u30d0\u30fc\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3002
NO_LIBERTY_SERVER_XML=\u9078\u629e\u3057\u305f Liberty \u30b5\u30fc\u30d0\u30fc\u306b server.xml \u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
MISSING_LIBERTY_DIRECTORY=\u9078\u629e\u3057\u305f Liberty \u30b5\u30fc\u30d0\u30fc\u304c\u7121\u52b9\u3067\u3059\u3002 {0} \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u304c\u542b\u307e\u308c\u3066\u3044\u307e\u305b\u3093\u3002
SELECT_TOMCAT_SERVER=\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3059\u308b Tomcat \u30b5\u30fc\u30d0\u30fc\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002
SELECT_VIRTUAL_HOST=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u3092\u9078\u629e\u3057\u3066\u304f\u3060\u3055\u3044\u3002\n\ndefault_host \u4eee\u60f3\u30db\u30b9\u30c8\u306f\u3001\u307b\u3068\u3093\u3069\u306e\u7c21\u6613\u69cb\u6210\u306b\u9069\u3057\u3066\u3044\u307e\u3059\u3002

# Exceptions
EXCEPT_LOG_CREATE_ERROR=Tomcat \u69cb\u6210\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb {0} \u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
INVALID_WAR_FILE=\u6307\u5b9a\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 WAR \u30d5\u30a1\u30a4\u30eb\u306f\u5b58\u5728\u3057\u306a\u3044\u304b\u3001.war \u30d5\u30a1\u30a4\u30eb\u3067\u306f\u3042\u308a\u307e\u305b\u3093: {0}\u3002
INVALID_OUTPUT_DIRECTORY=\u6307\u5b9a\u3055\u308c\u305f\u51fa\u529b\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: {0}\u3002
INVALID_DIRECTORY=\u6307\u5b9a\u3055\u308c\u305f\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306f\u7121\u52b9\u3067\u3059: {0}\u3002
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= Liberty \u30b5\u30fc\u30d0\u30fc\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
TEMP_FILE_DELETE_FAIL=\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u4e2d\u306b\u4f5c\u6210\u3055\u308c\u305f 1 \u3064\u4ee5\u4e0a\u306e\u4e00\u6642\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u8ffd\u52a0\u3055\u308c\u307e\u3057\u305f\u3002
LOG_ADDED_INCLUDE_FILE=\u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u30d5\u30a1\u30a4\u30eb {0} \u304c {1} \u30d5\u30a1\u30a4\u30eb\u306b\u542b\u307e\u308c\u3066\u3044\u307e\u3057\u305f\u3002 
LOG_APP_CONFIG_MIG_FAILED=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: \n {0}
LOG_APP_CONFIG_MIG_NO_SERVER=Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30b5\u30fc\u30d0\u30fc\u304c\u6307\u5b9a\u3055\u308c\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u8ffd\u52a0\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
LOG_APP_CONFIG_MIG_WITH_ERROR=Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u30ed\u30b0\u306b\u4ee5\u524d\u8a18\u9332\u3055\u308c\u305f\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u4f8b\u5916\u306e\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u8ffd\u52a0\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
LOG_APP_PUBLISH_FAILED=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092 Liberty \u30b5\u30fc\u30d0\u30fc\u4e0a\u306b\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: \n {0}
LOG_APP_PUBLISH_OK=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u6b63\u5e38\u306b\u30d1\u30d6\u30ea\u30c3\u30b7\u30e5\u3055\u308c\u307e\u3057\u305f\u3002
LOG_APP_RESOURCES_SKIP=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e context.xml \u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3002
LOG_APP_RESOURCES_START=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30ea\u30bd\u30fc\u30b9\u3092 {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
LOG_APP_VIRTUAL_HOST_GENERATE=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 ibm-web-bnd.xml \u30d5\u30a1\u30a4\u30eb\u3092\u3001{0} \u4eee\u60f3\u30db\u30b9\u30c8\u3092\u4f7f\u7528\u3057\u3066\u751f\u6210\u3057\u3066\u3044\u307e\u3059\u3002
LOG_APP_VIRTUAL_HOST_START=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e\u4eee\u60f3\u30db\u30b9\u30c8\u3092\u69cb\u6210\u3057\u3066\u3044\u307e\u3059\u3002
LOG_APP_VIRTUAL_HOST_UPDATE=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 ibm-web-bnd.xml \u30d5\u30a1\u30a4\u30eb\u3092\u3001{0} \u4eee\u60f3\u30db\u30b9\u30c8\u3067\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059\u3002
LOG_COPY_SERVER_XML=\u5143\u306e Liberty server.xml \u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u304c {0} \u30d5\u30a1\u30a4\u30eb\u306b\u4fdd\u5b58\u3055\u308c\u307e\u3057\u305f\u3002
LOG_COPY_APP_WEB_BND_XML=\u5143\u306e\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3 ibm-web-bnd.xml \u30d5\u30a1\u30a4\u30eb\u306e\u5185\u5bb9\u304c {0} \u30d5\u30a1\u30a4\u30eb\u306b\u4fdd\u5b58\u3055\u308c\u307e\u3057\u305f\u3002
LOG_GEN_TOP_LEVEL_CONFIG={0} \u69cb\u6210\u30d5\u30a1\u30a4\u30eb\u304c\u751f\u6210\u3055\u308c\u307e\u3057\u305f\u3002\u3053\u306e\u30d5\u30a1\u30a4\u30eb\u306f\u3001Liberty server.xml \u30d5\u30a1\u30a4\u30eb\u306b\u542b\u307e\u308c\u307e\u3059\u3002
LOG_HDR_APP_CONTEXT_XML=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e context.xml \u30d5\u30a1\u30a4\u30eb = {0}
LOG_HDR_APP_NAME=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u540d = {0}
LOG_HDR_APP_WEB_XML=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e web.xml \u30d5\u30a1\u30a4\u30eb = {0}
LOG_HDR_LIBERTY_SERVER_DIR=Liberty \u30b5\u30fc\u30d0\u30fc\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc = {0}
LOG_HDR_NO_APP_CONTEXT_XML=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e context.xml \u30d5\u30a1\u30a4\u30eb\u306f\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3002
LOG_HDR_TOMCAT_SERVER_DIR=Tomcat \u30b5\u30fc\u30d0\u30fc\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=Tomcat \u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30f3\u30bf\u30a4\u30e0\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=CATALINA_HOME \u304b\u3089\u306e Tomcat \u30b5\u30fc\u30d0\u30fc\u30fb\u30e9\u30f3\u30bf\u30a4\u30e0\u306e\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=CATALINA_HOME \u304b\u3089\u306e Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc = {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306f Liberty \u30b5\u30fc\u30d0\u30fc\u306b\u8ffd\u52a0\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f: \n {0}
LOG_BEGINNING={0} - \u30ed\u30b0\u5165\u529b\u3092\u958b\u59cb\u3057\u307e\u3059
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=MM/dd/yy kk:mm:ss:SSS z
LOG_DELETE_FILE_ERROR={0} \u4e00\u6642\u30d5\u30a1\u30a4\u30eb\u3092\u524a\u9664\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
LOG_END={0} - \u30ed\u30b0\u5165\u529b\u3092\u7d42\u4e86\u3057\u307e\u3059
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE={0} \u30d5\u30a1\u30a4\u30eb\u3092\u30af\u30ed\u30fc\u30ba\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
LOG_FILE_COPIED={0} \u30d5\u30a1\u30a4\u30eb\u304c {1} \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u304b\u3089 {2} \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306b\u30b3\u30d4\u30fc\u3055\u308c\u307e\u3057\u305f\u3002
LOG_FILE_COPIED_ERROR=\u6b21\u306e\u30a8\u30e9\u30fc\u306e\u305f\u3081\u3001{0} \u30d5\u30a1\u30a4\u30eb\u304c {1} \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u304b\u3089 {2} \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306b\u30b3\u30d4\u30fc\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f:\n {3}\u3002
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR={0} \u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u306b\u5fc5\u8981\u306a\u30c9\u30e9\u30a4\u30d0\u30fc\u304c {1} \u306e\u5834\u6240\u306b\u30b3\u30d4\u30fc\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u305d\u306e\u30bf\u30fc\u30b2\u30c3\u30c8\u30fb\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u304c\u5b58\u5728\u3057\u3066\u3044\u307e\u305b\u3093\u3002

LOG_MIME_TYPES_SKIP=\u30b5\u30fc\u30d0\u30fc web.xml \u6210\u679c\u7269\u306f\u3001{0} \u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3002
LOG_MIME_TYPES_START=mime-mapping \u30a8\u30ec\u30e1\u30f3\u30c8\u3092 {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
LOG_RESOURCE_AND_HTTP_SKIP=Resource \u30a8\u30ec\u30e1\u30f3\u30c8\u3082 HTTP Connector \u30a8\u30ec\u30e1\u30f3\u30c8\u3082\u3001{0} \u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3002
LOG_RESOURCE_AND_HTTP_START=Resource \u30a8\u30ec\u30e1\u30f3\u30c8\u304a\u3088\u3073 HTTP Connector \u30a8\u30ec\u30e1\u30f3\u30c8\u3092 {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
LOG_SEC_CONSTRAINTS_SKIP=Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u5236\u7d04\u3067\u3001allRolesMode \u5c5e\u6027\u306b\u5024\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002 \u5024\u306f\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u300cstrict\u300d\u306b\u306a\u308a\u307e\u3059\u3002
LOG_SEC_CONSTRAINTS_START=\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u5236\u7d04\u3092 {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: \n {0}
LOG_SERVER_CONFIG_SUCCESSFUL=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u304c\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u69cb\u6210\u306e\u3055\u3089\u306a\u308b\u66f4\u65b0\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u3053\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u524d\u306e\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_SERVER_NOT_MIGRATED=\u91cd\u8981: \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u305f\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c\u3001\u5bfe\u5fdc\u3059\u308b Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u3067\u5b9a\u7fa9\u3055\u308c\u3066\u3044\u308b\u8a2d\u5b9a\u306b\u4f9d\u5b58\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002 \u554f\u984c\u3092\u56de\u907f\u3059\u308b\u306b\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u5b9f\u884c\u3059\u308b\u524d\u306b Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_SHARED_LIB_DATASOURCE={0} \u5171\u6709\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u69cb\u6210\u3092 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u8ffd\u52a0\u3057\u3066\u3044\u307e\u3059\u3002 \u3053\u306e\u69cb\u6210\u306f\u3001\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u3088\u3063\u3066\u53c2\u7167\u3055\u308c\u307e\u3059\u3002
LOG_SHARED_LIB_CLASSLOADER={0} \u5171\u6709\u30e9\u30a4\u30d6\u30e9\u30ea\u30fc\u69cb\u6210\u3092 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u8ffd\u52a0\u3057\u3066\u3044\u307e\u3059\u3002 \u3053\u306e\u69cb\u6210\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u30fb\u30af\u30e9\u30b9\u30fb\u30ed\u30fc\u30c0\u30fc\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u306b\u3088\u3063\u3066\u53c2\u7167\u3055\u308c\u307e\u3059\u3002
LOG_STANDARD_MANAGER_SKIP=\u6a19\u6e96\u306e Manager \u30a8\u30ec\u30e1\u30f3\u30c8\u304a\u3088\u3073 Resource \u30a8\u30ec\u30e1\u30f3\u30c8\u306f\u3001{0} \u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3002
LOG_STANDARD_MANAGER_START=\u6a19\u6e96\u306e Manager \u30a8\u30ec\u30e1\u30f3\u30c8\u304a\u3088\u3073 Resource \u30a8\u30ec\u30e1\u30f3\u30c8\u304c {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u3066\u3044\u307e\u3059\u3002
LOG_TOMCAT_APP_MIG_OK=Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u3002
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u304c\u6b63\u5e38\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u3057\u305f\u304c\u3001\u69cb\u6210\u306e\u3055\u3089\u306a\u308b\u66f4\u65b0\u304c\u5fc5\u8981\u3067\u3059\u3002 \u8a73\u7d30\u306b\u3064\u3044\u3066\u306f\u3001\u3053\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u524d\u306e\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_UPDATE_LIBERTY_SERVER_START=Liberty \u30b5\u30fc\u30d0\u30fc\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u305f\u69cb\u6210\u3067\u66f4\u65b0\u3057\u3066\u3044\u307e\u3059\u3002
LOG_USERS_EXCEPTION=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u8ffd\u52a0\u306e\u30e6\u30fc\u30b6\u30fc\u30fb\u30d5\u30a1\u30a4\u30eb\u304a\u3088\u3073\u5f79\u5272\u30d5\u30a1\u30a4\u30eb\u304c\u3042\u308b\u304b\u5224\u5225\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f:\n{0}
LOG_USERS_NO_FILE=tomcat-users \u30d5\u30a1\u30a4\u30eb\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u3089\u306a\u304b\u3063\u305f\u305f\u3081\u306b\u30b9\u30ad\u30c3\u30d7\u3055\u308c\u305f\u304b\u3069\u3046\u304b\u3092\u78ba\u8a8d\u3059\u308b\u306b\u306f\u3001\u3053\u306e\u30ed\u30b0\u30fb\u30d5\u30a1\u30a4\u30eb\u5185\u306e\u4ed6\u306e\u30a8\u30f3\u30c8\u30ea\u30fc\u3092\u53c2\u7167\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_USERS_SKIP={0} \u30d5\u30a1\u30a4\u30eb\u304c\u5b58\u5728\u3057\u306a\u3044\u305f\u3081\u3001\u30e6\u30fc\u30b6\u30fc\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u304a\u3088\u3073\u5f79\u5272\u30a8\u30ec\u30e1\u30f3\u30c8\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3002
LOG_USERS_START=\u30e6\u30fc\u30b6\u30fc\u30fb\u30a8\u30ec\u30e1\u30f3\u30c8\u304a\u3088\u3073\u5f79\u5272\u30a8\u30ec\u30e1\u30f3\u30c8\u3092 {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
LOG_USERS_TEMP_FILE_ERROR=\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001{0} \u4e00\u6642\u30d5\u30a1\u30a4\u30eb\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002
LOG_VARIABLES_START=\u751f\u6210\u3055\u308c\u305f\u69cb\u6210\u306b\u3088\u3063\u3066\u53c2\u7167\u3055\u308c\u308b Tomcat \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092 {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089 {1} \u30d5\u30a1\u30a4\u30eb\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u3044\u307e\u3059\u3002
LOG_VARIABLES_SCANNING_EXCEPTION=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001{0} \u30d5\u30a1\u30a4\u30eb\u304c\u3044\u305a\u308c\u304b\u306e Tomcat \u30d7\u30ed\u30d1\u30c6\u30a3\u30fc\u3092\u53c2\u7167\u3057\u3066\u3044\u308b\u304b\u5224\u5225\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f:\n {1}
LOG_WAMT_EXCEPTION=\u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c MongoDB \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u304b\u5224\u5225\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f: {0}
LOG_WAMT_NOT_FOUND=\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c MongoDB \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u304b\u5224\u5225\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u304c MongoDB \u3092\u4f7f\u7528\u3057\u3066\u3044\u308b\u5834\u5408\u306f\u3001Application Migration Tool - Apache Tomcat to WebSphere \u3092\u30a4\u30f3\u30b9\u30c8\u30fc\u30eb\u3057\u3066\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u518d\u5ea6\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u3066\u304f\u3060\u3055\u3044\u3002

LOG_ACTION_VARIABLE_NOT_MIGRATED=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: {1} \u30d5\u30a1\u30a4\u30eb\u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u308b {0} \u5909\u6570\u306e\u5024\u3092\u5224\u5225\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 Liberty \u30b5\u30fc\u30d0\u30fc\u3067\u5909\u6570\u3092\u69cb\u6210\u3059\u308b\u304b\u3001\u305d\u306e\u5909\u6570\u3092\u53c2\u7167\u3057\u306a\u3044\u3088\u3046\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u5f8c\u306e\u5909\u6570\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5834\u6240\u306f migratedConfig/variables.xml \u3067\u3059\u3002
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: {1} \u30d5\u30a1\u30a4\u30eb\u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u308b {0} \u5909\u6570\u306f\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u3067\u6709\u52b9\u306a\u5909\u6570\u540d\u3067\u306f\u306a\u3044\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u6709\u52b9\u306a\u540d\u524d\u3092\u6301\u3064\u5909\u6570\u3092\u69cb\u6210\u3059\u308b\u304b\u3001\u305d\u306e\u5909\u6570\u3092\u53c2\u7167\u3057\u306a\u3044\u3088\u3046\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u5f8c\u306e\u5909\u6570\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5834\u6240\u306f migratedConfig/variables.xml \u3067\u3059\u3002
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=\u5fc5\u8981\u306a\u30a2\u30af\u30b7\u30e7\u30f3: {2} \u30d5\u30a1\u30a4\u30eb\u3067\u53c2\u7167\u3055\u308c\u3066\u3044\u308b {1} \u5909\u6570\u306e {0} \u5024\u306f\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u3067\u6709\u52b9\u3067\u306a\u3044\u305f\u3081\u3001\u305d\u306e\u5909\u6570\u306f\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u5909\u6570\u3092\u305d\u306e\u5024\u306e\u53c2\u7167\u3092\u306a\u304f\u3057\u3066\u69cb\u6210\u3059\u308b\u304b\u3001\u305d\u306e\u5909\u6570\u3092\u53c2\u7167\u3057\u306a\u3044\u3088\u3046\u69cb\u6210\u3092\u5909\u66f4\u3057\u3066\u304f\u3060\u3055\u3044\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u5f8c\u306e\u5909\u6570\u306e\u30c7\u30d5\u30a9\u30eb\u30c8\u306e\u5834\u6240\u306f migratedConfig/variables.xml \u3067\u3059\u3002
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=\u91cd\u8981: {0} className \u5c5e\u6027\u3092\u542b\u3080 Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u306e context.xml \u30d5\u30a1\u30a4\u30eb\u5185\u306b\u3042\u308b Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u3092\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3057\u305f\u3044\u5834\u5408\u306f\u3001Tomcat conf \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u306b\u3042\u308b context.xml \u30d5\u30a1\u30a4\u30eb\u306b Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u3092\u79fb\u52d5\u3057\u3066\u3001\u3053\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u304c Tomcat \u30b5\u30fc\u30d0\
    \u30fc\u69cb\u6210\u3068\u4e00\u7dd2\u306b\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u307e\u3059\u3002
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=\u91cd\u8981: \u30dd\u30fc\u30c8 {0} \u3068 {1} \u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u542b\u3080 Connector \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 Liberty \u30b5\u30fc\u30d0\u30fc\u306f\u3001\u3053\u306e\u30d7\u30ed\u30c8\u30b3\u30eb\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
LOG_ATTENTION_CONNECTOR_PORT_ZERO=\u91cd\u8981: \u30dd\u30fc\u30c8 0 \u3092\u542b\u3080 Connector \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 Liberty \u30b5\u30fc\u30d0\u30fc\u306f\u30010 \u306e\u30dd\u30fc\u30c8\u5b9a\u7fa9\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u3066\u3044\u307e\u305b\u3093\u3002
LOG_ATTENTION_EXCEPTION=\u91cd\u8981: \u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u30a8\u30ec\u30e1\u30f3\u30c8\u304c {0} \u30d5\u30a1\u30a4\u30eb\u304b\u3089\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u306a\u304b\u3063\u305f\u304b\u5224\u5225\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f:\n{0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=\u91cd\u8981: {0} name \u5c5e\u6027\u304a\u3088\u3073 {1} driverClassName \u5c5e\u6027\u3092\u542b\u3080 JDBC Resource \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u3053\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u3067 dataSource \u30a8\u30ec\u30e1\u30f3\u30c8\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=\u91cd\u8981: {0} dataSourceName \u5c5e\u6027\u3092\u542b\u3080\u30c7\u30fc\u30bf\u30fb\u30bd\u30fc\u30b9 Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u3053\u306e Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 \u3053\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u3067\u30ab\u30b9\u30bf\u30e0\u30fb\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=\u91cd\u8981: {0} appName \u5c5e\u6027\u3092\u542b\u3080 JAAS Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u3053\u306e Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 \u3053\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u3067 JAAS \u30ab\u30b9\u30bf\u30e0\u30fb\u30ed\u30b0\u30a4\u30f3\u30fb\u30e2\u30b8\u30e5\u30fc\u30eb\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=\u91cd\u8981: {0} driverName \u5c5e\u6027\u3092\u542b\u3080 JDBC Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u3053\u306e Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 \u3053\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u3067\u30ab\u30b9\u30bf\u30e0\u30fb\u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=\u91cd\u8981: {0} connectionURL \u5c5e\u6027\u3092\u542b\u3080 JNDI Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u3053\u306e Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 \u3053\u306e\u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u5fc5\u8981\u306a\u5834\u5408\u306f\u3001Liberty \u30b5\u30fc\u30d0\u30fc\u3067 LDAP \u30e6\u30fc\u30b6\u30fc\u30fb\u30ec\u30b8\u30b9\u30c8\u30ea\u30fc\u3092\u69cb\u6210\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_ATTENTION_MANAGER_NOT_MIGRATED=\u91cd\u8981: {0} className \u5c5e\u6027\u3092\u542b\u3080 Manager \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u3053\u306e Manager \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002 Liberty \u30b5\u30fc\u30d0\u30fc\u306e\u30bb\u30c3\u30b7\u30e7\u30f3\u30fb\u30d1\u30fc\u30b7\u30b9\u30bf\u30f3\u30b9\u3092\u69cb\u6210\u3059\u308b\u306b\u306f\u3001sessionDatabase-1.0 \u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3092\u8ffd\u52a0\u3057\u3001\u3053\u306e\u30d5\u30a3\u30fc\u30c1\u30e3\u30fc\u3067 httpSession \u30a8\u30ec\u30e1\u30f3\u30c8\u304a\u3088\u3073 httpSessionDatabase \u30a8\u30ec\u30e1\u30f3\u30c8\u3092\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_ATTENTION_REALM_NOT_MIGRATED=\u91cd\u8981: {0} className \u5c5e\u6027\u3092\u542b\u3080 Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u304c\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u30fb\u30c4\u30fc\u30eb\u306f\u3001\u3053\u306e Realm \u30a8\u30ec\u30e1\u30f3\u30c8\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u3092\u30b5\u30dd\u30fc\u30c8\u3057\u307e\u305b\u3093\u3002

LOG_WARNING_PW_NOT_ENCODED=\u91cd\u8981: \u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u304c\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=\u91cd\u8981: \u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u306f\u3001\u5909\u6570\u3092\u53c2\u7167\u3059\u308b\u305f\u3081\u3001\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30b5\u30fc\u30d0\u30fc\u306e\u30bb\u30ad\u30e5\u30ea\u30c6\u30a3\u30fc\u3092\u5f37\u5316\u3059\u308b\u306b\u306f\u3001\u53c2\u7167\u3055\u308c\u308b\u5909\u6570\u3092\u898b\u3064\u3051\u3001\u5024\u304c\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u308b\u3088\u3046\u306b\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=\u91cd\u8981: \u6b21\u306e\u4f8b\u5916\u306e\u305f\u3081\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u306f\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f:\n{0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=\u91cd\u8981: Liberty bin \u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u898b\u3064\u3051\u308b\u3053\u3068\u304c\u3067\u304d\u306a\u304b\u3063\u305f\u305f\u3081\u3001\u30d1\u30b9\u30ef\u30fc\u30c9\u5c5e\u6027\u306f\u30a8\u30f3\u30b3\u30fc\u30c9\u3055\u308c\u307e\u305b\u3093\u3067\u3057\u305f\u3002

LOG_BINARY_SCANNER_NOT_FOUND=\u30d0\u30a4\u30ca\u30ea\u30fc\u30fb\u30b9\u30ad\u30e3\u30ca\u30fc\u304c\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u3067\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u305d\u306e\u7d50\u679c\u3001MongoDB \u69cb\u6210\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 MongoDB \u304c\u4f7f\u7528\u3055\u308c\u308b\u5834\u5408\u3001\u5fc5\u8981\u306a\u69cb\u6210\u3092\u3059\u3079\u3066\u542b\u3081\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_RULE_DIR_NOT_CREATED=\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u4e00\u6642\u30c7\u30a3\u30ec\u30af\u30c8\u30ea\u30fc\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u305d\u306e\u7d50\u679c\u3001MongoDB \u69cb\u6210\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 MongoDB \u304c\u4f7f\u7528\u3055\u308c\u308b\u5834\u5408\u3001\u5fc5\u8981\u306a\u69cb\u6210\u3092\u3059\u3079\u3066\u542b\u3081\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_RULE_FILE_NOT_COPIED=Mongo \u306e\u4f7f\u7528\u3092\u691c\u51fa\u3059\u308b\u305f\u3081\u306e\u898f\u5247\u3092\u30d5\u30a1\u30a4\u30eb\u30fb\u30b7\u30b9\u30c6\u30e0\u306b\u30b3\u30d4\u30fc\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002\u305d\u306e\u7d50\u679c\u3001Mongo \u69cb\u6210\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 MongoDB \u304c\u4f7f\u7528\u3055\u308c\u308b\u5834\u5408\u3001\u5fc5\u8981\u306a\u69cb\u6210\u3092\u3059\u3079\u3066\u542b\u3081\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_BINARY_SCAN_FAILURE=\u30d0\u30a4\u30ca\u30ea\u30fc\u30fb\u30b9\u30ad\u30e3\u30ca\u30fc\u306e\u5b9f\u884c\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002\u305d\u306e\u7d50\u679c\u3001MongoDB \u69cb\u6210\u304c\u6b20\u843d\u3057\u3066\u3044\u308b\u53ef\u80fd\u6027\u304c\u3042\u308a\u307e\u3059\u3002\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3067 MongoDB \u304c\u4f7f\u7528\u3055\u308c\u308b\u5834\u5408\u3001\u5fc5\u8981\u306a\u69cb\u6210\u3092\u3059\u3079\u3066\u542b\u3081\u3066\u3044\u308b\u3053\u3068\u3092\u78ba\u8a8d\u3057\u3066\u304f\u3060\u3055\u3044\u3002
LOG_SCAN_OUTPUT_FILE_FAILURE=\u6b21\u306e\u30a8\u30e9\u30fc\u306b\u3088\u308a\u30d0\u30a4\u30ca\u30ea\u30fc\u30fb\u30b9\u30ad\u30e3\u30ca\u30fc\u306e\u51fa\u529b\u30d5\u30a1\u30a4\u30eb\u3092\u4f5c\u6210\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f:\n{0}
LOG_MONGO_EXCEPTION=MongoDB \u306e\u4f7f\u7528\u306b\u3064\u3044\u3066\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u3092\u30b9\u30ad\u30e3\u30f3\u4e2d\u306b\u6b21\u306e\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f:\n {0}

TITLE_APP_CONFIG=Tomcat \u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u69cb\u6210\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3
TITLE_SERVER_CONFIG=Tomcat \u30b5\u30fc\u30d0\u30fc\u69cb\u6210\u306e\u30de\u30a4\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3
