# *+------------------------------------------------------------------------+
# *| Licensed Materials - Property of IBM                                   |
# *| (C) Copyright IBM Corp. 2013, 2019 All Rights Reserved.                |
# *|                                                                        |
# *| US Government Users Restricted Rights - Use, duplication or            |
# *| disclosure restricted by GSA ADP Schedule Contract with                |
# *| IBM Corp.                                                              |
# *+------------------------------------------------------------------------+

# NLS_MESSAGEFORMAT_VAR
# NLS_ENCODING=UNICODE

# Error/warning messages defined below.  
#Reserved for com.ibm.ws.configmigration.tomcat :  CWMIG6000 - CWMIG6999


# Migrated XML file comments 
# For this group of messages only, the single quote must be coded as 2 consecutive single quotes ( ''), even when there is no replacement variable in the message. These messages are retrieved with xslt and output in xml and need special handling.
# NLS_MESSAGEFORMAT_ALL
MIGRATION_COMPLETE=La configuration suivante a \u00e9t\u00e9 migr\u00e9e par l''outil de migration de configuration Tomcat.
MIGRATION_COMPLETE_NAMED_FILE=La configuration suivante a \u00e9t\u00e9 migr\u00e9e \u00e0 partir du fichier {0} par l''outil de migration de configuration Tomcat.
MIGRATION_GENERATED=La configuration suivante a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e par l''outil de migration de configuration Tomcat.
JMS_CLASS_CAST_WARNING=Attention : Liberty jmsConnectionFactory n''impl\u00e9mente pas les interfaces javax.jms.QueueConnectionFactory et javax.jms.TopiConnectionFactory interfaces. \nLes applications JMS re\u00e7oivent une exception ClassCastException si elles tentent de transtyper cette fabrique de connexions vers une autre interface.
FILE_UPDATED=La configuration suivante a \u00e9t\u00e9 mise \u00e0 jour par l''outil de migration de configuration Tomcat.
ACTION_JDBC_DRIVER=Action requise : Pour rendre le pilote JDBC accessible pour l''\u00e9l\u00e9ment dataSource {0}, copiez le pilote JDBC dans l''emplacement {1} ou modifiez la configuration pour qu''elle pointe vers l''emplacement du pilote JDBC.
ACTION_ORACLE_DRIVER=Action requise : Pour rendre le pilote Oracle accessible pour l''\u00e9l\u00e9ment dataSource {0}, copiez le contenu du r\u00e9pertoire client Oracle dans l''emplacement de la biblioth\u00e8que partag\u00e9e {1} ou modifiez la configuration pour qu''elle pointe vers l''emplacement du r\u00e9pertoire client Oracle.
ACTION_USER_PASSWORDS=Action requise : Utilisez l''\u00e9diteur de configuration Liberty pour modifier les attributs de mot de passe et les coder par hachage dans la configuration migr\u00e9e vers les valeurs non chiffr\u00e9es initiales \u00e0 partir du serveur Tomcat. Les mots de passe d''origine ont \u00e9t\u00e9 chiffr\u00e9s \u00e0 l''aide de l''algorithme de pr\u00e9traitement {0} et migr\u00e9s dans leur forme chiffr\u00e9e.
STORAGE_REF_WARNING=Attention : Par d\u00e9faut, Liberty stocke les donn\u00e9es de session en m\u00e9moire. \nPour configurer la persistance de session pour le serveur Liberty, ajoutez la fonction sessionDatabase-1.0 et un \u00e9l\u00e9ment httpSessionDatabase pour configurer la persistance de session.
PATHNAME_WARNING=Attention : L''attribut pathname provenant du gestionnaire standard Tomcat n''a pas \u00e9t\u00e9 migr\u00e9. Par d\u00e9faut, Liberty stocke les donn\u00e9es de session en m\u00e9moire. \nPour configurer la persistance de session pour le serveur Liberty, ajoutez la fonction sessionDatabase-1.0 et un \u00e9l\u00e9ment httpSessionDatabase pour configurer la persistance de session.
MQ_RESOURCE_ADAPTER_ACTION=Action requise : Pour utiliser le fournisseur de messagerie WebSphere MQ dans Liberty, copiez l''adaptateur de ressources WebSphere MQ \u00e0 l''emplacement {0} ou modifiez la configuration pour pointer vers l''emplacement de l''adaptateur de ressources WebSphere MQ.
MQ_NATIVE_LIB_ACTION=Action requise : Modifiez l''attribut nativeLibraryPath pour qu''il pointe vers l''emplacement des biblioth\u00e8ques natives WebSphere MQ.
MONGO_CLASSLOADER_NEEDED_ACTION=Action requise : Pour rendre le pilote Java MongoDB accessible pour l''application, copiez le pilote dans la biblioth\u00e8que partag\u00e9e {0} ou modifiez la configuration pour qu''elle pointe vers l''emplacement du pilote.
MULTIPLE_REDIRECT_PORTS=Attention : Le port SSL {0} est d\u00e9j\u00e0 d\u00e9fini par un \u00e9l\u00e9ment httpEndpoint et a \u00e9t\u00e9 d\u00e9sactiv\u00e9 dans l''\u00e9l\u00e9ment httpEndpoint {1}. Indiquez dans l''attribut httpsPort un port disponible de mani\u00e8re \u00e0 activer la couche Secure Sockets Layer sur l''\u00e9l\u00e9ment httpEndpoint. Liberty ne prend pas en charge plusieurs \u00e9l\u00e9ments httpEndpoint avec la m\u00eame valeur d''attribut httpsPort. 
DEFAULT_SSL_GENERATED=Attention : Aucune configuration SSL n''a \u00e9t\u00e9 d\u00e9tect\u00e9e pour le port SSL {0}. La configuration SSL par d\u00e9faut a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9e. 
PASSWORD_ENCODE_WARNING=Attention : Pour am\u00e9liorer la s\u00e9curit\u00e9 du serveur, modifiez et codez le mot de passe sur l''\u00e9l\u00e9ment {0}.
HTTPS_PORT_UNSUPPORTED_PROTOCOL=Attention : Le port SSL {0} r\u00e9f\u00e9renc\u00e9 par l''\u00e9l\u00e9ment Tomcat Connector avec le port {1} utilise un protocole qui n''est pas pris en charge sur le serveur Liberty. L''attribut httpsPort de l''\u00e9l\u00e9ment httpEndpoint {2} a \u00e9t\u00e9 d\u00e9sactiv\u00e9.
HTTPS_CONNECTOR_MISSING=Attention : L''\u00e9l\u00e9ment Connector Tomcat auquel le port {0} est associ\u00e9 fait r\u00e9f\u00e9rence au port SSL {1} qui n''est pas d\u00e9fini. L''attribut httpsPort de l''\u00e9l\u00e9ment httpEndpoint {2} a \u00e9t\u00e9 d\u00e9sactiv\u00e9.
UNCOMMENT_VIRTUAL_HOST=Supprimez la mise en commentaire de l''h\u00f4te virtuel pr\u00e9f\u00e9r\u00e9 de votre application. L''h\u00f4te virtuel default_host convient \u00e0 la plupart des configurations simples.
# End of Migrated XML file comments

# NLS_MESSAGEFORMAT_VAR
# dialog box
DROPDOWN_CONTINUE_MIGRATION=Non, uniquement migrer mon application
DROPDOWN_DEFAULT_SELECT_AN_OPTION=S\u00e9lectionnez une option
DROPDOWN_TOMCATSERVER_FILESYSTEM=Oui, \u00e9galement migrer un serveur depuis mon syst\u00e8me de fichiers
DROPDOWN_TOMCATSERVER_WORKSPACE=Oui, \u00e9galement migrer un serveur depuis mon espace de travail
TITLE_INFO=Informations
TITLE_ERROR=Erreur
TITLE_LIBERTY_SELECT=S\u00e9lection de serveur Liberty
TITLE_APP_ALREADY_MIGRATED=Application pr\u00e9c\u00e9demment migr\u00e9e vers ce serveur
TITLE_SERVER_ALREADY_MIGRATED=Serveur Tomcat pr\u00e9c\u00e9demment migr\u00e9 vers ce serveur
TITLE_SERVER_NOT_MIGRATED=D\u00e9pendances sur la configuration de serveur Tomcat
TITLE_SUCCESS_DIALOG=La migration de la configuration a abouti
TITLE_SUCCESS_DIALOG_WITH_ACTIONS=La migration de la configuration a abouti - Action requise
TITLE_TOMCAT_SELECT=S\u00e9lection de serveur Tomcat
TITLE_VIRTUAL_HOST_SELECT=Liaison d'une application \u00e0 un h\u00f4te virtuel
APP_ALREADY_MIGRATED=L''application {0} a \u00e9t\u00e9 migr\u00e9e pr\u00e9c\u00e9demment vers le serveur Liberty s\u00e9lectionn\u00e9, {1}.\n\nSi vous poursuivez la migration de l''application, les fichiers de configuration seront \u00e9cras\u00e9s, et les r\u00e9f\u00e9rences \u00e0 vos fichiers de configuration seront peut-\u00eatre perdues. Pour \u00e9viter des probl\u00e8mes, migrez votre application sur un autre serveur Liberty ou supprimez la configuration migr\u00e9e pr\u00e9c\u00e9demment \u00e0 partir du serveur Liberty.\n\nSouhaitez-vous poursuivre la migration de votre application ?
SERVER_ALREADY_MIGRATED=Un serveur Tomcat a \u00e9t\u00e9 migr\u00e9 pr\u00e9c\u00e9demment sur le serveur Liberty s\u00e9lectionn\u00e9, {0}.\n\nSi vous poursuivez la migration du serveur Tomcat s\u00e9lectionn\u00e9, {1}, les fichiers de configuration seront \u00e9cras\u00e9s, et les r\u00e9f\u00e9rences \u00e0 vos fichiers de configuration seront peut-\u00eatre perdues. Pour \u00e9viter des probl\u00e8mes, migrez votre serveur Tomcat vers un autre serveur Liberty ou supprimez la configuration migr\u00e9e pr\u00e9c\u00e9demment \u00e0 partir du serveur Liberty.\n\nSouhaitez-vous poursuivre la migration de votre serveur Tomcat ?
SERVER_NOT_MIGRATED=L'application peut d\u00e9pendre des param\u00e8tres d\u00e9finis dans la configuration de serveur Tomcat correspondante. Pour \u00e9viter des probl\u00e8mes, migrez d'abord la configuration du serveur Tomcat vers le serveur Liberty qui h\u00e9bergera l'application.\n\nSouhaitez-vous migrer d'abord votre serveur Tomcat, puis votre application ?
LIBERTY_SERVER_CHECKBOX=Configuration du serveur Liberty
APP_LOG_FILE_CHECKBOX=Fichier journal de migration d'application
SERVER_LOG_FILE_CHECKBOX=Fichier journal de migration du serveur
DESC_LIBERTY_SELECT=S\u00e9lectionnez un serveur Liberty. \nVotre configuration Tomcat sera migr\u00e9e vers ce serveur.
MIGRATION_SUCCESS_DIALOG_SERVER=La configuration du serveur Tomcat a \u00e9t\u00e9 migr\u00e9e correctement vers le serveur Liberty suivant : {0}.\n\nPour plus d''informations, voir le fichier journal suivant : {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_ACTIONS=La configuration du serveur Tomcat a \u00e9t\u00e9 migr\u00e9e correctement vers le serveur Liberty suivant : {0}.\n\nUne action suppl\u00e9mentaire est n\u00e9cessaire pour terminer la configuration. Pour plus d''informations, voir le fichier journal suivant : {1}.
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES=La configuration du serveur Tomcat a \u00e9t\u00e9 migr\u00e9e correctement vers le serveur Liberty suivant : {0}.\n\nPour plus d''informations, voir le fichier journal suivant : {1}.\n\nS\u00e9lectionnez les fichiers que vous souhaitez ouvrir :
MIGRATION_SUCCESS_DIALOG_SERVER_WITH_FILES_WITH_ACTIONS=La configuration du serveur Tomcat a \u00e9t\u00e9 migr\u00e9e correctement vers le serveur Liberty suivant : {0}.\n\nUne action suppl\u00e9mentaire est n\u00e9cessaire pour terminer la configuration. Pour plus d''informations, voir le fichier journal suivant : {1}.\n\nS\u00e9lectionnez les fichiers que vous souhaitez ouvrir :
MIGRATION_SUCCESS_DIALOG_APPLICATION=La configuration de l''application a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nPour plus d''informations, voir le fichier journal suivant : {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER=La configuration du serveur et de l''application Tomcat a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nPour plus d''informations, voir les fichiers journaux suivants :\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_ACTIONS=La configuration de l''application a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nUne action suppl\u00e9mentaire est n\u00e9cessaire pour terminer la configuration. Pour plus d''informations, voir le fichier journal suivant : {1}.
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_ACTIONS=La configuration du serveur et de l''application Tomcat a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nUne action suppl\u00e9mentaire est n\u00e9cessaire pour terminer la configuration. Pour plus d''informations, voir les fichiers journaux suivants :\n{1}\n{2}
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES=La configuration de l''application a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nPour plus d''informations, voir le fichier journal suivant : {1}.\n\nS\u00e9lectionnez les fichiers que vous souhaitez ouvrir :
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES=La configuration du serveur et de l''application Tomcat a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nPour plus d''informations, voir les fichiers journaux suivants :\n{1}\n{2}\n\nS\u00e9lectionnez les fichiers que vous souhaitez ouvrir :
MIGRATION_SUCCESS_DIALOG_APPLICATION_WITH_FILES_WITH_ACTIONS=La configuration de l''application a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nUne action suppl\u00e9mentaire est n\u00e9cessaire pour terminer la configuration. Pour plus d''informations, voir le fichier journal suivant : {1}.\n\nS\u00e9lectionnez les fichiers que vous souhaitez ouvrir :
MIGRATION_SUCCESS_DIALOG_APPLICATION_AND_SERVER_WITH_FILES_WITH_ACTIONS=La configuration du serveur et de l''application Tomcat a \u00e9t\u00e9 migr\u00e9e correctement sur le serveur Liberty suivant : {0}.\n\nUne action suppl\u00e9mentaire est n\u00e9cessaire pour terminer la configuration. Pour plus d''informations, voir les fichiers journaux suivants :\n{1}\n{2}\n\nS\u00e9lectionnez les fichiers que vous souhaitez ouvrir :
MIGRATION_FAILURE_DIALOG=Impossible de migrer la configuration en raison de l''exception suivante :\n{0}
PROGRESS_ADDING_APP_TO_LIBERTY_SERVER=Ajout de l'application sur le serveur Liberty...
PROGRESS_COPYING_LIBERTY_SERVER=Copie du fichier Liberty server.xml...
PROGRESS_GENERATING_CONFIG_FILE=G\u00e9n\u00e9ration du fichier de configuration Liberty...
PROGRESS_LOADING_CONFIG_INFO=Chargement des informations de configuration...
PROGRESS_MIGRATING_APPLICATION=La configuration d'application est en cours de migration.
PROGRESS_MIGRATING_CONTEXT_XML=Migration de la configuration \u00e0 partir du fichier context.xml...
PROGRESS_MIGRATING_SERVER=La configuration de serveur Tomcat est en cours de migration.
PROGRESS_MIGRATING_SERVER_XML=Migration de la configuration \u00e0 partir du fichier server.xml...
PROGRESS_MIGRATING_SHARED_LIBRARIES=Migration des biblioth\u00e8ques partag\u00e9es pour les sources de donn\u00e9es... 
PROGRESS_MIGRATING_USERS_AND_ROLES=Migration des utilisateurs et r\u00f4les Tomcat...
PROGRESS_MIGRATING_USERS_AND_ROLES_FOR_FILE=Migration des utilisateurs et r\u00f4les Tomcat \u00e0 partir du fichier {0}...
PROGRESS_MIGRATING_USERS_AND_ROLES_TO_FILE=Migration des utilisateurs et r\u00f4les Tomcat vers le fichier {0}...
PROGRESS_ENCODING_X_PASSWORDS=Codage de {0} mots de passe...
PROGRESS_ENCODING_PASSWORD_X_OF_Y=Codage de {0} mot de passe sur {1}...
PROGRESS_MIGRATING_VARIABLES=Migration des variables Tomcat \u00e0 partir du fichier catalina.properties...
PROGRESS_MIGRATING_WEB_XML=Migration de la configuration \u00e0 partir du fichier web.xml...
PROGRESS_PUBLISHING_APP_ON_LIBERTY_SERVER=Publication de l'application sur le serveur Liberty...
PROGRESS_TITLE_CONFIG_MIGRATION=Progression de la migration de la configuration Tomcat
PROGRESS_UPDATING_LIBERTY_SERVER=Mise \u00e0 jour du fichier Liberty server.xml...
PROGRESS_VALIDATING_LIBERTY_SERVER=Validation de la configuration du serveur Liberty...
PROGRESS_VERIFYING_VIRTUAL_HOST=V\u00e9rification de la configuration d'h\u00f4te virtuel pour l'application...
SELECTION_NOT_SUPPORTED=Impossible de migrer la s\u00e9lection en cours. S\u00e9lectionnez un serveur Tomcat ou un projet Java qui contient une application Tomcat.
NO_CONFIG_FOUND=Impossible de migrer la s\u00e9lection en cours. La configuration de serveur Tomcat est introuvable.
SERVER_TYPE_ERROR=Impossible de migrer le serveur s\u00e9lectionn\u00e9. S\u00e9lectionnez un serveur Tomcat.       
LIBERTY_CONFIG_NOT_FOUND=La configuration ne peut pas \u00eatre migr\u00e9e, car la configuration du serveur Liberty est introuvable.
INVALID_JAVA_PROJECT=Impossible de migrer le projet Java s\u00e9lectionn\u00e9 car il ne contient pas un r\u00e9pertoire {0}.
NO_WEB_XML=Impossible de migrer le projet Java s\u00e9lectionn\u00e9 car il ne contient pas un fichier {0}.
NOT_TOMCAT_SERVER_DIR=Impossible de migrer la s\u00e9lection en cours car il ne s'agit pas d'un serveur Tomcat valide.
NOT_TOMCAT_SERVER_FILE=Impossible de migrer le serveur s\u00e9lectionn\u00e9 car il ne contient pas le fichier suivant : {0}.
NO_LIBERTY_SERVER_XML=Le serveur Liberty s\u00e9lectionn\u00e9 ne contient pas de fichier de configuration server.xml.
MISSING_LIBERTY_DIRECTORY=Le serveur Liberty s\u00e9lectionn\u00e9 n''est pas valide. Il ne contient pas le r\u00e9pertoire {0}.
SELECT_TOMCAT_SERVER=S\u00e9lectionnez un serveur Tomcat \u00e0 migrer.
SELECT_VIRTUAL_HOST=S\u00e9lectionnez un h\u00f4te virtuel pour votre application.\n\nL'h\u00f4te virtuel default_host convient \u00e0 la plupart des configurations simples.

# Exceptions
EXCEPT_LOG_CREATE_ERROR=L''outil de migration de configuration Tomcat n''a pas pu cr\u00e9er le fichier journal suivant : {0}.
INVALID_WAR_FILE=Le fichier war de l''application sp\u00e9cifi\u00e9e n''existe pas ou n''est pas un fichier .war : {0}.
INVALID_OUTPUT_DIRECTORY=Le r\u00e9pertoire de sortie sp\u00e9cifi\u00e9 n''a pas pu \u00eatre cr\u00e9\u00e9 : {0}.
INVALID_DIRECTORY=Le r\u00e9pertoire sp\u00e9cifi\u00e9 n''est pas valide : {0}.
LIBERTY_SERVER_DIRECTORY_NOT_SPECIFIED= Le r\u00e9pertoire de serveur Liberty n'a pas \u00e9t\u00e9 sp\u00e9cifi\u00e9.
TEMP_FILE_DELETE_FAIL=Un ou plusieurs fichiers temporaires cr\u00e9\u00e9s lors de la migration n'ont pas pu \u00eatre supprim\u00e9s.

# Log headers and messages
LOG_ADDED_APP_TO_LIBERTY=L'application a \u00e9t\u00e9 ajout\u00e9e sur le serveur Liberty.
LOG_ADDED_INCLUDE_FILE=Le fichier de configuration de serveur, {0}, \u00e9tait inclus dans le fichier {1}. 
LOG_APP_CONFIG_MIG_FAILED=Impossible de migrer la configuration d''application Tomcat en raison de l''exception suivante :\n {0}
LOG_APP_CONFIG_MIG_NO_SERVER=La configuration de l'application Tomcat a \u00e9t\u00e9 migr\u00e9e, mais l'application n'a pas \u00e9t\u00e9 ajout\u00e9e sur le serveur Liberty, car aucun serveur n'a \u00e9t\u00e9 indiqu\u00e9.
LOG_APP_CONFIG_MIG_WITH_ERROR=La configuration de l'application Tomcat a \u00e9t\u00e9 migr\u00e9e, mais l'application n'a pas \u00e9t\u00e9 ajout\u00e9e sur le serveur Liberty en raison d'une exception de publication journalis\u00e9e pr\u00e9c\u00e9demment.
LOG_APP_PUBLISH_FAILED=Impossible de publier l''application sur le serveur Liberty en raison de l''exception suivante :\n {0}
LOG_APP_PUBLISH_OK=L'application a \u00e9t\u00e9 publi\u00e9e correctement sur le serveur Liberty.
LOG_APP_RESOURCES_SKIP=Aucune ressource d'application ne sera migr\u00e9e car le fichier context.xml d'application n'existe pas.
LOG_APP_RESOURCES_START=Les ressources d''application sont en cours de migration depuis le fichier {0} vers le fichier {1}.
LOG_APP_VIRTUAL_HOST_GENERATE=Le fichier ibm-web-bnd.xml d''application est en cours de cr\u00e9ation avec l''h\u00f4te virtuel {0}.
LOG_APP_VIRTUAL_HOST_START=L'h\u00f4te virtuel pour l'application est en cours de configuration.
LOG_APP_VIRTUAL_HOST_UPDATE=Le fichier ibm-web-bnd.xml d''application est en cours de mise \u00e0 jour avec l''h\u00f4te virtuel {0}.
LOG_COPY_SERVER_XML=Le contenu du fichier Liberty initial server.xml a \u00e9t\u00e9 enregistr\u00e9 dans le fichier {0}.
LOG_COPY_APP_WEB_BND_XML=Le contenu du fichier ibm-web-bnd.xml d''application d''origine a \u00e9t\u00e9 sauvegard\u00e9 dans le fichier {0}.
LOG_GEN_TOP_LEVEL_CONFIG=Le fichier de configuration {0} a \u00e9t\u00e9 g\u00e9n\u00e9r\u00e9 et sera inclus dans le fichier Liberty server.xml.
LOG_HDR_APP_CONTEXT_XML=Fichier context.xml d''application = {0}
LOG_HDR_APP_NAME=Nom d''application = {0}
LOG_HDR_APP_WEB_XML=Fichier web.xml d''application = {0}
LOG_HDR_LIBERTY_SERVER_DIR=R\u00e9pertoire de serveur Liberty = {0}
LOG_HDR_NO_APP_CONTEXT_XML=Un fichier context.xml d'application n'existe pas, par cons\u00e9quent, il ne sera pas migr\u00e9.
LOG_HDR_TOMCAT_SERVER_DIR=R\u00e9pertoire de serveur Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR=R\u00e9pertoire d''ex\u00e9cution de serveur Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_RUNTIME_DIR_CATALINA_HOME=R\u00e9pertoire d''ex\u00e9cution de serveur Tomcat depuis CATALINA_HOME = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR=R\u00e9pertoire de configuration de serveur Tomcat = {0}
LOG_HDR_TOMCAT_SERVER_CONF_DIR_CATALINA_HOME=R\u00e9pertoire de configuration de serveur Tomcat depuis CATALINA_HOME = {0}
LOG_APP_NOT_ADDED_TO_LIBERTY=L''application n''a pas \u00e9t\u00e9 ajout\u00e9 sur le serveur Liberty en raison de l''exception suivante :\n {0}
LOG_BEGINNING={0} - d\u00e9but de l''entr\u00e9e de journal
# Note to Translators: You can change the order of the date format (such as dd/MM/yy or dd/MM/yyyy), but do NOT change the actual letters used.
LOG_DATE_FORMAT=dd/MM/yy kk:mm:ss:SSS z
LOG_DELETE_FILE_ERROR=Impossible de supprimer le fichier temporaire {0}.
LOG_END={0} - fin de l''entr\u00e9e de journal
LOG_ENTRY_IMPORTANT=** {0}
LOG_ENTRY_INFO=-- {0}
LOG_ENTRY_TIMESTAMP=[{0}]
LOG_ERROR_CLOSING_FILE=Impossible de fermer le fichier {0}.
LOG_FILE_COPIED=Le fichier {0} a \u00e9t\u00e9 copi\u00e9 du r\u00e9pertoire {1} dans le r\u00e9pertoire {2}.
LOG_FILE_COPIED_ERROR=Le fichier {0} n''a pas \u00e9t\u00e9 copi\u00e9 du r\u00e9pertoire {1} dans le r\u00e9pertoire {2} en raison de l''erreur suivante :\n{3}.
LOG_FILE_NOT_COPIED_NO_LIBERTY_SHARED_RESOURCE_DIR=Le pilote requis pour la base de donn\u00e9es {0} n''a pas \u00e9t\u00e9 copi\u00e9 dans l''emplacement {1} car le r\u00e9pertoire cible n''existe pas.

LOG_MIME_TYPES_SKIP=Aucun artefact web.xml de serveur ne sera migr\u00e9 car le fichier {0} n''existe pas.
LOG_MIME_TYPES_START=Les \u00e9l\u00e9ments mime-mapping sont en cours de migration depuis le fichier {0} vers le fichier {1}.
LOG_RESOURCE_AND_HTTP_SKIP=Aucun \u00e9l\u00e9ment Resource ou HTTP Connector ne sera migr\u00e9 car le fichier {0} n''existe pas.
LOG_RESOURCE_AND_HTTP_START=Les \u00e9l\u00e9ments Resource et HTTP Connector sont en cours de migration depuis le fichier {0} vers le fichier {1}.
LOG_SEC_CONSTRAINTS_SKIP=Aucune valeur n'est d\u00e9finie pour l'attribut allRolesMode dans les contraintes de s\u00e9curit\u00e9 d'application Tomcat. La valeur 'strict' est prise par d\u00e9faut.
LOG_SEC_CONSTRAINTS_START=Les contraintes de s\u00e9curit\u00e9 d''application sont en cours de migration depuis le fichier {0} vers le fichier {1}.
LOG_SEPARATOR=*****************************************************************
LOG_SERVER_CONFIG_FAILED=Impossible de migrer la configuration de serveur Tomcat en raison de l''exception suivante :\n{0}
LOG_SERVER_CONFIG_SUCCESSFUL=La migration de la configuration du serveur Tomcat a abouti.
LOG_SERVER_CONFIG_SUCCESSFUL_WITH_ACTIONS=La migration de la configuration du serveur Tomcat a abouti, mais des mises \u00e0 jour suppl\u00e9mentaires doivent \u00eatre apport\u00e9es \u00e0 la configuration. Pour plus d'informations, voir les entr\u00e9es pr\u00e9c\u00e9dentes de ce fichier journal.
LOG_SERVER_NOT_MIGRATED=Attention : L'application migr\u00e9e peut d\u00e9pendre des param\u00e8tres d\u00e9finis dans la configuration de serveur Tomcat correspondante. Pour \u00e9viter tout probl\u00e8me, migrez la configuration de serveur Tomcat avant d'ex\u00e9cuter l'application.
LOG_SHARED_LIB_DATASOURCE=La configuration de biblioth\u00e8que partag\u00e9e {0} est en cours d''ajout au fichier {1}. Cette configuration est r\u00e9f\u00e9renc\u00e9e par des \u00e9l\u00e9ments datasource.
LOG_SHARED_LIB_CLASSLOADER=La configuration de biblioth\u00e8que partag\u00e9e {0} est en cours d''ajout au fichier {1}. Cette configuration est r\u00e9f\u00e9renc\u00e9e par des \u00e9l\u00e9ments de chargeur de classe d''application.
LOG_STANDARD_MANAGER_SKIP=Aucun \u00e9l\u00e9ment Standard Manager et Resource ne sera migr\u00e9 car le fichier {0} n''existe pas.
LOG_STANDARD_MANAGER_START=Les \u00e9l\u00e9ments Standard Manager et Resource sont en cours de migration depuis le fichier {0} vers le fichier {1}.
LOG_TOMCAT_APP_MIG_OK=La migration de la configuration d'application Tomcat a abouti.
LOG_TOMCAT_APP_MIG_OK_WITH_ACTIONS=La migration de la configuration d'application Tomcat a abouti, mais des mises \u00e0 jour suppl\u00e9mentaires doivent \u00eatre apport\u00e9es \u00e0 la configuration. Pour plus d'informations, voir les entr\u00e9es pr\u00e9c\u00e9dentes de ce fichier journal.
LOG_UPDATE_LIBERTY_SERVER_START=Le serveur Liberty est en cours de mise \u00e0 jour avec la configuration migr\u00e9e.
LOG_USERS_EXCEPTION=L''outil de migration n''a pas pu d\u00e9terminer s''il existe d''autres fichiers de r\u00f4les et d''utilisateurs en raison de l''exception suivante :\n{0}
LOG_USERS_NO_FILE=Aucun fichier d'utilisateurs Tomcat n'a \u00e9t\u00e9 migr\u00e9. Pour savoir si les fichiers ont \u00e9t\u00e9 ignor\u00e9s car ils \u00e9taient introuvables, voir les autres entr\u00e9es de ce fichier journal.
LOG_USERS_SKIP=Aucun \u00e9l\u00e9ment User et Role ne sera migr\u00e9 car le fichier {0} n''existe pas.
LOG_USERS_START=Les \u00e9l\u00e9ments User et Role sont en cours de migration depuis le fichier {0} vers le fichier {1}.
LOG_USERS_TEMP_FILE_ERROR=L''outil de migration n''a pas pu trouver le fichier temporaire {0}.
LOG_VARIABLES_START=Les propri\u00e9t\u00e9s Tomcat qui sont r\u00e9f\u00e9renc\u00e9es par la configuration g\u00e9n\u00e9r\u00e9e sont en cours de migration depuis le fichier {0} vers le fichier {1}.
LOG_VARIABLES_SCANNING_EXCEPTION=L''outil de migration n''a pas pu d\u00e9terminer si le fichier {0} fait r\u00e9f\u00e9rence \u00e0 des propri\u00e9t\u00e9s Tomcat en raison de l''exception suivante :\n {1}
LOG_WAMT_EXCEPTION=L''outil de migration n''a pas pu d\u00e9terminer si l''application utilise MongoDB en raison de l''exception suivante : {0}
LOG_WAMT_NOT_FOUND=L'outil de migration n'a pas pu d\u00e9terminer si l'application utilise MongoDB. Si votre application utilises MongoDB, installez l'outil de migration d'application d'Apache Tomcat vers WebSphere, puis relancez la migration de l'application.

LOG_ACTION_VARIABLE_NOT_MIGRATED=Action requise : Impossible de d\u00e9terminer la valeur de la variable {0} qui est r\u00e9f\u00e9renc\u00e9e dans le fichier {1}. Configurez la variable sur le serveur Liberty ou modifiez la configuration de mani\u00e8re \u00e0 ne pas r\u00e9f\u00e9rencer la variable. L''emplacement par d\u00e9faut pour les variables migr\u00e9es est le suivant : migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_NAME_NOT_SUPPORTED=Action requise : La variable {0} r\u00e9f\u00e9renc\u00e9e dans le fichier {1} n''a pas \u00e9t\u00e9 migr\u00e9e, car il ne s''agit pas d''un nom de variable valide sur le serveur Liberty. Configurez une variable avec un nom valide ou modifiez la configuration de sorte qu''elle ne fasse pas r\u00e9f\u00e9rence \u00e0 la variable. L''emplacement par d\u00e9faut pour les variables migr\u00e9es est le suivant : migratedConfig/variables.xml.
LOG_ACTION_VARIABLE_VALUE_NOT_VALID=Action requise : La valeur {0} de la variable {1} r\u00e9f\u00e9renc\u00e9e dans le fichier {2} n''est pas valide sur le serveur Liberty, donc la variable n''a pas \u00e9t\u00e9 migr\u00e9e. Configurez une variable sans r\u00e9f\u00e9rence de variable dans sa valeur ou modifiez la configuration de sorte qu''elle ne fasse pas r\u00e9f\u00e9rence \u00e0 la variable. L''emplacement par d\u00e9faut pour les variables migr\u00e9es est le suivant : migratedConfig/variables.xml.
LOG_ATTENTION_APPLICATION_CONTEXT_REALM_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment Realm auquel l''attribut className {0} est associ\u00e9 n''a pas \u00e9t\u00e9 migr\u00e9. L''outil de migration ne prend pas en charge la migration des \u00e9l\u00e9ments Realm situ\u00e9s dans le fichier context.xml d''application. Si vous souhaitez migrer l''\u00e9l\u00e9ment Realm, d\u00e9placez-le vers le fichier context.xml qui se trouve dans le r\u00e9pertoire conf de Tomcat de sorte qu''il soit migr\u00e9 avec la configuration du serveur Tomcat.
LOG_ATTENTION_CONNECTOR_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment Connector auquel le port {0} et le protocole {1} sont associ\u00e9s n''a pas \u00e9t\u00e9 migr\u00e9. Le serveur Liberty ne prend pas en charge ce protocole.
LOG_ATTENTION_CONNECTOR_PORT_ZERO=Attention : Un \u00e9l\u00e9ment Connector auquel le port 0 est associ\u00e9 n'a pas \u00e9t\u00e9 migr\u00e9. Le serveur Liberty ne prend pas en charge une d\u00e9finition de port 0.
LOG_ATTENTION_EXCEPTION=Attention : L''outil de migration n''a pas pu d\u00e9terminer si des \u00e9l\u00e9ments n''ont pas \u00e9t\u00e9 migr\u00e9s depuis le fichier {0} en raison de l''exception suivante : \n {0}
LOG_ATTENTION_JDBC_RESOURCE_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment JDBC Resource auquel l''attribut de nom {0} et l''attribut driverClassName {1} sont associ\u00e9s n''a pas \u00e9t\u00e9 migr\u00e9. Configurez l''\u00e9l\u00e9ment dataSource sur le serveur Liberty si l''\u00e9l\u00e9ment est n\u00e9cessaire.
LOG_ATTENTION_DATASOURCE_REALM_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment Realm de source de donn\u00e9es auquel l''attribut dataSourceName {0} est associ\u00e9 n''a pas \u00e9t\u00e9 migr\u00e9. L''outil de migration ne prend pas en charge la migration de cet \u00e9l\u00e9ment Realm. Configurez un registre  d''utilisateurs personnalis\u00e9 sur le serveur Liberty si l''\u00e9l\u00e9ment est obligatoire.
LOG_ATTENTION_JAAS_REALM_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment JAAS Realm auquel l''attribut appName {0} est associ\u00e9 n''a pas \u00e9t\u00e9 migr\u00e9. L''outil de migration ne prend pas en charge la migration de cet \u00e9l\u00e9ment Realm. Configurez un module de connexion personnalis\u00e9 JAAS sur le serveur Liberty si l''\u00e9l\u00e9ment est obligatoire. 
LOG_ATTENTION_JDBC_REALM_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment JDBC Realm auquel l''attribut driverName {0} est associ\u00e9 n''a pas \u00e9t\u00e9 migr\u00e9. L''outil de migration ne prend pas en charge la migration de cet \u00e9l\u00e9ment Realm. Configurez un registre  d''utilisateurs personnalis\u00e9 sur le serveur Liberty si l''\u00e9l\u00e9ment est obligatoire.
LOG_ATTENTION_JNDI_REALM_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment JNDI Realm auquel l''attribut connectionURL {0} est associ\u00e9 n''a pas \u00e9t\u00e9 migr\u00e9. L''outil de migration ne prend pas en charge la migration de cet \u00e9l\u00e9ment Realm. Configurez un registre d''utilisateurs LDAP sur le serveur Liberty si l''\u00e9l\u00e9ment est obligatoire.
LOG_ATTENTION_MANAGER_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment Manager auquel l''attribut className {0} est associ\u00e9 n''a pas \u00e9t\u00e9 migr\u00e9. L''outil de migration ne prend pas en charge la migration de cet \u00e9l\u00e9ment Manager. Pour configurer la persistance de session pour le serveur Liberty, ajoutez la fonction sessionDatabase-1.0 et sp\u00e9cifiez les \u00e9l\u00e9ments httpSession et httpSessionDatabase dans la fonction.
LOG_ATTENTION_REALM_NOT_MIGRATED=Attention : L''\u00e9l\u00e9ment Realm auquel l''attribut className {0} est associ\u00e9 n''a pas \u00e9t\u00e9 migr\u00e9. L''outil de migration ne prend pas en charge la migration de cet \u00e9l\u00e9ment Realm.

LOG_WARNING_PW_NOT_ENCODED=Attention : L'attribut password n'a pas \u00e9t\u00e9 cod\u00e9.
LOG_WARNING_PW_NOT_ENCODED_VARIABLE=Attention : L'attribut password n'a pas \u00e9t\u00e9 cod\u00e9 car il faisait r\u00e9f\u00e9rence \u00e0 une variable. Pour am\u00e9liorer la s\u00e9curit\u00e9 du serveur, localisez la variable r\u00e9f\u00e9renc\u00e9e et v\u00e9rifiez que la valeur est cod\u00e9e.
LOG_WARNING_PW_NOT_ENCODED_EXCEPT=Attention : L''attribut password n''a pas \u00e9t\u00e9 cod\u00e9 en raison de l''exception suivante :\n {0}
LOG_WARNING_PW_NOT_ENCODED_UTILITY=Attention : Les attributs de mot de passe n'ont pas \u00e9t\u00e9 encod\u00e9s, car le r\u00e9pertoire bin Liberty est introuvable.

LOG_BINARY_SCANNER_NOT_FOUND=Le scanner binaire est introuvable sur le syst\u00e8me de fichiers. Par cons\u00e9quent, la configuration de MongoDB peut \u00eatre manquante. V\u00e9rifiez que vous avez inclus toute configuration n\u00e9cessaire si votre application utilise MongoDB.
LOG_RULE_DIR_NOT_CREATED=Un r\u00e9pertoire temporaire n'a pas pu \u00eatre cr\u00e9\u00e9 sur le syst\u00e8me de fichiers. Par cons\u00e9quent, la configuration de MongoDB peut \u00eatre manquante. V\u00e9rifiez que vous avez inclus toute configuration n\u00e9cessaire si votre application utilise MongoDB.
LOG_RULE_FILE_NOT_COPIED=La r\u00e8gle permettant de d\u00e9tecter l'utilisation de Mongo n'a pas pu \u00eatre copi\u00e9e dans le syst\u00e8me de fichiers. Par cons\u00e9quent, la configuration de Mongo peut \u00eatre manquante. V\u00e9rifiez que vous avez inclus toute configuration n\u00e9cessaire si votre application utilise MongoDB.
LOG_BINARY_SCAN_FAILURE=Echec de l'ex\u00e9cution du scanner binaire. Par cons\u00e9quent, la configuration de MongoDB peut \u00eatre manquante. V\u00e9rifiez que vous avez inclus toute configuration n\u00e9cessaire si votre application utilise MongoDB.
LOG_SCAN_OUTPUT_FILE_FAILURE=Le fichier de sortie pour le scanner binaire n\u2019a pas pu \u00eatre cr\u00e9\u00e9 \u00e0 cause de l\u2019erreur suivante :\n{0}
LOG_MONGO_EXCEPTION=L''exception suivante s''est produite lors de l''analyse de l''application pour l''utilisation de MongoDB:\n{0}

TITLE_APP_CONFIG=Migration de configuration d'application Tomcat
TITLE_SERVER_CONFIG=Migration de configuration de serveur Tomcat
